module @m {
  func.func @convnext_train_step(%x: tensor<32x150528xf32>, %psW: tensor<96x3x4x4xf32>, %psb: tensor<96xf32>, %s0b0dW: tensor<96x1x7x7xf32>, %s0b0db: tensor<96xf32>, %s0b0ng: tensor<f32>, %s0b0nbt: tensor<f32>, %s0b0eW: tensor<384x96x1x1xf32>, %s0b0eb: tensor<384xf32>, %s0b0pW: tensor<96x384x1x1xf32>, %s0b0pb: tensor<96xf32>, %s0b0lg: tensor<96xf32>, %s0b1dW: tensor<96x1x7x7xf32>, %s0b1db: tensor<96xf32>, %s0b1ng: tensor<f32>, %s0b1nbt: tensor<f32>, %s0b1eW: tensor<384x96x1x1xf32>, %s0b1eb: tensor<384xf32>, %s0b1pW: tensor<96x384x1x1xf32>, %s0b1pb: tensor<96xf32>, %s0b1lg: tensor<96xf32>, %s0b2dW: tensor<96x1x7x7xf32>, %s0b2db: tensor<96xf32>, %s0b2ng: tensor<f32>, %s0b2nbt: tensor<f32>, %s0b2eW: tensor<384x96x1x1xf32>, %s0b2eb: tensor<384xf32>, %s0b2pW: tensor<96x384x1x1xf32>, %s0b2pb: tensor<96xf32>, %s0b2lg: tensor<96xf32>, %d0ng: tensor<f32>, %d0nbt: tensor<f32>, %d0W: tensor<192x96x2x2xf32>, %d0b: tensor<192xf32>, %s1b0dW: tensor<192x1x7x7xf32>, %s1b0db: tensor<192xf32>, %s1b0ng: tensor<f32>, %s1b0nbt: tensor<f32>, %s1b0eW: tensor<768x192x1x1xf32>, %s1b0eb: tensor<768xf32>, %s1b0pW: tensor<192x768x1x1xf32>, %s1b0pb: tensor<192xf32>, %s1b0lg: tensor<192xf32>, %s1b1dW: tensor<192x1x7x7xf32>, %s1b1db: tensor<192xf32>, %s1b1ng: tensor<f32>, %s1b1nbt: tensor<f32>, %s1b1eW: tensor<768x192x1x1xf32>, %s1b1eb: tensor<768xf32>, %s1b1pW: tensor<192x768x1x1xf32>, %s1b1pb: tensor<192xf32>, %s1b1lg: tensor<192xf32>, %s1b2dW: tensor<192x1x7x7xf32>, %s1b2db: tensor<192xf32>, %s1b2ng: tensor<f32>, %s1b2nbt: tensor<f32>, %s1b2eW: tensor<768x192x1x1xf32>, %s1b2eb: tensor<768xf32>, %s1b2pW: tensor<192x768x1x1xf32>, %s1b2pb: tensor<192xf32>, %s1b2lg: tensor<192xf32>, %d1ng: tensor<f32>, %d1nbt: tensor<f32>, %d1W: tensor<384x192x2x2xf32>, %d1b: tensor<384xf32>, %s2b0dW: tensor<384x1x7x7xf32>, %s2b0db: tensor<384xf32>, %s2b0ng: tensor<f32>, %s2b0nbt: tensor<f32>, %s2b0eW: tensor<1536x384x1x1xf32>, %s2b0eb: tensor<1536xf32>, %s2b0pW: tensor<384x1536x1x1xf32>, %s2b0pb: tensor<384xf32>, %s2b0lg: tensor<384xf32>, %s2b1dW: tensor<384x1x7x7xf32>, %s2b1db: tensor<384xf32>, %s2b1ng: tensor<f32>, %s2b1nbt: tensor<f32>, %s2b1eW: tensor<1536x384x1x1xf32>, %s2b1eb: tensor<1536xf32>, %s2b1pW: tensor<384x1536x1x1xf32>, %s2b1pb: tensor<384xf32>, %s2b1lg: tensor<384xf32>, %s2b2dW: tensor<384x1x7x7xf32>, %s2b2db: tensor<384xf32>, %s2b2ng: tensor<f32>, %s2b2nbt: tensor<f32>, %s2b2eW: tensor<1536x384x1x1xf32>, %s2b2eb: tensor<1536xf32>, %s2b2pW: tensor<384x1536x1x1xf32>, %s2b2pb: tensor<384xf32>, %s2b2lg: tensor<384xf32>, %s2b3dW: tensor<384x1x7x7xf32>, %s2b3db: tensor<384xf32>, %s2b3ng: tensor<f32>, %s2b3nbt: tensor<f32>, %s2b3eW: tensor<1536x384x1x1xf32>, %s2b3eb: tensor<1536xf32>, %s2b3pW: tensor<384x1536x1x1xf32>, %s2b3pb: tensor<384xf32>, %s2b3lg: tensor<384xf32>, %s2b4dW: tensor<384x1x7x7xf32>, %s2b4db: tensor<384xf32>, %s2b4ng: tensor<f32>, %s2b4nbt: tensor<f32>, %s2b4eW: tensor<1536x384x1x1xf32>, %s2b4eb: tensor<1536xf32>, %s2b4pW: tensor<384x1536x1x1xf32>, %s2b4pb: tensor<384xf32>, %s2b4lg: tensor<384xf32>, %s2b5dW: tensor<384x1x7x7xf32>, %s2b5db: tensor<384xf32>, %s2b5ng: tensor<f32>, %s2b5nbt: tensor<f32>, %s2b5eW: tensor<1536x384x1x1xf32>, %s2b5eb: tensor<1536xf32>, %s2b5pW: tensor<384x1536x1x1xf32>, %s2b5pb: tensor<384xf32>, %s2b5lg: tensor<384xf32>, %s2b6dW: tensor<384x1x7x7xf32>, %s2b6db: tensor<384xf32>, %s2b6ng: tensor<f32>, %s2b6nbt: tensor<f32>, %s2b6eW: tensor<1536x384x1x1xf32>, %s2b6eb: tensor<1536xf32>, %s2b6pW: tensor<384x1536x1x1xf32>, %s2b6pb: tensor<384xf32>, %s2b6lg: tensor<384xf32>, %s2b7dW: tensor<384x1x7x7xf32>, %s2b7db: tensor<384xf32>, %s2b7ng: tensor<f32>, %s2b7nbt: tensor<f32>, %s2b7eW: tensor<1536x384x1x1xf32>, %s2b7eb: tensor<1536xf32>, %s2b7pW: tensor<384x1536x1x1xf32>, %s2b7pb: tensor<384xf32>, %s2b7lg: tensor<384xf32>, %s2b8dW: tensor<384x1x7x7xf32>, %s2b8db: tensor<384xf32>, %s2b8ng: tensor<f32>, %s2b8nbt: tensor<f32>, %s2b8eW: tensor<1536x384x1x1xf32>, %s2b8eb: tensor<1536xf32>, %s2b8pW: tensor<384x1536x1x1xf32>, %s2b8pb: tensor<384xf32>, %s2b8lg: tensor<384xf32>, %d2ng: tensor<f32>, %d2nbt: tensor<f32>, %d2W: tensor<768x384x2x2xf32>, %d2b: tensor<768xf32>, %s3b0dW: tensor<768x1x7x7xf32>, %s3b0db: tensor<768xf32>, %s3b0ng: tensor<f32>, %s3b0nbt: tensor<f32>, %s3b0eW: tensor<3072x768x1x1xf32>, %s3b0eb: tensor<3072xf32>, %s3b0pW: tensor<768x3072x1x1xf32>, %s3b0pb: tensor<768xf32>, %s3b0lg: tensor<768xf32>, %s3b1dW: tensor<768x1x7x7xf32>, %s3b1db: tensor<768xf32>, %s3b1ng: tensor<f32>, %s3b1nbt: tensor<f32>, %s3b1eW: tensor<3072x768x1x1xf32>, %s3b1eb: tensor<3072xf32>, %s3b1pW: tensor<768x3072x1x1xf32>, %s3b1pb: tensor<768xf32>, %s3b1lg: tensor<768xf32>, %s3b2dW: tensor<768x1x7x7xf32>, %s3b2db: tensor<768xf32>, %s3b2ng: tensor<f32>, %s3b2nbt: tensor<f32>, %s3b2eW: tensor<3072x768x1x1xf32>, %s3b2eb: tensor<3072xf32>, %s3b2pW: tensor<768x3072x1x1xf32>, %s3b2pb: tensor<768xf32>, %s3b2lg: tensor<768xf32>, %hng: tensor<f32>, %hnbt: tensor<f32>, %Wd: tensor<768x10xf32>, %bd: tensor<10xf32>, %onehot: tensor<32x10xf32>) -> (tensor<96x3x4x4xf32>, tensor<96xf32>, tensor<96x1x7x7xf32>, tensor<96xf32>, tensor<f32>, tensor<f32>, tensor<384x96x1x1xf32>, tensor<384xf32>, tensor<96x384x1x1xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96x1x7x7xf32>, tensor<96xf32>, tensor<f32>, tensor<f32>, tensor<384x96x1x1xf32>, tensor<384xf32>, tensor<96x384x1x1xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96x1x7x7xf32>, tensor<96xf32>, tensor<f32>, tensor<f32>, tensor<384x96x1x1xf32>, tensor<384xf32>, tensor<96x384x1x1xf32>, tensor<96xf32>, tensor<96xf32>, tensor<f32>, tensor<f32>, tensor<192x96x2x2xf32>, tensor<192xf32>, tensor<192x1x7x7xf32>, tensor<192xf32>, tensor<f32>, tensor<f32>, tensor<768x192x1x1xf32>, tensor<768xf32>, tensor<192x768x1x1xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x1x7x7xf32>, tensor<192xf32>, tensor<f32>, tensor<f32>, tensor<768x192x1x1xf32>, tensor<768xf32>, tensor<192x768x1x1xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x1x7x7xf32>, tensor<192xf32>, tensor<f32>, tensor<f32>, tensor<768x192x1x1xf32>, tensor<768xf32>, tensor<192x768x1x1xf32>, tensor<192xf32>, tensor<192xf32>, tensor<f32>, tensor<f32>, tensor<384x192x2x2xf32>, tensor<384xf32>, tensor<384x1x7x7xf32>, tensor<384xf32>, tensor<f32>, tensor<f32>, tensor<1536x384x1x1xf32>, tensor<1536xf32>, tensor<384x1536x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x7x7xf32>, tensor<384xf32>, tensor<f32>, tensor<f32>, tensor<1536x384x1x1xf32>, tensor<1536xf32>, tensor<384x1536x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x7x7xf32>, tensor<384xf32>, tensor<f32>, tensor<f32>, tensor<1536x384x1x1xf32>, tensor<1536xf32>, tensor<384x1536x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x7x7xf32>, tensor<384xf32>, tensor<f32>, tensor<f32>, tensor<1536x384x1x1xf32>, tensor<1536xf32>, tensor<384x1536x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x7x7xf32>, tensor<384xf32>, tensor<f32>, tensor<f32>, tensor<1536x384x1x1xf32>, tensor<1536xf32>, tensor<384x1536x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x7x7xf32>, tensor<384xf32>, tensor<f32>, tensor<f32>, tensor<1536x384x1x1xf32>, tensor<1536xf32>, tensor<384x1536x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x7x7xf32>, tensor<384xf32>, tensor<f32>, tensor<f32>, tensor<1536x384x1x1xf32>, tensor<1536xf32>, tensor<384x1536x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x7x7xf32>, tensor<384xf32>, tensor<f32>, tensor<f32>, tensor<1536x384x1x1xf32>, tensor<1536xf32>, tensor<384x1536x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x7x7xf32>, tensor<384xf32>, tensor<f32>, tensor<f32>, tensor<1536x384x1x1xf32>, tensor<1536xf32>, tensor<384x1536x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<f32>, tensor<f32>, tensor<768x384x2x2xf32>, tensor<768xf32>, tensor<768x1x7x7xf32>, tensor<768xf32>, tensor<f32>, tensor<f32>, tensor<3072x768x1x1xf32>, tensor<3072xf32>, tensor<768x3072x1x1xf32>, tensor<768xf32>, tensor<768xf32>, tensor<768x1x7x7xf32>, tensor<768xf32>, tensor<f32>, tensor<f32>, tensor<3072x768x1x1xf32>, tensor<3072xf32>, tensor<768x3072x1x1xf32>, tensor<768xf32>, tensor<768xf32>, tensor<768x1x7x7xf32>, tensor<768xf32>, tensor<f32>, tensor<f32>, tensor<3072x768x1x1xf32>, tensor<3072xf32>, tensor<768x3072x1x1xf32>, tensor<768xf32>, tensor<768xf32>, tensor<f32>, tensor<f32>, tensor<768x10xf32>, tensor<10xf32>) {
    %sc = stablehlo.constant dense<0.0> : tensor<f32>
    %xr = stablehlo.reshape %x : (tensor<32x150528xf32>) -> tensor<32x3x224x224xf32>
    %psc = stablehlo.convolution(%xr, %psW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [4, 4], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x3x224x224xf32>, tensor<96x3x4x4xf32>) -> tensor<32x96x56x56xf32>
    %psbb = stablehlo.broadcast_in_dim %psb, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %ps = stablehlo.add %psc, %psbb : tensor<32x96x56x56xf32>
    %s0b0dc = stablehlo.convolution(%ps, %s0b0dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[3, 3], [3, 3]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 96 : i64} : (tensor<32x96x56x56xf32>, tensor<96x1x7x7xf32>) -> tensor<32x96x56x56xf32>
    %s0b0dbb = stablehlo.broadcast_in_dim %s0b0db, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %s0b0d = stablehlo.add %s0b0dc, %s0b0dbb : tensor<32x96x56x56xf32>
    %s0b0nri = stablehlo.reshape %s0b0d : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %s0b0nnf = stablehlo.constant dense<301056.0> : tensor<32x301056xf32>
    %s0b0nep = stablehlo.constant dense<1.0e-6> : tensor<32x301056xf32>
    %s0b0nsmr = stablehlo.reduce(%s0b0nri init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x301056xf32>, tensor<f32>) -> tensor<32xf32>
    %s0b0nsm = stablehlo.broadcast_in_dim %s0b0nsmr, dims = [0] : (tensor<32xf32>) -> tensor<32x301056xf32>
    %s0b0nmu = stablehlo.divide %s0b0nsm, %s0b0nnf : tensor<32x301056xf32>
    %s0b0nxc = stablehlo.subtract %s0b0nri, %s0b0nmu : tensor<32x301056xf32>
    %s0b0nsq = stablehlo.multiply %s0b0nxc, %s0b0nxc : tensor<32x301056xf32>
    %s0b0nvsr = stablehlo.reduce(%s0b0nsq init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x301056xf32>, tensor<f32>) -> tensor<32xf32>
    %s0b0nvs = stablehlo.broadcast_in_dim %s0b0nvsr, dims = [0] : (tensor<32xf32>) -> tensor<32x301056xf32>
    %s0b0nvr = stablehlo.divide %s0b0nvs, %s0b0nnf : tensor<32x301056xf32>
    %s0b0nve = stablehlo.add %s0b0nvr, %s0b0nep : tensor<32x301056xf32>
    %s0b0nistd = stablehlo.rsqrt %s0b0nve : tensor<32x301056xf32>
    %s0b0nxh = stablehlo.multiply %s0b0nxc, %s0b0nistd : tensor<32x301056xf32>
    %s0b0ngb = stablehlo.broadcast_in_dim %s0b0ng, dims = [] : (tensor<f32>) -> tensor<32x301056xf32>
    %s0b0nbtb = stablehlo.broadcast_in_dim %s0b0nbt, dims = [] : (tensor<f32>) -> tensor<32x301056xf32>
    %s0b0ngx = stablehlo.multiply %s0b0nxh, %s0b0ngb : tensor<32x301056xf32>
    %s0b0nfl = stablehlo.add %s0b0ngx, %s0b0nbtb : tensor<32x301056xf32>
    %s0b0n = stablehlo.reshape %s0b0nfl : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %s0b0ec = stablehlo.convolution(%s0b0n, %s0b0eW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x96x56x56xf32>, tensor<384x96x1x1xf32>) -> tensor<32x384x56x56xf32>
    %s0b0ebb = stablehlo.broadcast_in_dim %s0b0eb, dims = [1] : (tensor<384xf32>) -> tensor<32x384x56x56xf32>
    %s0b0e = stablehlo.add %s0b0ec, %s0b0ebb : tensor<32x384x56x56xf32>
    %s0b0gx2 = stablehlo.multiply %s0b0e, %s0b0e : tensor<32x384x56x56xf32>
    %s0b0gx3 = stablehlo.multiply %s0b0gx2, %s0b0e : tensor<32x384x56x56xf32>
    %s0b0gck = stablehlo.constant dense<0.044715> : tensor<32x384x56x56xf32>
    %s0b0gkx3 = stablehlo.multiply %s0b0gck, %s0b0gx3 : tensor<32x384x56x56xf32>
    %s0b0ginn = stablehlo.add %s0b0e, %s0b0gkx3 : tensor<32x384x56x56xf32>
    %s0b0gcs = stablehlo.constant dense<0.7978845608028654> : tensor<32x384x56x56xf32>
    %s0b0gu = stablehlo.multiply %s0b0gcs, %s0b0ginn : tensor<32x384x56x56xf32>
    %s0b0gt = stablehlo.tanh %s0b0gu : tensor<32x384x56x56xf32>
    %s0b0gone = stablehlo.constant dense<1.0> : tensor<32x384x56x56xf32>
    %s0b0gopt = stablehlo.add %s0b0gone, %s0b0gt : tensor<32x384x56x56xf32>
    %s0b0ghalf = stablehlo.constant dense<0.5> : tensor<32x384x56x56xf32>
    %s0b0ghx = stablehlo.multiply %s0b0ghalf, %s0b0e : tensor<32x384x56x56xf32>
    %s0b0g = stablehlo.multiply %s0b0ghx, %s0b0gopt : tensor<32x384x56x56xf32>
    %s0b0pc = stablehlo.convolution(%s0b0g, %s0b0pW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x384x56x56xf32>, tensor<96x384x1x1xf32>) -> tensor<32x96x56x56xf32>
    %s0b0pbb = stablehlo.broadcast_in_dim %s0b0pb, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %s0b0p = stablehlo.add %s0b0pc, %s0b0pbb : tensor<32x96x56x56xf32>
    %s0b0lsgb = stablehlo.broadcast_in_dim %s0b0lg, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %s0b0ls = stablehlo.multiply %s0b0p, %s0b0lsgb : tensor<32x96x56x56xf32>
    %s0b0o = stablehlo.add %s0b0ls, %ps : tensor<32x96x56x56xf32>
    %s0b1dc = stablehlo.convolution(%s0b0o, %s0b1dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[3, 3], [3, 3]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 96 : i64} : (tensor<32x96x56x56xf32>, tensor<96x1x7x7xf32>) -> tensor<32x96x56x56xf32>
    %s0b1dbb = stablehlo.broadcast_in_dim %s0b1db, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %s0b1d = stablehlo.add %s0b1dc, %s0b1dbb : tensor<32x96x56x56xf32>
    %s0b1nri = stablehlo.reshape %s0b1d : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %s0b1nnf = stablehlo.constant dense<301056.0> : tensor<32x301056xf32>
    %s0b1nep = stablehlo.constant dense<1.0e-6> : tensor<32x301056xf32>
    %s0b1nsmr = stablehlo.reduce(%s0b1nri init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x301056xf32>, tensor<f32>) -> tensor<32xf32>
    %s0b1nsm = stablehlo.broadcast_in_dim %s0b1nsmr, dims = [0] : (tensor<32xf32>) -> tensor<32x301056xf32>
    %s0b1nmu = stablehlo.divide %s0b1nsm, %s0b1nnf : tensor<32x301056xf32>
    %s0b1nxc = stablehlo.subtract %s0b1nri, %s0b1nmu : tensor<32x301056xf32>
    %s0b1nsq = stablehlo.multiply %s0b1nxc, %s0b1nxc : tensor<32x301056xf32>
    %s0b1nvsr = stablehlo.reduce(%s0b1nsq init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x301056xf32>, tensor<f32>) -> tensor<32xf32>
    %s0b1nvs = stablehlo.broadcast_in_dim %s0b1nvsr, dims = [0] : (tensor<32xf32>) -> tensor<32x301056xf32>
    %s0b1nvr = stablehlo.divide %s0b1nvs, %s0b1nnf : tensor<32x301056xf32>
    %s0b1nve = stablehlo.add %s0b1nvr, %s0b1nep : tensor<32x301056xf32>
    %s0b1nistd = stablehlo.rsqrt %s0b1nve : tensor<32x301056xf32>
    %s0b1nxh = stablehlo.multiply %s0b1nxc, %s0b1nistd : tensor<32x301056xf32>
    %s0b1ngb = stablehlo.broadcast_in_dim %s0b1ng, dims = [] : (tensor<f32>) -> tensor<32x301056xf32>
    %s0b1nbtb = stablehlo.broadcast_in_dim %s0b1nbt, dims = [] : (tensor<f32>) -> tensor<32x301056xf32>
    %s0b1ngx = stablehlo.multiply %s0b1nxh, %s0b1ngb : tensor<32x301056xf32>
    %s0b1nfl = stablehlo.add %s0b1ngx, %s0b1nbtb : tensor<32x301056xf32>
    %s0b1n = stablehlo.reshape %s0b1nfl : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %s0b1ec = stablehlo.convolution(%s0b1n, %s0b1eW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x96x56x56xf32>, tensor<384x96x1x1xf32>) -> tensor<32x384x56x56xf32>
    %s0b1ebb = stablehlo.broadcast_in_dim %s0b1eb, dims = [1] : (tensor<384xf32>) -> tensor<32x384x56x56xf32>
    %s0b1e = stablehlo.add %s0b1ec, %s0b1ebb : tensor<32x384x56x56xf32>
    %s0b1gx2 = stablehlo.multiply %s0b1e, %s0b1e : tensor<32x384x56x56xf32>
    %s0b1gx3 = stablehlo.multiply %s0b1gx2, %s0b1e : tensor<32x384x56x56xf32>
    %s0b1gck = stablehlo.constant dense<0.044715> : tensor<32x384x56x56xf32>
    %s0b1gkx3 = stablehlo.multiply %s0b1gck, %s0b1gx3 : tensor<32x384x56x56xf32>
    %s0b1ginn = stablehlo.add %s0b1e, %s0b1gkx3 : tensor<32x384x56x56xf32>
    %s0b1gcs = stablehlo.constant dense<0.7978845608028654> : tensor<32x384x56x56xf32>
    %s0b1gu = stablehlo.multiply %s0b1gcs, %s0b1ginn : tensor<32x384x56x56xf32>
    %s0b1gt = stablehlo.tanh %s0b1gu : tensor<32x384x56x56xf32>
    %s0b1gone = stablehlo.constant dense<1.0> : tensor<32x384x56x56xf32>
    %s0b1gopt = stablehlo.add %s0b1gone, %s0b1gt : tensor<32x384x56x56xf32>
    %s0b1ghalf = stablehlo.constant dense<0.5> : tensor<32x384x56x56xf32>
    %s0b1ghx = stablehlo.multiply %s0b1ghalf, %s0b1e : tensor<32x384x56x56xf32>
    %s0b1g = stablehlo.multiply %s0b1ghx, %s0b1gopt : tensor<32x384x56x56xf32>
    %s0b1pc = stablehlo.convolution(%s0b1g, %s0b1pW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x384x56x56xf32>, tensor<96x384x1x1xf32>) -> tensor<32x96x56x56xf32>
    %s0b1pbb = stablehlo.broadcast_in_dim %s0b1pb, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %s0b1p = stablehlo.add %s0b1pc, %s0b1pbb : tensor<32x96x56x56xf32>
    %s0b1lsgb = stablehlo.broadcast_in_dim %s0b1lg, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %s0b1ls = stablehlo.multiply %s0b1p, %s0b1lsgb : tensor<32x96x56x56xf32>
    %s0b1o = stablehlo.add %s0b1ls, %s0b0o : tensor<32x96x56x56xf32>
    %s0b2dc = stablehlo.convolution(%s0b1o, %s0b2dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[3, 3], [3, 3]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 96 : i64} : (tensor<32x96x56x56xf32>, tensor<96x1x7x7xf32>) -> tensor<32x96x56x56xf32>
    %s0b2dbb = stablehlo.broadcast_in_dim %s0b2db, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %s0b2d = stablehlo.add %s0b2dc, %s0b2dbb : tensor<32x96x56x56xf32>
    %s0b2nri = stablehlo.reshape %s0b2d : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %s0b2nnf = stablehlo.constant dense<301056.0> : tensor<32x301056xf32>
    %s0b2nep = stablehlo.constant dense<1.0e-6> : tensor<32x301056xf32>
    %s0b2nsmr = stablehlo.reduce(%s0b2nri init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x301056xf32>, tensor<f32>) -> tensor<32xf32>
    %s0b2nsm = stablehlo.broadcast_in_dim %s0b2nsmr, dims = [0] : (tensor<32xf32>) -> tensor<32x301056xf32>
    %s0b2nmu = stablehlo.divide %s0b2nsm, %s0b2nnf : tensor<32x301056xf32>
    %s0b2nxc = stablehlo.subtract %s0b2nri, %s0b2nmu : tensor<32x301056xf32>
    %s0b2nsq = stablehlo.multiply %s0b2nxc, %s0b2nxc : tensor<32x301056xf32>
    %s0b2nvsr = stablehlo.reduce(%s0b2nsq init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x301056xf32>, tensor<f32>) -> tensor<32xf32>
    %s0b2nvs = stablehlo.broadcast_in_dim %s0b2nvsr, dims = [0] : (tensor<32xf32>) -> tensor<32x301056xf32>
    %s0b2nvr = stablehlo.divide %s0b2nvs, %s0b2nnf : tensor<32x301056xf32>
    %s0b2nve = stablehlo.add %s0b2nvr, %s0b2nep : tensor<32x301056xf32>
    %s0b2nistd = stablehlo.rsqrt %s0b2nve : tensor<32x301056xf32>
    %s0b2nxh = stablehlo.multiply %s0b2nxc, %s0b2nistd : tensor<32x301056xf32>
    %s0b2ngb = stablehlo.broadcast_in_dim %s0b2ng, dims = [] : (tensor<f32>) -> tensor<32x301056xf32>
    %s0b2nbtb = stablehlo.broadcast_in_dim %s0b2nbt, dims = [] : (tensor<f32>) -> tensor<32x301056xf32>
    %s0b2ngx = stablehlo.multiply %s0b2nxh, %s0b2ngb : tensor<32x301056xf32>
    %s0b2nfl = stablehlo.add %s0b2ngx, %s0b2nbtb : tensor<32x301056xf32>
    %s0b2n = stablehlo.reshape %s0b2nfl : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %s0b2ec = stablehlo.convolution(%s0b2n, %s0b2eW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x96x56x56xf32>, tensor<384x96x1x1xf32>) -> tensor<32x384x56x56xf32>
    %s0b2ebb = stablehlo.broadcast_in_dim %s0b2eb, dims = [1] : (tensor<384xf32>) -> tensor<32x384x56x56xf32>
    %s0b2e = stablehlo.add %s0b2ec, %s0b2ebb : tensor<32x384x56x56xf32>
    %s0b2gx2 = stablehlo.multiply %s0b2e, %s0b2e : tensor<32x384x56x56xf32>
    %s0b2gx3 = stablehlo.multiply %s0b2gx2, %s0b2e : tensor<32x384x56x56xf32>
    %s0b2gck = stablehlo.constant dense<0.044715> : tensor<32x384x56x56xf32>
    %s0b2gkx3 = stablehlo.multiply %s0b2gck, %s0b2gx3 : tensor<32x384x56x56xf32>
    %s0b2ginn = stablehlo.add %s0b2e, %s0b2gkx3 : tensor<32x384x56x56xf32>
    %s0b2gcs = stablehlo.constant dense<0.7978845608028654> : tensor<32x384x56x56xf32>
    %s0b2gu = stablehlo.multiply %s0b2gcs, %s0b2ginn : tensor<32x384x56x56xf32>
    %s0b2gt = stablehlo.tanh %s0b2gu : tensor<32x384x56x56xf32>
    %s0b2gone = stablehlo.constant dense<1.0> : tensor<32x384x56x56xf32>
    %s0b2gopt = stablehlo.add %s0b2gone, %s0b2gt : tensor<32x384x56x56xf32>
    %s0b2ghalf = stablehlo.constant dense<0.5> : tensor<32x384x56x56xf32>
    %s0b2ghx = stablehlo.multiply %s0b2ghalf, %s0b2e : tensor<32x384x56x56xf32>
    %s0b2g = stablehlo.multiply %s0b2ghx, %s0b2gopt : tensor<32x384x56x56xf32>
    %s0b2pc = stablehlo.convolution(%s0b2g, %s0b2pW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x384x56x56xf32>, tensor<96x384x1x1xf32>) -> tensor<32x96x56x56xf32>
    %s0b2pbb = stablehlo.broadcast_in_dim %s0b2pb, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %s0b2p = stablehlo.add %s0b2pc, %s0b2pbb : tensor<32x96x56x56xf32>
    %s0b2lsgb = stablehlo.broadcast_in_dim %s0b2lg, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %s0b2ls = stablehlo.multiply %s0b2p, %s0b2lsgb : tensor<32x96x56x56xf32>
    %s0b2o = stablehlo.add %s0b2ls, %s0b1o : tensor<32x96x56x56xf32>
    %d0nri = stablehlo.reshape %s0b2o : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %d0nnf = stablehlo.constant dense<301056.0> : tensor<32x301056xf32>
    %d0nep = stablehlo.constant dense<1.0e-6> : tensor<32x301056xf32>
    %d0nsmr = stablehlo.reduce(%d0nri init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x301056xf32>, tensor<f32>) -> tensor<32xf32>
    %d0nsm = stablehlo.broadcast_in_dim %d0nsmr, dims = [0] : (tensor<32xf32>) -> tensor<32x301056xf32>
    %d0nmu = stablehlo.divide %d0nsm, %d0nnf : tensor<32x301056xf32>
    %d0nxc = stablehlo.subtract %d0nri, %d0nmu : tensor<32x301056xf32>
    %d0nsq = stablehlo.multiply %d0nxc, %d0nxc : tensor<32x301056xf32>
    %d0nvsr = stablehlo.reduce(%d0nsq init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x301056xf32>, tensor<f32>) -> tensor<32xf32>
    %d0nvs = stablehlo.broadcast_in_dim %d0nvsr, dims = [0] : (tensor<32xf32>) -> tensor<32x301056xf32>
    %d0nvr = stablehlo.divide %d0nvs, %d0nnf : tensor<32x301056xf32>
    %d0nve = stablehlo.add %d0nvr, %d0nep : tensor<32x301056xf32>
    %d0nistd = stablehlo.rsqrt %d0nve : tensor<32x301056xf32>
    %d0nxh = stablehlo.multiply %d0nxc, %d0nistd : tensor<32x301056xf32>
    %d0ngb = stablehlo.broadcast_in_dim %d0ng, dims = [] : (tensor<f32>) -> tensor<32x301056xf32>
    %d0nbtb = stablehlo.broadcast_in_dim %d0nbt, dims = [] : (tensor<f32>) -> tensor<32x301056xf32>
    %d0ngx = stablehlo.multiply %d0nxh, %d0ngb : tensor<32x301056xf32>
    %d0nfl = stablehlo.add %d0ngx, %d0nbtb : tensor<32x301056xf32>
    %d0n = stablehlo.reshape %d0nfl : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %d0cc = stablehlo.convolution(%d0n, %d0W)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x96x56x56xf32>, tensor<192x96x2x2xf32>) -> tensor<32x192x28x28xf32>
    %d0cbb = stablehlo.broadcast_in_dim %d0b, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %d0c = stablehlo.add %d0cc, %d0cbb : tensor<32x192x28x28xf32>
    %s1b0dc = stablehlo.convolution(%d0c, %s1b0dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[3, 3], [3, 3]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 192 : i64} : (tensor<32x192x28x28xf32>, tensor<192x1x7x7xf32>) -> tensor<32x192x28x28xf32>
    %s1b0dbb = stablehlo.broadcast_in_dim %s1b0db, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %s1b0d = stablehlo.add %s1b0dc, %s1b0dbb : tensor<32x192x28x28xf32>
    %s1b0nri = stablehlo.reshape %s1b0d : (tensor<32x192x28x28xf32>) -> tensor<32x150528xf32>
    %s1b0nnf = stablehlo.constant dense<150528.0> : tensor<32x150528xf32>
    %s1b0nep = stablehlo.constant dense<1.0e-6> : tensor<32x150528xf32>
    %s1b0nsmr = stablehlo.reduce(%s1b0nri init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x150528xf32>, tensor<f32>) -> tensor<32xf32>
    %s1b0nsm = stablehlo.broadcast_in_dim %s1b0nsmr, dims = [0] : (tensor<32xf32>) -> tensor<32x150528xf32>
    %s1b0nmu = stablehlo.divide %s1b0nsm, %s1b0nnf : tensor<32x150528xf32>
    %s1b0nxc = stablehlo.subtract %s1b0nri, %s1b0nmu : tensor<32x150528xf32>
    %s1b0nsq = stablehlo.multiply %s1b0nxc, %s1b0nxc : tensor<32x150528xf32>
    %s1b0nvsr = stablehlo.reduce(%s1b0nsq init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x150528xf32>, tensor<f32>) -> tensor<32xf32>
    %s1b0nvs = stablehlo.broadcast_in_dim %s1b0nvsr, dims = [0] : (tensor<32xf32>) -> tensor<32x150528xf32>
    %s1b0nvr = stablehlo.divide %s1b0nvs, %s1b0nnf : tensor<32x150528xf32>
    %s1b0nve = stablehlo.add %s1b0nvr, %s1b0nep : tensor<32x150528xf32>
    %s1b0nistd = stablehlo.rsqrt %s1b0nve : tensor<32x150528xf32>
    %s1b0nxh = stablehlo.multiply %s1b0nxc, %s1b0nistd : tensor<32x150528xf32>
    %s1b0ngb = stablehlo.broadcast_in_dim %s1b0ng, dims = [] : (tensor<f32>) -> tensor<32x150528xf32>
    %s1b0nbtb = stablehlo.broadcast_in_dim %s1b0nbt, dims = [] : (tensor<f32>) -> tensor<32x150528xf32>
    %s1b0ngx = stablehlo.multiply %s1b0nxh, %s1b0ngb : tensor<32x150528xf32>
    %s1b0nfl = stablehlo.add %s1b0ngx, %s1b0nbtb : tensor<32x150528xf32>
    %s1b0n = stablehlo.reshape %s1b0nfl : (tensor<32x150528xf32>) -> tensor<32x192x28x28xf32>
    %s1b0ec = stablehlo.convolution(%s1b0n, %s1b0eW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x192x28x28xf32>, tensor<768x192x1x1xf32>) -> tensor<32x768x28x28xf32>
    %s1b0ebb = stablehlo.broadcast_in_dim %s1b0eb, dims = [1] : (tensor<768xf32>) -> tensor<32x768x28x28xf32>
    %s1b0e = stablehlo.add %s1b0ec, %s1b0ebb : tensor<32x768x28x28xf32>
    %s1b0gx2 = stablehlo.multiply %s1b0e, %s1b0e : tensor<32x768x28x28xf32>
    %s1b0gx3 = stablehlo.multiply %s1b0gx2, %s1b0e : tensor<32x768x28x28xf32>
    %s1b0gck = stablehlo.constant dense<0.044715> : tensor<32x768x28x28xf32>
    %s1b0gkx3 = stablehlo.multiply %s1b0gck, %s1b0gx3 : tensor<32x768x28x28xf32>
    %s1b0ginn = stablehlo.add %s1b0e, %s1b0gkx3 : tensor<32x768x28x28xf32>
    %s1b0gcs = stablehlo.constant dense<0.7978845608028654> : tensor<32x768x28x28xf32>
    %s1b0gu = stablehlo.multiply %s1b0gcs, %s1b0ginn : tensor<32x768x28x28xf32>
    %s1b0gt = stablehlo.tanh %s1b0gu : tensor<32x768x28x28xf32>
    %s1b0gone = stablehlo.constant dense<1.0> : tensor<32x768x28x28xf32>
    %s1b0gopt = stablehlo.add %s1b0gone, %s1b0gt : tensor<32x768x28x28xf32>
    %s1b0ghalf = stablehlo.constant dense<0.5> : tensor<32x768x28x28xf32>
    %s1b0ghx = stablehlo.multiply %s1b0ghalf, %s1b0e : tensor<32x768x28x28xf32>
    %s1b0g = stablehlo.multiply %s1b0ghx, %s1b0gopt : tensor<32x768x28x28xf32>
    %s1b0pc = stablehlo.convolution(%s1b0g, %s1b0pW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x768x28x28xf32>, tensor<192x768x1x1xf32>) -> tensor<32x192x28x28xf32>
    %s1b0pbb = stablehlo.broadcast_in_dim %s1b0pb, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %s1b0p = stablehlo.add %s1b0pc, %s1b0pbb : tensor<32x192x28x28xf32>
    %s1b0lsgb = stablehlo.broadcast_in_dim %s1b0lg, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %s1b0ls = stablehlo.multiply %s1b0p, %s1b0lsgb : tensor<32x192x28x28xf32>
    %s1b0o = stablehlo.add %s1b0ls, %d0c : tensor<32x192x28x28xf32>
    %s1b1dc = stablehlo.convolution(%s1b0o, %s1b1dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[3, 3], [3, 3]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 192 : i64} : (tensor<32x192x28x28xf32>, tensor<192x1x7x7xf32>) -> tensor<32x192x28x28xf32>
    %s1b1dbb = stablehlo.broadcast_in_dim %s1b1db, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %s1b1d = stablehlo.add %s1b1dc, %s1b1dbb : tensor<32x192x28x28xf32>
    %s1b1nri = stablehlo.reshape %s1b1d : (tensor<32x192x28x28xf32>) -> tensor<32x150528xf32>
    %s1b1nnf = stablehlo.constant dense<150528.0> : tensor<32x150528xf32>
    %s1b1nep = stablehlo.constant dense<1.0e-6> : tensor<32x150528xf32>
    %s1b1nsmr = stablehlo.reduce(%s1b1nri init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x150528xf32>, tensor<f32>) -> tensor<32xf32>
    %s1b1nsm = stablehlo.broadcast_in_dim %s1b1nsmr, dims = [0] : (tensor<32xf32>) -> tensor<32x150528xf32>
    %s1b1nmu = stablehlo.divide %s1b1nsm, %s1b1nnf : tensor<32x150528xf32>
    %s1b1nxc = stablehlo.subtract %s1b1nri, %s1b1nmu : tensor<32x150528xf32>
    %s1b1nsq = stablehlo.multiply %s1b1nxc, %s1b1nxc : tensor<32x150528xf32>
    %s1b1nvsr = stablehlo.reduce(%s1b1nsq init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x150528xf32>, tensor<f32>) -> tensor<32xf32>
    %s1b1nvs = stablehlo.broadcast_in_dim %s1b1nvsr, dims = [0] : (tensor<32xf32>) -> tensor<32x150528xf32>
    %s1b1nvr = stablehlo.divide %s1b1nvs, %s1b1nnf : tensor<32x150528xf32>
    %s1b1nve = stablehlo.add %s1b1nvr, %s1b1nep : tensor<32x150528xf32>
    %s1b1nistd = stablehlo.rsqrt %s1b1nve : tensor<32x150528xf32>
    %s1b1nxh = stablehlo.multiply %s1b1nxc, %s1b1nistd : tensor<32x150528xf32>
    %s1b1ngb = stablehlo.broadcast_in_dim %s1b1ng, dims = [] : (tensor<f32>) -> tensor<32x150528xf32>
    %s1b1nbtb = stablehlo.broadcast_in_dim %s1b1nbt, dims = [] : (tensor<f32>) -> tensor<32x150528xf32>
    %s1b1ngx = stablehlo.multiply %s1b1nxh, %s1b1ngb : tensor<32x150528xf32>
    %s1b1nfl = stablehlo.add %s1b1ngx, %s1b1nbtb : tensor<32x150528xf32>
    %s1b1n = stablehlo.reshape %s1b1nfl : (tensor<32x150528xf32>) -> tensor<32x192x28x28xf32>
    %s1b1ec = stablehlo.convolution(%s1b1n, %s1b1eW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x192x28x28xf32>, tensor<768x192x1x1xf32>) -> tensor<32x768x28x28xf32>
    %s1b1ebb = stablehlo.broadcast_in_dim %s1b1eb, dims = [1] : (tensor<768xf32>) -> tensor<32x768x28x28xf32>
    %s1b1e = stablehlo.add %s1b1ec, %s1b1ebb : tensor<32x768x28x28xf32>
    %s1b1gx2 = stablehlo.multiply %s1b1e, %s1b1e : tensor<32x768x28x28xf32>
    %s1b1gx3 = stablehlo.multiply %s1b1gx2, %s1b1e : tensor<32x768x28x28xf32>
    %s1b1gck = stablehlo.constant dense<0.044715> : tensor<32x768x28x28xf32>
    %s1b1gkx3 = stablehlo.multiply %s1b1gck, %s1b1gx3 : tensor<32x768x28x28xf32>
    %s1b1ginn = stablehlo.add %s1b1e, %s1b1gkx3 : tensor<32x768x28x28xf32>
    %s1b1gcs = stablehlo.constant dense<0.7978845608028654> : tensor<32x768x28x28xf32>
    %s1b1gu = stablehlo.multiply %s1b1gcs, %s1b1ginn : tensor<32x768x28x28xf32>
    %s1b1gt = stablehlo.tanh %s1b1gu : tensor<32x768x28x28xf32>
    %s1b1gone = stablehlo.constant dense<1.0> : tensor<32x768x28x28xf32>
    %s1b1gopt = stablehlo.add %s1b1gone, %s1b1gt : tensor<32x768x28x28xf32>
    %s1b1ghalf = stablehlo.constant dense<0.5> : tensor<32x768x28x28xf32>
    %s1b1ghx = stablehlo.multiply %s1b1ghalf, %s1b1e : tensor<32x768x28x28xf32>
    %s1b1g = stablehlo.multiply %s1b1ghx, %s1b1gopt : tensor<32x768x28x28xf32>
    %s1b1pc = stablehlo.convolution(%s1b1g, %s1b1pW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x768x28x28xf32>, tensor<192x768x1x1xf32>) -> tensor<32x192x28x28xf32>
    %s1b1pbb = stablehlo.broadcast_in_dim %s1b1pb, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %s1b1p = stablehlo.add %s1b1pc, %s1b1pbb : tensor<32x192x28x28xf32>
    %s1b1lsgb = stablehlo.broadcast_in_dim %s1b1lg, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %s1b1ls = stablehlo.multiply %s1b1p, %s1b1lsgb : tensor<32x192x28x28xf32>
    %s1b1o = stablehlo.add %s1b1ls, %s1b0o : tensor<32x192x28x28xf32>
    %s1b2dc = stablehlo.convolution(%s1b1o, %s1b2dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[3, 3], [3, 3]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 192 : i64} : (tensor<32x192x28x28xf32>, tensor<192x1x7x7xf32>) -> tensor<32x192x28x28xf32>
    %s1b2dbb = stablehlo.broadcast_in_dim %s1b2db, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %s1b2d = stablehlo.add %s1b2dc, %s1b2dbb : tensor<32x192x28x28xf32>
    %s1b2nri = stablehlo.reshape %s1b2d : (tensor<32x192x28x28xf32>) -> tensor<32x150528xf32>
    %s1b2nnf = stablehlo.constant dense<150528.0> : tensor<32x150528xf32>
    %s1b2nep = stablehlo.constant dense<1.0e-6> : tensor<32x150528xf32>
    %s1b2nsmr = stablehlo.reduce(%s1b2nri init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x150528xf32>, tensor<f32>) -> tensor<32xf32>
    %s1b2nsm = stablehlo.broadcast_in_dim %s1b2nsmr, dims = [0] : (tensor<32xf32>) -> tensor<32x150528xf32>
    %s1b2nmu = stablehlo.divide %s1b2nsm, %s1b2nnf : tensor<32x150528xf32>
    %s1b2nxc = stablehlo.subtract %s1b2nri, %s1b2nmu : tensor<32x150528xf32>
    %s1b2nsq = stablehlo.multiply %s1b2nxc, %s1b2nxc : tensor<32x150528xf32>
    %s1b2nvsr = stablehlo.reduce(%s1b2nsq init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x150528xf32>, tensor<f32>) -> tensor<32xf32>
    %s1b2nvs = stablehlo.broadcast_in_dim %s1b2nvsr, dims = [0] : (tensor<32xf32>) -> tensor<32x150528xf32>
    %s1b2nvr = stablehlo.divide %s1b2nvs, %s1b2nnf : tensor<32x150528xf32>
    %s1b2nve = stablehlo.add %s1b2nvr, %s1b2nep : tensor<32x150528xf32>
    %s1b2nistd = stablehlo.rsqrt %s1b2nve : tensor<32x150528xf32>
    %s1b2nxh = stablehlo.multiply %s1b2nxc, %s1b2nistd : tensor<32x150528xf32>
    %s1b2ngb = stablehlo.broadcast_in_dim %s1b2ng, dims = [] : (tensor<f32>) -> tensor<32x150528xf32>
    %s1b2nbtb = stablehlo.broadcast_in_dim %s1b2nbt, dims = [] : (tensor<f32>) -> tensor<32x150528xf32>
    %s1b2ngx = stablehlo.multiply %s1b2nxh, %s1b2ngb : tensor<32x150528xf32>
    %s1b2nfl = stablehlo.add %s1b2ngx, %s1b2nbtb : tensor<32x150528xf32>
    %s1b2n = stablehlo.reshape %s1b2nfl : (tensor<32x150528xf32>) -> tensor<32x192x28x28xf32>
    %s1b2ec = stablehlo.convolution(%s1b2n, %s1b2eW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x192x28x28xf32>, tensor<768x192x1x1xf32>) -> tensor<32x768x28x28xf32>
    %s1b2ebb = stablehlo.broadcast_in_dim %s1b2eb, dims = [1] : (tensor<768xf32>) -> tensor<32x768x28x28xf32>
    %s1b2e = stablehlo.add %s1b2ec, %s1b2ebb : tensor<32x768x28x28xf32>
    %s1b2gx2 = stablehlo.multiply %s1b2e, %s1b2e : tensor<32x768x28x28xf32>
    %s1b2gx3 = stablehlo.multiply %s1b2gx2, %s1b2e : tensor<32x768x28x28xf32>
    %s1b2gck = stablehlo.constant dense<0.044715> : tensor<32x768x28x28xf32>
    %s1b2gkx3 = stablehlo.multiply %s1b2gck, %s1b2gx3 : tensor<32x768x28x28xf32>
    %s1b2ginn = stablehlo.add %s1b2e, %s1b2gkx3 : tensor<32x768x28x28xf32>
    %s1b2gcs = stablehlo.constant dense<0.7978845608028654> : tensor<32x768x28x28xf32>
    %s1b2gu = stablehlo.multiply %s1b2gcs, %s1b2ginn : tensor<32x768x28x28xf32>
    %s1b2gt = stablehlo.tanh %s1b2gu : tensor<32x768x28x28xf32>
    %s1b2gone = stablehlo.constant dense<1.0> : tensor<32x768x28x28xf32>
    %s1b2gopt = stablehlo.add %s1b2gone, %s1b2gt : tensor<32x768x28x28xf32>
    %s1b2ghalf = stablehlo.constant dense<0.5> : tensor<32x768x28x28xf32>
    %s1b2ghx = stablehlo.multiply %s1b2ghalf, %s1b2e : tensor<32x768x28x28xf32>
    %s1b2g = stablehlo.multiply %s1b2ghx, %s1b2gopt : tensor<32x768x28x28xf32>
    %s1b2pc = stablehlo.convolution(%s1b2g, %s1b2pW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x768x28x28xf32>, tensor<192x768x1x1xf32>) -> tensor<32x192x28x28xf32>
    %s1b2pbb = stablehlo.broadcast_in_dim %s1b2pb, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %s1b2p = stablehlo.add %s1b2pc, %s1b2pbb : tensor<32x192x28x28xf32>
    %s1b2lsgb = stablehlo.broadcast_in_dim %s1b2lg, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %s1b2ls = stablehlo.multiply %s1b2p, %s1b2lsgb : tensor<32x192x28x28xf32>
    %s1b2o = stablehlo.add %s1b2ls, %s1b1o : tensor<32x192x28x28xf32>
    %d1nri = stablehlo.reshape %s1b2o : (tensor<32x192x28x28xf32>) -> tensor<32x150528xf32>
    %d1nnf = stablehlo.constant dense<150528.0> : tensor<32x150528xf32>
    %d1nep = stablehlo.constant dense<1.0e-6> : tensor<32x150528xf32>
    %d1nsmr = stablehlo.reduce(%d1nri init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x150528xf32>, tensor<f32>) -> tensor<32xf32>
    %d1nsm = stablehlo.broadcast_in_dim %d1nsmr, dims = [0] : (tensor<32xf32>) -> tensor<32x150528xf32>
    %d1nmu = stablehlo.divide %d1nsm, %d1nnf : tensor<32x150528xf32>
    %d1nxc = stablehlo.subtract %d1nri, %d1nmu : tensor<32x150528xf32>
    %d1nsq = stablehlo.multiply %d1nxc, %d1nxc : tensor<32x150528xf32>
    %d1nvsr = stablehlo.reduce(%d1nsq init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x150528xf32>, tensor<f32>) -> tensor<32xf32>
    %d1nvs = stablehlo.broadcast_in_dim %d1nvsr, dims = [0] : (tensor<32xf32>) -> tensor<32x150528xf32>
    %d1nvr = stablehlo.divide %d1nvs, %d1nnf : tensor<32x150528xf32>
    %d1nve = stablehlo.add %d1nvr, %d1nep : tensor<32x150528xf32>
    %d1nistd = stablehlo.rsqrt %d1nve : tensor<32x150528xf32>
    %d1nxh = stablehlo.multiply %d1nxc, %d1nistd : tensor<32x150528xf32>
    %d1ngb = stablehlo.broadcast_in_dim %d1ng, dims = [] : (tensor<f32>) -> tensor<32x150528xf32>
    %d1nbtb = stablehlo.broadcast_in_dim %d1nbt, dims = [] : (tensor<f32>) -> tensor<32x150528xf32>
    %d1ngx = stablehlo.multiply %d1nxh, %d1ngb : tensor<32x150528xf32>
    %d1nfl = stablehlo.add %d1ngx, %d1nbtb : tensor<32x150528xf32>
    %d1n = stablehlo.reshape %d1nfl : (tensor<32x150528xf32>) -> tensor<32x192x28x28xf32>
    %d1cc = stablehlo.convolution(%d1n, %d1W)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x192x28x28xf32>, tensor<384x192x2x2xf32>) -> tensor<32x384x14x14xf32>
    %d1cbb = stablehlo.broadcast_in_dim %d1b, dims = [1] : (tensor<384xf32>) -> tensor<32x384x14x14xf32>
    %d1c = stablehlo.add %d1cc, %d1cbb : tensor<32x384x14x14xf32>
    %s2b0dc = stablehlo.convolution(%d1c, %s2b0dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[3, 3], [3, 3]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 384 : i64} : (tensor<32x384x14x14xf32>, tensor<384x1x7x7xf32>) -> tensor<32x384x14x14xf32>
    %s2b0dbb = stablehlo.broadcast_in_dim %s2b0db, dims = [1] : (tensor<384xf32>) -> tensor<32x384x14x14xf32>
    %s2b0d = stablehlo.add %s2b0dc, %s2b0dbb : tensor<32x384x14x14xf32>
    %s2b0nri = stablehlo.reshape %s2b0d : (tensor<32x384x14x14xf32>) -> tensor<32x75264xf32>
    %s2b0nnf = stablehlo.constant dense<75264.0> : tensor<32x75264xf32>
    %s2b0nep = stablehlo.constant dense<1.0e-6> : tensor<32x75264xf32>
    %s2b0nsmr = stablehlo.reduce(%s2b0nri init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x75264xf32>, tensor<f32>) -> tensor<32xf32>
    %s2b0nsm = stablehlo.broadcast_in_dim %s2b0nsmr, dims = [0] : (tensor<32xf32>) -> tensor<32x75264xf32>
    %s2b0nmu = stablehlo.divide %s2b0nsm, %s2b0nnf : tensor<32x75264xf32>
    %s2b0nxc = stablehlo.subtract %s2b0nri, %s2b0nmu : tensor<32x75264xf32>
    %s2b0nsq = stablehlo.multiply %s2b0nxc, %s2b0nxc : tensor<32x75264xf32>
    %s2b0nvsr = stablehlo.reduce(%s2b0nsq init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x75264xf32>, tensor<f32>) -> tensor<32xf32>
    %s2b0nvs = stablehlo.broadcast_in_dim %s2b0nvsr, dims = [0] : (tensor<32xf32>) -> tensor<32x75264xf32>
    %s2b0nvr = stablehlo.divide %s2b0nvs, %s2b0nnf : tensor<32x75264xf32>
    %s2b0nve = stablehlo.add %s2b0nvr, %s2b0nep : tensor<32x75264xf32>
    %s2b0nistd = stablehlo.rsqrt %s2b0nve : tensor<32x75264xf32>
    %s2b0nxh = stablehlo.multiply %s2b0nxc, %s2b0nistd : tensor<32x75264xf32>
    %s2b0ngb = stablehlo.broadcast_in_dim %s2b0ng, dims = [] : (tensor<f32>) -> tensor<32x75264xf32>
    %s2b0nbtb = stablehlo.broadcast_in_dim %s2b0nbt, dims = [] : (tensor<f32>) -> tensor<32x75264xf32>
    %s2b0ngx = stablehlo.multiply %s2b0nxh, %s2b0ngb : tensor<32x75264xf32>
    %s2b0nfl = stablehlo.add %s2b0ngx, %s2b0nbtb : tensor<32x75264xf32>
    %s2b0n = stablehlo.reshape %s2b0nfl : (tensor<32x75264xf32>) -> tensor<32x384x14x14xf32>
    %s2b0ec = stablehlo.convolution(%s2b0n, %s2b0eW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x384x14x14xf32>, tensor<1536x384x1x1xf32>) -> tensor<32x1536x14x14xf32>
    %s2b0ebb = stablehlo.broadcast_in_dim %s2b0eb, dims = [1] : (tensor<1536xf32>) -> tensor<32x1536x14x14xf32>
    %s2b0e = stablehlo.add %s2b0ec, %s2b0ebb : tensor<32x1536x14x14xf32>
    %s2b0gx2 = stablehlo.multiply %s2b0e, %s2b0e : tensor<32x1536x14x14xf32>
    %s2b0gx3 = stablehlo.multiply %s2b0gx2, %s2b0e : tensor<32x1536x14x14xf32>
    %s2b0gck = stablehlo.constant dense<0.044715> : tensor<32x1536x14x14xf32>
    %s2b0gkx3 = stablehlo.multiply %s2b0gck, %s2b0gx3 : tensor<32x1536x14x14xf32>
    %s2b0ginn = stablehlo.add %s2b0e, %s2b0gkx3 : tensor<32x1536x14x14xf32>
    %s2b0gcs = stablehlo.constant dense<0.7978845608028654> : tensor<32x1536x14x14xf32>
    %s2b0gu = stablehlo.multiply %s2b0gcs, %s2b0ginn : tensor<32x1536x14x14xf32>
    %s2b0gt = stablehlo.tanh %s2b0gu : tensor<32x1536x14x14xf32>
    %s2b0gone = stablehlo.constant dense<1.0> : tensor<32x1536x14x14xf32>
    %s2b0gopt = stablehlo.add %s2b0gone, %s2b0gt : tensor<32x1536x14x14xf32>
    %s2b0ghalf = stablehlo.constant dense<0.5> : tensor<32x1536x14x14xf32>
    %s2b0ghx = stablehlo.multiply %s2b0ghalf, %s2b0e : tensor<32x1536x14x14xf32>
    %s2b0g = stablehlo.multiply %s2b0ghx, %s2b0gopt : tensor<32x1536x14x14xf32>
    %s2b0pc = stablehlo.convolution(%s2b0g, %s2b0pW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x1536x14x14xf32>, tensor<384x1536x1x1xf32>) -> tensor<32x384x14x14xf32>
    %s2b0pbb = stablehlo.broadcast_in_dim %s2b0pb, dims = [1] : (tensor<384xf32>) -> tensor<32x384x14x14xf32>
    %s2b0p = stablehlo.add %s2b0pc, %s2b0pbb : tensor<32x384x14x14xf32>
    %s2b0lsgb = stablehlo.broadcast_in_dim %s2b0lg, dims = [1] : (tensor<384xf32>) -> tensor<32x384x14x14xf32>
    %s2b0ls = stablehlo.multiply %s2b0p, %s2b0lsgb : tensor<32x384x14x14xf32>
    %s2b0o = stablehlo.add %s2b0ls, %d1c : tensor<32x384x14x14xf32>
    %s2b1dc = stablehlo.convolution(%s2b0o, %s2b1dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[3, 3], [3, 3]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 384 : i64} : (tensor<32x384x14x14xf32>, tensor<384x1x7x7xf32>) -> tensor<32x384x14x14xf32>
    %s2b1dbb = stablehlo.broadcast_in_dim %s2b1db, dims = [1] : (tensor<384xf32>) -> tensor<32x384x14x14xf32>
    %s2b1d = stablehlo.add %s2b1dc, %s2b1dbb : tensor<32x384x14x14xf32>
    %s2b1nri = stablehlo.reshape %s2b1d : (tensor<32x384x14x14xf32>) -> tensor<32x75264xf32>
    %s2b1nnf = stablehlo.constant dense<75264.0> : tensor<32x75264xf32>
    %s2b1nep = stablehlo.constant dense<1.0e-6> : tensor<32x75264xf32>
    %s2b1nsmr = stablehlo.reduce(%s2b1nri init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x75264xf32>, tensor<f32>) -> tensor<32xf32>
    %s2b1nsm = stablehlo.broadcast_in_dim %s2b1nsmr, dims = [0] : (tensor<32xf32>) -> tensor<32x75264xf32>
    %s2b1nmu = stablehlo.divide %s2b1nsm, %s2b1nnf : tensor<32x75264xf32>
    %s2b1nxc = stablehlo.subtract %s2b1nri, %s2b1nmu : tensor<32x75264xf32>
    %s2b1nsq = stablehlo.multiply %s2b1nxc, %s2b1nxc : tensor<32x75264xf32>
    %s2b1nvsr = stablehlo.reduce(%s2b1nsq init: %sc) applies stablehlo.add across dimensions = [1] : (tensor<32x75264xf32>, tensor<f32>) -> tensor<32xf32>
    %s2b1nvs = stablehlo.broadcast_in_dim %s2b1nvsr, dims = [0] : (tensor<32xf32>) -> tensor<32x75264xf32>
    %s2b1nvr = stablehlo.divide %s2b1nvs, %s2b1nnf : tensor<32x75264xf32>
    %s2b1nve = stablehlo.add %s2b1nvr, %s2b1nep : tensor<32x75264xf32>
    %s2b1nistd = stablehlo.rsqrt %s2b1nve : tensor<32x75264xf32>
    %s2b1nxh = stablehlo.multiply %s2b1nxc, %s2b1nistd : tensor<32x75264xf32>
    %s2b1ngb = stablehlo.broadcast_in_dim %s2b1ng, dims = [] : (tensor<f32>) -> tensor<32x75264xf32>
    %s2b1nbtb = stablehlo.broadcast_in_dim %s2b1nbt, dims = [] : (tensor<f32>) -> tensor<32x75264xf32>
    %s2b1ngx = stablehlo.multiply %s2b1nxh, %s2b1ngb : tensor<32x75264xf32>
    %s2b1nfl = stablehlo.add %s2b1ngx, %s2b1nbtb : tensor<32x75264xf32>
    %s2b1n = stablehlo.reshape %s2b1nfl : (tensor<32x75264xf32>) -> tensor<32x384x14x14xf32>
    %s2b1ec = stablehlo.convolution(%s2b1n, %s2b1eW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x384x14x14xf32>, tensor<1536x384x1x1xf32>) -> tensor<32x1536x14x14xf32>
    %s2b1ebb = stablehlo.broadcast_in_dim %s2b1eb, dims = [1] : (tensor<1536xf32>) -> tensor<32x1536x14x14xf32>
    %s2b1e = stablehlo.add %s2b1ec, %s2b1ebb : tensor<32x1536x14x14xf32>
    %s2b1gx2 = stablehlo.multiply %s2b1e, %s2b1e : tensor<32x1536x14x14xf32>
    %s2b1gx3 = stablehlo.multiply %s2b1gx2, %s2b1e : tensor<32x1536x14x14xf32>
    %s2b1gck = stablehlo.constant dense<0.044715> : tensor<32x1536x14x14xf32>
    %s2b1gkx3 = stablehlo.multiply %s2b1gck, %s2b1gx3 : tensor<32x1536x14x14xf32>
    %s2b1ginn = stablehlo.add %s2b1e, %s2b1gkx3 : tensor<32x1536x14x14xf32>
    %s2b1gcs = stablehlo.constant dense<0.7978845608028654> : tensor<32x1536x14x14xf32>
    %s2b1gu = stablehlo.multiply %s2b1gcs, %s2b1ginn : tensor<32x1536x14x14xf32>
    %s2b1gt = stablehlo.tanh %s2b1gu : tensor<32x1536x14x14xf32>
    %s2b1gone = stablehlo.constant dense<1.0> : tensor<32x1536x14x14xf32>
    %s2b1gopt = stablehlo.add %s2b1gone, %s2b1gt : tensor<32x1536x14x14xf32>
    %s2b1ghalf = stablehlo.constant dense<0.5> : tensor<32x1536x14x14xf32>
    %s2b1ghx = stablehlo.multiply %s2b1ghalf, %s2b1e : tensor<32x1536x14x14xf32>
    %s2b1g = stablehlo.multiply %s2b1ghx, %s2b1gopt : tensor<32x1536x14x14xf32>
    %s2b1pc = stablehlo.convolution(%s2b1g, %s2b1pW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x1536x14x14xf32>, tensor<384x1536x1x1xf32>) -> tensor<32x384x14x14xf32>
    %s2b1pbb = stablehlo.broadcast_in_dim %s2b1pb, dims = [1] : (tensor<384xf32>) -> tensor<32x384x14x14xf32>
