module @m {
  func.func @efficientnet_train_step(%x: tensor<32x150528xf32>, %sW: tensor<32x3x3x3xf32>, %sb: tensor<32xf32>, %sg: tensor<32xf32>, %sbt: tensor<32xf32>, %b1dW: tensor<32x1x3x3xf32>, %b1db: tensor<32xf32>, %b1dg: tensor<32xf32>, %b1dbt: tensor<32xf32>, %b1zW1: tensor<32x8xf32>, %b1zb1: tensor<8xf32>, %b1zW2: tensor<8x32xf32>, %b1zb2: tensor<32xf32>, %b1pW: tensor<16x32x1x1xf32>, %b1pb: tensor<16xf32>, %b1pg: tensor<16xf32>, %b1pbt: tensor<16xf32>, %b2eW: tensor<96x16x1x1xf32>, %b2eb: tensor<96xf32>, %b2eg: tensor<96xf32>, %b2ebt: tensor<96xf32>, %b2dW: tensor<96x1x3x3xf32>, %b2db: tensor<96xf32>, %b2dg: tensor<96xf32>, %b2dbt: tensor<96xf32>, %b2zW1: tensor<96x4xf32>, %b2zb1: tensor<4xf32>, %b2zW2: tensor<4x96xf32>, %b2zb2: tensor<96xf32>, %b2pW: tensor<24x96x1x1xf32>, %b2pb: tensor<24xf32>, %b2pg: tensor<24xf32>, %b2pbt: tensor<24xf32>, %b3eW: tensor<144x24x1x1xf32>, %b3eb: tensor<144xf32>, %b3eg: tensor<144xf32>, %b3ebt: tensor<144xf32>, %b3dW: tensor<144x1x3x3xf32>, %b3db: tensor<144xf32>, %b3dg: tensor<144xf32>, %b3dbt: tensor<144xf32>, %b3zW1: tensor<144x6xf32>, %b3zb1: tensor<6xf32>, %b3zW2: tensor<6x144xf32>, %b3zb2: tensor<144xf32>, %b3pW: tensor<24x144x1x1xf32>, %b3pb: tensor<24xf32>, %b3pg: tensor<24xf32>, %b3pbt: tensor<24xf32>, %b4eW: tensor<144x24x1x1xf32>, %b4eb: tensor<144xf32>, %b4eg: tensor<144xf32>, %b4ebt: tensor<144xf32>, %b4dW: tensor<144x1x5x5xf32>, %b4db: tensor<144xf32>, %b4dg: tensor<144xf32>, %b4dbt: tensor<144xf32>, %b4zW1: tensor<144x6xf32>, %b4zb1: tensor<6xf32>, %b4zW2: tensor<6x144xf32>, %b4zb2: tensor<144xf32>, %b4pW: tensor<40x144x1x1xf32>, %b4pb: tensor<40xf32>, %b4pg: tensor<40xf32>, %b4pbt: tensor<40xf32>, %b5eW: tensor<240x40x1x1xf32>, %b5eb: tensor<240xf32>, %b5eg: tensor<240xf32>, %b5ebt: tensor<240xf32>, %b5dW: tensor<240x1x5x5xf32>, %b5db: tensor<240xf32>, %b5dg: tensor<240xf32>, %b5dbt: tensor<240xf32>, %b5zW1: tensor<240x10xf32>, %b5zb1: tensor<10xf32>, %b5zW2: tensor<10x240xf32>, %b5zb2: tensor<240xf32>, %b5pW: tensor<40x240x1x1xf32>, %b5pb: tensor<40xf32>, %b5pg: tensor<40xf32>, %b5pbt: tensor<40xf32>, %b6eW: tensor<240x40x1x1xf32>, %b6eb: tensor<240xf32>, %b6eg: tensor<240xf32>, %b6ebt: tensor<240xf32>, %b6dW: tensor<240x1x3x3xf32>, %b6db: tensor<240xf32>, %b6dg: tensor<240xf32>, %b6dbt: tensor<240xf32>, %b6zW1: tensor<240x10xf32>, %b6zb1: tensor<10xf32>, %b6zW2: tensor<10x240xf32>, %b6zb2: tensor<240xf32>, %b6pW: tensor<80x240x1x1xf32>, %b6pb: tensor<80xf32>, %b6pg: tensor<80xf32>, %b6pbt: tensor<80xf32>, %b7eW: tensor<480x80x1x1xf32>, %b7eb: tensor<480xf32>, %b7eg: tensor<480xf32>, %b7ebt: tensor<480xf32>, %b7dW: tensor<480x1x3x3xf32>, %b7db: tensor<480xf32>, %b7dg: tensor<480xf32>, %b7dbt: tensor<480xf32>, %b7zW1: tensor<480x20xf32>, %b7zb1: tensor<20xf32>, %b7zW2: tensor<20x480xf32>, %b7zb2: tensor<480xf32>, %b7pW: tensor<80x480x1x1xf32>, %b7pb: tensor<80xf32>, %b7pg: tensor<80xf32>, %b7pbt: tensor<80xf32>, %b8eW: tensor<480x80x1x1xf32>, %b8eb: tensor<480xf32>, %b8eg: tensor<480xf32>, %b8ebt: tensor<480xf32>, %b8dW: tensor<480x1x3x3xf32>, %b8db: tensor<480xf32>, %b8dg: tensor<480xf32>, %b8dbt: tensor<480xf32>, %b8zW1: tensor<480x20xf32>, %b8zb1: tensor<20xf32>, %b8zW2: tensor<20x480xf32>, %b8zb2: tensor<480xf32>, %b8pW: tensor<80x480x1x1xf32>, %b8pb: tensor<80xf32>, %b8pg: tensor<80xf32>, %b8pbt: tensor<80xf32>, %b9eW: tensor<480x80x1x1xf32>, %b9eb: tensor<480xf32>, %b9eg: tensor<480xf32>, %b9ebt: tensor<480xf32>, %b9dW: tensor<480x1x5x5xf32>, %b9db: tensor<480xf32>, %b9dg: tensor<480xf32>, %b9dbt: tensor<480xf32>, %b9zW1: tensor<480x20xf32>, %b9zb1: tensor<20xf32>, %b9zW2: tensor<20x480xf32>, %b9zb2: tensor<480xf32>, %b9pW: tensor<112x480x1x1xf32>, %b9pb: tensor<112xf32>, %b9pg: tensor<112xf32>, %b9pbt: tensor<112xf32>, %b10eW: tensor<672x112x1x1xf32>, %b10eb: tensor<672xf32>, %b10eg: tensor<672xf32>, %b10ebt: tensor<672xf32>, %b10dW: tensor<672x1x5x5xf32>, %b10db: tensor<672xf32>, %b10dg: tensor<672xf32>, %b10dbt: tensor<672xf32>, %b10zW1: tensor<672x28xf32>, %b10zb1: tensor<28xf32>, %b10zW2: tensor<28x672xf32>, %b10zb2: tensor<672xf32>, %b10pW: tensor<112x672x1x1xf32>, %b10pb: tensor<112xf32>, %b10pg: tensor<112xf32>, %b10pbt: tensor<112xf32>, %b11eW: tensor<672x112x1x1xf32>, %b11eb: tensor<672xf32>, %b11eg: tensor<672xf32>, %b11ebt: tensor<672xf32>, %b11dW: tensor<672x1x5x5xf32>, %b11db: tensor<672xf32>, %b11dg: tensor<672xf32>, %b11dbt: tensor<672xf32>, %b11zW1: tensor<672x28xf32>, %b11zb1: tensor<28xf32>, %b11zW2: tensor<28x672xf32>, %b11zb2: tensor<672xf32>, %b11pW: tensor<112x672x1x1xf32>, %b11pb: tensor<112xf32>, %b11pg: tensor<112xf32>, %b11pbt: tensor<112xf32>, %b12eW: tensor<672x112x1x1xf32>, %b12eb: tensor<672xf32>, %b12eg: tensor<672xf32>, %b12ebt: tensor<672xf32>, %b12dW: tensor<672x1x5x5xf32>, %b12db: tensor<672xf32>, %b12dg: tensor<672xf32>, %b12dbt: tensor<672xf32>, %b12zW1: tensor<672x28xf32>, %b12zb1: tensor<28xf32>, %b12zW2: tensor<28x672xf32>, %b12zb2: tensor<672xf32>, %b12pW: tensor<192x672x1x1xf32>, %b12pb: tensor<192xf32>, %b12pg: tensor<192xf32>, %b12pbt: tensor<192xf32>, %b13eW: tensor<1152x192x1x1xf32>, %b13eb: tensor<1152xf32>, %b13eg: tensor<1152xf32>, %b13ebt: tensor<1152xf32>, %b13dW: tensor<1152x1x5x5xf32>, %b13db: tensor<1152xf32>, %b13dg: tensor<1152xf32>, %b13dbt: tensor<1152xf32>, %b13zW1: tensor<1152x48xf32>, %b13zb1: tensor<48xf32>, %b13zW2: tensor<48x1152xf32>, %b13zb2: tensor<1152xf32>, %b13pW: tensor<192x1152x1x1xf32>, %b13pb: tensor<192xf32>, %b13pg: tensor<192xf32>, %b13pbt: tensor<192xf32>, %b14eW: tensor<1152x192x1x1xf32>, %b14eb: tensor<1152xf32>, %b14eg: tensor<1152xf32>, %b14ebt: tensor<1152xf32>, %b14dW: tensor<1152x1x5x5xf32>, %b14db: tensor<1152xf32>, %b14dg: tensor<1152xf32>, %b14dbt: tensor<1152xf32>, %b14zW1: tensor<1152x48xf32>, %b14zb1: tensor<48xf32>, %b14zW2: tensor<48x1152xf32>, %b14zb2: tensor<1152xf32>, %b14pW: tensor<192x1152x1x1xf32>, %b14pb: tensor<192xf32>, %b14pg: tensor<192xf32>, %b14pbt: tensor<192xf32>, %b15eW: tensor<1152x192x1x1xf32>, %b15eb: tensor<1152xf32>, %b15eg: tensor<1152xf32>, %b15ebt: tensor<1152xf32>, %b15dW: tensor<1152x1x5x5xf32>, %b15db: tensor<1152xf32>, %b15dg: tensor<1152xf32>, %b15dbt: tensor<1152xf32>, %b15zW1: tensor<1152x48xf32>, %b15zb1: tensor<48xf32>, %b15zW2: tensor<48x1152xf32>, %b15zb2: tensor<1152xf32>, %b15pW: tensor<192x1152x1x1xf32>, %b15pb: tensor<192xf32>, %b15pg: tensor<192xf32>, %b15pbt: tensor<192xf32>, %b16eW: tensor<1152x192x1x1xf32>, %b16eb: tensor<1152xf32>, %b16eg: tensor<1152xf32>, %b16ebt: tensor<1152xf32>, %b16dW: tensor<1152x1x3x3xf32>, %b16db: tensor<1152xf32>, %b16dg: tensor<1152xf32>, %b16dbt: tensor<1152xf32>, %b16zW1: tensor<1152x48xf32>, %b16zb1: tensor<48xf32>, %b16zW2: tensor<48x1152xf32>, %b16zb2: tensor<1152xf32>, %b16pW: tensor<320x1152x1x1xf32>, %b16pb: tensor<320xf32>, %b16pg: tensor<320xf32>, %b16pbt: tensor<320xf32>, %hW: tensor<1280x320x1x1xf32>, %hb: tensor<1280xf32>, %hg: tensor<1280xf32>, %hbt: tensor<1280xf32>, %Wd: tensor<1280x10xf32>, %bd: tensor<10xf32>, %onehot: tensor<32x10xf32>) -> (tensor<32x3x3x3xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32x1x3x3xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32x8xf32>, tensor<8xf32>, tensor<8x32xf32>, tensor<32xf32>, tensor<16x32x1x1xf32>, tensor<16xf32>, tensor<16xf32>, tensor<16xf32>, tensor<96x16x1x1xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96x1x3x3xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96x4xf32>, tensor<4xf32>, tensor<4x96xf32>, tensor<96xf32>, tensor<24x96x1x1xf32>, tensor<24xf32>, tensor<24xf32>, tensor<24xf32>, tensor<144x24x1x1xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144x1x3x3xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144x6xf32>, tensor<6xf32>, tensor<6x144xf32>, tensor<144xf32>, tensor<24x144x1x1xf32>, tensor<24xf32>, tensor<24xf32>, tensor<24xf32>, tensor<144x24x1x1xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144x1x5x5xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144x6xf32>, tensor<6xf32>, tensor<6x144xf32>, tensor<144xf32>, tensor<40x144x1x1xf32>, tensor<40xf32>, tensor<40xf32>, tensor<40xf32>, tensor<240x40x1x1xf32>, tensor<240xf32>, tensor<240xf32>, tensor<240xf32>, tensor<240x1x5x5xf32>, tensor<240xf32>, tensor<240xf32>, tensor<240xf32>, tensor<240x10xf32>, tensor<10xf32>, tensor<10x240xf32>, tensor<240xf32>, tensor<40x240x1x1xf32>, tensor<40xf32>, tensor<40xf32>, tensor<40xf32>, tensor<240x40x1x1xf32>, tensor<240xf32>, tensor<240xf32>, tensor<240xf32>, tensor<240x1x3x3xf32>, tensor<240xf32>, tensor<240xf32>, tensor<240xf32>, tensor<240x10xf32>, tensor<10xf32>, tensor<10x240xf32>, tensor<240xf32>, tensor<80x240x1x1xf32>, tensor<80xf32>, tensor<80xf32>, tensor<80xf32>, tensor<480x80x1x1xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480x1x3x3xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480x20xf32>, tensor<20xf32>, tensor<20x480xf32>, tensor<480xf32>, tensor<80x480x1x1xf32>, tensor<80xf32>, tensor<80xf32>, tensor<80xf32>, tensor<480x80x1x1xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480x1x3x3xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480x20xf32>, tensor<20xf32>, tensor<20x480xf32>, tensor<480xf32>, tensor<80x480x1x1xf32>, tensor<80xf32>, tensor<80xf32>, tensor<80xf32>, tensor<480x80x1x1xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480x1x5x5xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480xf32>, tensor<480x20xf32>, tensor<20xf32>, tensor<20x480xf32>, tensor<480xf32>, tensor<112x480x1x1xf32>, tensor<112xf32>, tensor<112xf32>, tensor<112xf32>, tensor<672x112x1x1xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672x1x5x5xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672x28xf32>, tensor<28xf32>, tensor<28x672xf32>, tensor<672xf32>, tensor<112x672x1x1xf32>, tensor<112xf32>, tensor<112xf32>, tensor<112xf32>, tensor<672x112x1x1xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672x1x5x5xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672x28xf32>, tensor<28xf32>, tensor<28x672xf32>, tensor<672xf32>, tensor<112x672x1x1xf32>, tensor<112xf32>, tensor<112xf32>, tensor<112xf32>, tensor<672x112x1x1xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672x1x5x5xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672xf32>, tensor<672x28xf32>, tensor<28xf32>, tensor<28x672xf32>, tensor<672xf32>, tensor<192x672x1x1xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<1152x192x1x1xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152x1x5x5xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152x48xf32>, tensor<48xf32>, tensor<48x1152xf32>, tensor<1152xf32>, tensor<192x1152x1x1xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<1152x192x1x1xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152x1x5x5xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152x48xf32>, tensor<48xf32>, tensor<48x1152xf32>, tensor<1152xf32>, tensor<192x1152x1x1xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<1152x192x1x1xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152x1x5x5xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152x48xf32>, tensor<48xf32>, tensor<48x1152xf32>, tensor<1152xf32>, tensor<192x1152x1x1xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<1152x192x1x1xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152x1x3x3xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152xf32>, tensor<1152x48xf32>, tensor<48xf32>, tensor<48x1152xf32>, tensor<1152xf32>, tensor<320x1152x1x1xf32>, tensor<320xf32>, tensor<320xf32>, tensor<320xf32>, tensor<1280x320x1x1xf32>, tensor<1280xf32>, tensor<1280xf32>, tensor<1280xf32>, tensor<1280x10xf32>, tensor<10xf32>) {
    // ── EfficientNet-B0 (16-MBConv) train step: every line is pretty(verified AST node) ──
    %v0 = stablehlo.reshape %x : (tensor<32x150528xf32>) -> tensor<32x3x224x224xf32>
    %v1 = stablehlo.convolution(%v0, %sW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x3x224x224xf32>, tensor<32x3x3x3xf32>) -> tensor<32x32x112x112xf32>
    %v2 = stablehlo.broadcast_in_dim %sb, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v3 = stablehlo.add %v1, %v2 : tensor<32x32x112x112xf32>
    %v4 = stablehlo.reshape %v3 : (tensor<32x32x112x112xf32>) -> tensor<32x401408xf32>
    %v5 = stablehlo.reshape %v4 : (tensor<32x401408xf32>) -> tensor<32x32x112x112xf32>
    %v6 = stablehlo.constant dense<0.0> : tensor<f32>
    %v7 = stablehlo.constant dense<401408.0> : tensor<32x32x112x112xf32>
    %v8 = stablehlo.constant dense<1.0e-5> : tensor<32x32x112x112xf32>
    %v9 = stablehlo.reduce(%v5 init: %v6) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x32x112x112xf32>, tensor<f32>) -> tensor<32xf32>
    %v10 = stablehlo.broadcast_in_dim %v9, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v11 = stablehlo.divide %v10, %v7 : tensor<32x32x112x112xf32>
    %v12 = stablehlo.subtract %v5, %v11 : tensor<32x32x112x112xf32>
    %v13 = stablehlo.multiply %v12, %v12 : tensor<32x32x112x112xf32>
    %v14 = stablehlo.reduce(%v13 init: %v6) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x32x112x112xf32>, tensor<f32>) -> tensor<32xf32>
    %v15 = stablehlo.broadcast_in_dim %v14, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v16 = stablehlo.divide %v15, %v7 : tensor<32x32x112x112xf32>
    %v17 = stablehlo.add %v16, %v8 : tensor<32x32x112x112xf32>
    %v18 = stablehlo.rsqrt %v17 : tensor<32x32x112x112xf32>
    %v19 = stablehlo.multiply %v12, %v18 : tensor<32x32x112x112xf32>
    %v20 = stablehlo.broadcast_in_dim %sg, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v21 = stablehlo.broadcast_in_dim %sbt, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v22 = stablehlo.multiply %v19, %v20 : tensor<32x32x112x112xf32>
    %v23 = stablehlo.add %v22, %v21 : tensor<32x32x112x112xf32>
    %v24 = stablehlo.reshape %v23 : (tensor<32x32x112x112xf32>) -> tensor<32x401408xf32>
    %v25 = stablehlo.logistic %v24 : tensor<32x401408xf32>
    %v26 = stablehlo.multiply %v24, %v25 : tensor<32x401408xf32>
    %v27 = stablehlo.reshape %v26 : (tensor<32x401408xf32>) -> tensor<32x32x112x112xf32>
    %v28 = stablehlo.convolution(%v27, %b1dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 32 : i64} : (tensor<32x32x112x112xf32>, tensor<32x1x3x3xf32>) -> tensor<32x32x112x112xf32>
    %v29 = stablehlo.broadcast_in_dim %b1db, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v30 = stablehlo.add %v28, %v29 : tensor<32x32x112x112xf32>
    %v31 = stablehlo.reshape %v30 : (tensor<32x32x112x112xf32>) -> tensor<32x401408xf32>
    %v32 = stablehlo.reshape %v31 : (tensor<32x401408xf32>) -> tensor<32x32x112x112xf32>
    %v33 = stablehlo.constant dense<0.0> : tensor<f32>
    %v34 = stablehlo.constant dense<401408.0> : tensor<32x32x112x112xf32>
    %v35 = stablehlo.constant dense<1.0e-5> : tensor<32x32x112x112xf32>
    %v36 = stablehlo.reduce(%v32 init: %v33) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x32x112x112xf32>, tensor<f32>) -> tensor<32xf32>
    %v37 = stablehlo.broadcast_in_dim %v36, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v38 = stablehlo.divide %v37, %v34 : tensor<32x32x112x112xf32>
    %v39 = stablehlo.subtract %v32, %v38 : tensor<32x32x112x112xf32>
    %v40 = stablehlo.multiply %v39, %v39 : tensor<32x32x112x112xf32>
    %v41 = stablehlo.reduce(%v40 init: %v33) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x32x112x112xf32>, tensor<f32>) -> tensor<32xf32>
    %v42 = stablehlo.broadcast_in_dim %v41, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v43 = stablehlo.divide %v42, %v34 : tensor<32x32x112x112xf32>
    %v44 = stablehlo.add %v43, %v35 : tensor<32x32x112x112xf32>
    %v45 = stablehlo.rsqrt %v44 : tensor<32x32x112x112xf32>
    %v46 = stablehlo.multiply %v39, %v45 : tensor<32x32x112x112xf32>
    %v47 = stablehlo.broadcast_in_dim %b1dg, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v48 = stablehlo.broadcast_in_dim %b1dbt, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v49 = stablehlo.multiply %v46, %v47 : tensor<32x32x112x112xf32>
    %v50 = stablehlo.add %v49, %v48 : tensor<32x32x112x112xf32>
    %v51 = stablehlo.reshape %v50 : (tensor<32x32x112x112xf32>) -> tensor<32x401408xf32>
    %v52 = stablehlo.logistic %v51 : tensor<32x401408xf32>
    %v53 = stablehlo.multiply %v51, %v52 : tensor<32x401408xf32>
    %v54 = stablehlo.reshape %v53 : (tensor<32x401408xf32>) -> tensor<32x32x112x112xf32>
    %v55 = stablehlo.constant dense<0.0> : tensor<f32>
    %v56 = stablehlo.reduce(%v54 init: %v55) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x112x112xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v57 = stablehlo.constant dense<12544.0> : tensor<32x32xf32>
    %v58 = stablehlo.divide %v56, %v57 : tensor<32x32xf32>
    %v59 = stablehlo.dot_general %v58, %b1zW1, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x32xf32>, tensor<32x8xf32>) -> tensor<32x8xf32>
    %v60 = stablehlo.broadcast_in_dim %b1zb1, dims = [1] : (tensor<8xf32>) -> tensor<32x8xf32>
    %v61 = stablehlo.add %v59, %v60 : tensor<32x8xf32>
    %v62 = stablehlo.logistic %v61 : tensor<32x8xf32>
    %v63 = stablehlo.multiply %v61, %v62 : tensor<32x8xf32>
    %v64 = stablehlo.dot_general %v63, %b1zW2, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x8xf32>, tensor<8x32xf32>) -> tensor<32x32xf32>
    %v65 = stablehlo.broadcast_in_dim %b1zb2, dims = [1] : (tensor<32xf32>) -> tensor<32x32xf32>
    %v66 = stablehlo.add %v64, %v65 : tensor<32x32xf32>
    %v67 = stablehlo.reshape %v53 : (tensor<32x401408xf32>) -> tensor<32x32x112x112xf32>
    %v68 = stablehlo.constant dense<0.0> : tensor<f32>
    %v69 = stablehlo.reduce(%v67 init: %v68) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x112x112xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v70 = stablehlo.constant dense<12544.0> : tensor<32x32xf32>
    %v71 = stablehlo.divide %v69, %v70 : tensor<32x32xf32>
    %v72 = stablehlo.dot_general %v71, %b1zW1, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x32xf32>, tensor<32x8xf32>) -> tensor<32x8xf32>
    %v73 = stablehlo.broadcast_in_dim %b1zb1, dims = [1] : (tensor<8xf32>) -> tensor<32x8xf32>
    %v74 = stablehlo.add %v72, %v73 : tensor<32x8xf32>
    %v75 = stablehlo.logistic %v74 : tensor<32x8xf32>
    %v76 = stablehlo.multiply %v74, %v75 : tensor<32x8xf32>
    %v77 = stablehlo.dot_general %v76, %b1zW2, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x8xf32>, tensor<8x32xf32>) -> tensor<32x32xf32>
    %v78 = stablehlo.broadcast_in_dim %b1zb2, dims = [1] : (tensor<32xf32>) -> tensor<32x32xf32>
    %v79 = stablehlo.add %v77, %v78 : tensor<32x32xf32>
    %v80 = stablehlo.logistic %v79 : tensor<32x32xf32>
    %v81 = stablehlo.broadcast_in_dim %v80, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x112x112xf32>
    %v82 = stablehlo.multiply %v67, %v81 : tensor<32x32x112x112xf32>
    %v83 = stablehlo.reshape %v82 : (tensor<32x32x112x112xf32>) -> tensor<32x401408xf32>
    %v84 = stablehlo.reshape %v83 : (tensor<32x401408xf32>) -> tensor<32x32x112x112xf32>
    %v85 = stablehlo.convolution(%v84, %b1pW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x32x112x112xf32>, tensor<16x32x1x1xf32>) -> tensor<32x16x112x112xf32>
    %v86 = stablehlo.broadcast_in_dim %b1pb, dims = [1] : (tensor<16xf32>) -> tensor<32x16x112x112xf32>
    %v87 = stablehlo.add %v85, %v86 : tensor<32x16x112x112xf32>
    %v88 = stablehlo.reshape %v87 : (tensor<32x16x112x112xf32>) -> tensor<32x200704xf32>
    %v89 = stablehlo.reshape %v88 : (tensor<32x200704xf32>) -> tensor<32x16x112x112xf32>
    %v90 = stablehlo.constant dense<0.0> : tensor<f32>
    %v91 = stablehlo.constant dense<401408.0> : tensor<32x16x112x112xf32>
    %v92 = stablehlo.constant dense<1.0e-5> : tensor<32x16x112x112xf32>
    %v93 = stablehlo.reduce(%v89 init: %v90) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x16x112x112xf32>, tensor<f32>) -> tensor<16xf32>
    %v94 = stablehlo.broadcast_in_dim %v93, dims = [1] : (tensor<16xf32>) -> tensor<32x16x112x112xf32>
    %v95 = stablehlo.divide %v94, %v91 : tensor<32x16x112x112xf32>
    %v96 = stablehlo.subtract %v89, %v95 : tensor<32x16x112x112xf32>
    %v97 = stablehlo.multiply %v96, %v96 : tensor<32x16x112x112xf32>
    %v98 = stablehlo.reduce(%v97 init: %v90) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x16x112x112xf32>, tensor<f32>) -> tensor<16xf32>
    %v99 = stablehlo.broadcast_in_dim %v98, dims = [1] : (tensor<16xf32>) -> tensor<32x16x112x112xf32>
    %v100 = stablehlo.divide %v99, %v91 : tensor<32x16x112x112xf32>
    %v101 = stablehlo.add %v100, %v92 : tensor<32x16x112x112xf32>
    %v102 = stablehlo.rsqrt %v101 : tensor<32x16x112x112xf32>
    %v103 = stablehlo.multiply %v96, %v102 : tensor<32x16x112x112xf32>
    %v104 = stablehlo.broadcast_in_dim %b1pg, dims = [1] : (tensor<16xf32>) -> tensor<32x16x112x112xf32>
    %v105 = stablehlo.broadcast_in_dim %b1pbt, dims = [1] : (tensor<16xf32>) -> tensor<32x16x112x112xf32>
    %v106 = stablehlo.multiply %v103, %v104 : tensor<32x16x112x112xf32>
    %v107 = stablehlo.add %v106, %v105 : tensor<32x16x112x112xf32>
    %v108 = stablehlo.reshape %v107 : (tensor<32x16x112x112xf32>) -> tensor<32x200704xf32>
    %v109 = stablehlo.reshape %v108 : (tensor<32x200704xf32>) -> tensor<32x16x112x112xf32>
    %v110 = stablehlo.convolution(%v109, %b2eW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x16x112x112xf32>, tensor<96x16x1x1xf32>) -> tensor<32x96x112x112xf32>
    %v111 = stablehlo.broadcast_in_dim %b2eb, dims = [1] : (tensor<96xf32>) -> tensor<32x96x112x112xf32>
    %v112 = stablehlo.add %v110, %v111 : tensor<32x96x112x112xf32>
    %v113 = stablehlo.reshape %v112 : (tensor<32x96x112x112xf32>) -> tensor<32x1204224xf32>
    %v114 = stablehlo.reshape %v113 : (tensor<32x1204224xf32>) -> tensor<32x96x112x112xf32>
    %v115 = stablehlo.constant dense<0.0> : tensor<f32>
    %v116 = stablehlo.constant dense<401408.0> : tensor<32x96x112x112xf32>
    %v117 = stablehlo.constant dense<1.0e-5> : tensor<32x96x112x112xf32>
    %v118 = stablehlo.reduce(%v114 init: %v115) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x96x112x112xf32>, tensor<f32>) -> tensor<96xf32>
    %v119 = stablehlo.broadcast_in_dim %v118, dims = [1] : (tensor<96xf32>) -> tensor<32x96x112x112xf32>
    %v120 = stablehlo.divide %v119, %v116 : tensor<32x96x112x112xf32>
    %v121 = stablehlo.subtract %v114, %v120 : tensor<32x96x112x112xf32>
    %v122 = stablehlo.multiply %v121, %v121 : tensor<32x96x112x112xf32>
    %v123 = stablehlo.reduce(%v122 init: %v115) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x96x112x112xf32>, tensor<f32>) -> tensor<96xf32>
    %v124 = stablehlo.broadcast_in_dim %v123, dims = [1] : (tensor<96xf32>) -> tensor<32x96x112x112xf32>
    %v125 = stablehlo.divide %v124, %v116 : tensor<32x96x112x112xf32>
    %v126 = stablehlo.add %v125, %v117 : tensor<32x96x112x112xf32>
    %v127 = stablehlo.rsqrt %v126 : tensor<32x96x112x112xf32>
    %v128 = stablehlo.multiply %v121, %v127 : tensor<32x96x112x112xf32>
    %v129 = stablehlo.broadcast_in_dim %b2eg, dims = [1] : (tensor<96xf32>) -> tensor<32x96x112x112xf32>
    %v130 = stablehlo.broadcast_in_dim %b2ebt, dims = [1] : (tensor<96xf32>) -> tensor<32x96x112x112xf32>
    %v131 = stablehlo.multiply %v128, %v129 : tensor<32x96x112x112xf32>
    %v132 = stablehlo.add %v131, %v130 : tensor<32x96x112x112xf32>
    %v133 = stablehlo.reshape %v132 : (tensor<32x96x112x112xf32>) -> tensor<32x1204224xf32>
    %v134 = stablehlo.logistic %v133 : tensor<32x1204224xf32>
    %v135 = stablehlo.multiply %v133, %v134 : tensor<32x1204224xf32>
    %v136 = stablehlo.reshape %v135 : (tensor<32x1204224xf32>) -> tensor<32x96x112x112xf32>
    %v137 = stablehlo.convolution(%v136, %b2dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 96 : i64} : (tensor<32x96x112x112xf32>, tensor<96x1x3x3xf32>) -> tensor<32x96x56x56xf32>
    %v138 = stablehlo.broadcast_in_dim %b2db, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v139 = stablehlo.add %v137, %v138 : tensor<32x96x56x56xf32>
    %v140 = stablehlo.reshape %v139 : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %v141 = stablehlo.reshape %v140 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v142 = stablehlo.constant dense<0.0> : tensor<f32>
    %v143 = stablehlo.constant dense<100352.0> : tensor<32x96x56x56xf32>
    %v144 = stablehlo.constant dense<1.0e-5> : tensor<32x96x56x56xf32>
    %v145 = stablehlo.reduce(%v141 init: %v142) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<96xf32>
    %v146 = stablehlo.broadcast_in_dim %v145, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v147 = stablehlo.divide %v146, %v143 : tensor<32x96x56x56xf32>
    %v148 = stablehlo.subtract %v141, %v147 : tensor<32x96x56x56xf32>
    %v149 = stablehlo.multiply %v148, %v148 : tensor<32x96x56x56xf32>
    %v150 = stablehlo.reduce(%v149 init: %v142) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<96xf32>
    %v151 = stablehlo.broadcast_in_dim %v150, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v152 = stablehlo.divide %v151, %v143 : tensor<32x96x56x56xf32>
    %v153 = stablehlo.add %v152, %v144 : tensor<32x96x56x56xf32>
    %v154 = stablehlo.rsqrt %v153 : tensor<32x96x56x56xf32>
    %v155 = stablehlo.multiply %v148, %v154 : tensor<32x96x56x56xf32>
    %v156 = stablehlo.broadcast_in_dim %b2dg, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v157 = stablehlo.broadcast_in_dim %b2dbt, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v158 = stablehlo.multiply %v155, %v156 : tensor<32x96x56x56xf32>
    %v159 = stablehlo.add %v158, %v157 : tensor<32x96x56x56xf32>
    %v160 = stablehlo.reshape %v159 : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %v161 = stablehlo.logistic %v160 : tensor<32x301056xf32>
    %v162 = stablehlo.multiply %v160, %v161 : tensor<32x301056xf32>
    %v163 = stablehlo.reshape %v162 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v164 = stablehlo.constant dense<0.0> : tensor<f32>
    %v165 = stablehlo.reduce(%v163 init: %v164) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v166 = stablehlo.constant dense<3136.0> : tensor<32x96xf32>
    %v167 = stablehlo.divide %v165, %v166 : tensor<32x96xf32>
    %v168 = stablehlo.dot_general %v167, %b2zW1, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x96xf32>, tensor<96x4xf32>) -> tensor<32x4xf32>
    %v169 = stablehlo.broadcast_in_dim %b2zb1, dims = [1] : (tensor<4xf32>) -> tensor<32x4xf32>
    %v170 = stablehlo.add %v168, %v169 : tensor<32x4xf32>
    %v171 = stablehlo.logistic %v170 : tensor<32x4xf32>
    %v172 = stablehlo.multiply %v170, %v171 : tensor<32x4xf32>
    %v173 = stablehlo.dot_general %v172, %b2zW2, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x4xf32>, tensor<4x96xf32>) -> tensor<32x96xf32>
    %v174 = stablehlo.broadcast_in_dim %b2zb2, dims = [1] : (tensor<96xf32>) -> tensor<32x96xf32>
    %v175 = stablehlo.add %v173, %v174 : tensor<32x96xf32>
    %v176 = stablehlo.reshape %v162 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v177 = stablehlo.constant dense<0.0> : tensor<f32>
    %v178 = stablehlo.reduce(%v176 init: %v177) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v179 = stablehlo.constant dense<3136.0> : tensor<32x96xf32>
    %v180 = stablehlo.divide %v178, %v179 : tensor<32x96xf32>
    %v181 = stablehlo.dot_general %v180, %b2zW1, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x96xf32>, tensor<96x4xf32>) -> tensor<32x4xf32>
    %v182 = stablehlo.broadcast_in_dim %b2zb1, dims = [1] : (tensor<4xf32>) -> tensor<32x4xf32>
    %v183 = stablehlo.add %v181, %v182 : tensor<32x4xf32>
    %v184 = stablehlo.logistic %v183 : tensor<32x4xf32>
    %v185 = stablehlo.multiply %v183, %v184 : tensor<32x4xf32>
    %v186 = stablehlo.dot_general %v185, %b2zW2, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x4xf32>, tensor<4x96xf32>) -> tensor<32x96xf32>
    %v187 = stablehlo.broadcast_in_dim %b2zb2, dims = [1] : (tensor<96xf32>) -> tensor<32x96xf32>
    %v188 = stablehlo.add %v186, %v187 : tensor<32x96xf32>
    %v189 = stablehlo.logistic %v188 : tensor<32x96xf32>
    %v190 = stablehlo.broadcast_in_dim %v189, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x56x56xf32>
    %v191 = stablehlo.multiply %v176, %v190 : tensor<32x96x56x56xf32>
    %v192 = stablehlo.reshape %v191 : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %v193 = stablehlo.reshape %v192 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v194 = stablehlo.convolution(%v193, %b2pW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x96x56x56xf32>, tensor<24x96x1x1xf32>) -> tensor<32x24x56x56xf32>
    %v195 = stablehlo.broadcast_in_dim %b2pb, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v196 = stablehlo.add %v194, %v195 : tensor<32x24x56x56xf32>
    %v197 = stablehlo.reshape %v196 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v198 = stablehlo.reshape %v197 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v199 = stablehlo.constant dense<0.0> : tensor<f32>
    %v200 = stablehlo.constant dense<100352.0> : tensor<32x24x56x56xf32>
    %v201 = stablehlo.constant dense<1.0e-5> : tensor<32x24x56x56xf32>
    %v202 = stablehlo.reduce(%v198 init: %v199) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<24xf32>
    %v203 = stablehlo.broadcast_in_dim %v202, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v204 = stablehlo.divide %v203, %v200 : tensor<32x24x56x56xf32>
    %v205 = stablehlo.subtract %v198, %v204 : tensor<32x24x56x56xf32>
    %v206 = stablehlo.multiply %v205, %v205 : tensor<32x24x56x56xf32>
    %v207 = stablehlo.reduce(%v206 init: %v199) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<24xf32>
    %v208 = stablehlo.broadcast_in_dim %v207, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v209 = stablehlo.divide %v208, %v200 : tensor<32x24x56x56xf32>
    %v210 = stablehlo.add %v209, %v201 : tensor<32x24x56x56xf32>
    %v211 = stablehlo.rsqrt %v210 : tensor<32x24x56x56xf32>
    %v212 = stablehlo.multiply %v205, %v211 : tensor<32x24x56x56xf32>
    %v213 = stablehlo.broadcast_in_dim %b2pg, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v214 = stablehlo.broadcast_in_dim %b2pbt, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v215 = stablehlo.multiply %v212, %v213 : tensor<32x24x56x56xf32>
    %v216 = stablehlo.add %v215, %v214 : tensor<32x24x56x56xf32>
    %v217 = stablehlo.reshape %v216 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v218 = stablehlo.reshape %v217 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v219 = stablehlo.convolution(%v218, %b3eW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x24x56x56xf32>, tensor<144x24x1x1xf32>) -> tensor<32x144x56x56xf32>
    %v220 = stablehlo.broadcast_in_dim %b3eb, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v221 = stablehlo.add %v219, %v220 : tensor<32x144x56x56xf32>
    %v222 = stablehlo.reshape %v221 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v223 = stablehlo.reshape %v222 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v224 = stablehlo.constant dense<0.0> : tensor<f32>
    %v225 = stablehlo.constant dense<100352.0> : tensor<32x144x56x56xf32>
    %v226 = stablehlo.constant dense<1.0e-5> : tensor<32x144x56x56xf32>
    %v227 = stablehlo.reduce(%v223 init: %v224) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<144xf32>
    %v228 = stablehlo.broadcast_in_dim %v227, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v229 = stablehlo.divide %v228, %v225 : tensor<32x144x56x56xf32>
    %v230 = stablehlo.subtract %v223, %v229 : tensor<32x144x56x56xf32>
    %v231 = stablehlo.multiply %v230, %v230 : tensor<32x144x56x56xf32>
    %v232 = stablehlo.reduce(%v231 init: %v224) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<144xf32>
    %v233 = stablehlo.broadcast_in_dim %v232, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v234 = stablehlo.divide %v233, %v225 : tensor<32x144x56x56xf32>
    %v235 = stablehlo.add %v234, %v226 : tensor<32x144x56x56xf32>
    %v236 = stablehlo.rsqrt %v235 : tensor<32x144x56x56xf32>
    %v237 = stablehlo.multiply %v230, %v236 : tensor<32x144x56x56xf32>
    %v238 = stablehlo.broadcast_in_dim %b3eg, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v239 = stablehlo.broadcast_in_dim %b3ebt, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v240 = stablehlo.multiply %v237, %v238 : tensor<32x144x56x56xf32>
    %v241 = stablehlo.add %v240, %v239 : tensor<32x144x56x56xf32>
    %v242 = stablehlo.reshape %v241 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v243 = stablehlo.logistic %v242 : tensor<32x451584xf32>
    %v244 = stablehlo.multiply %v242, %v243 : tensor<32x451584xf32>
    %v245 = stablehlo.reshape %v244 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v246 = stablehlo.convolution(%v245, %b3dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 144 : i64} : (tensor<32x144x56x56xf32>, tensor<144x1x3x3xf32>) -> tensor<32x144x56x56xf32>
    %v247 = stablehlo.broadcast_in_dim %b3db, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v248 = stablehlo.add %v246, %v247 : tensor<32x144x56x56xf32>
    %v249 = stablehlo.reshape %v248 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v250 = stablehlo.reshape %v249 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v251 = stablehlo.constant dense<0.0> : tensor<f32>
    %v252 = stablehlo.constant dense<100352.0> : tensor<32x144x56x56xf32>
    %v253 = stablehlo.constant dense<1.0e-5> : tensor<32x144x56x56xf32>
    %v254 = stablehlo.reduce(%v250 init: %v251) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<144xf32>
    %v255 = stablehlo.broadcast_in_dim %v254, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v256 = stablehlo.divide %v255, %v252 : tensor<32x144x56x56xf32>
    %v257 = stablehlo.subtract %v250, %v256 : tensor<32x144x56x56xf32>
    %v258 = stablehlo.multiply %v257, %v257 : tensor<32x144x56x56xf32>
    %v259 = stablehlo.reduce(%v258 init: %v251) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<144xf32>
    %v260 = stablehlo.broadcast_in_dim %v259, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v261 = stablehlo.divide %v260, %v252 : tensor<32x144x56x56xf32>
    %v262 = stablehlo.add %v261, %v253 : tensor<32x144x56x56xf32>
    %v263 = stablehlo.rsqrt %v262 : tensor<32x144x56x56xf32>
    %v264 = stablehlo.multiply %v257, %v263 : tensor<32x144x56x56xf32>
    %v265 = stablehlo.broadcast_in_dim %b3dg, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v266 = stablehlo.broadcast_in_dim %b3dbt, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v267 = stablehlo.multiply %v264, %v265 : tensor<32x144x56x56xf32>
    %v268 = stablehlo.add %v267, %v266 : tensor<32x144x56x56xf32>
    %v269 = stablehlo.reshape %v268 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v270 = stablehlo.logistic %v269 : tensor<32x451584xf32>
    %v271 = stablehlo.multiply %v269, %v270 : tensor<32x451584xf32>
    %v272 = stablehlo.reshape %v271 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v273 = stablehlo.constant dense<0.0> : tensor<f32>
    %v274 = stablehlo.reduce(%v272 init: %v273) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v275 = stablehlo.constant dense<3136.0> : tensor<32x144xf32>
    %v276 = stablehlo.divide %v274, %v275 : tensor<32x144xf32>
    %v277 = stablehlo.dot_general %v276, %b3zW1, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x144xf32>, tensor<144x6xf32>) -> tensor<32x6xf32>
    %v278 = stablehlo.broadcast_in_dim %b3zb1, dims = [1] : (tensor<6xf32>) -> tensor<32x6xf32>
    %v279 = stablehlo.add %v277, %v278 : tensor<32x6xf32>
    %v280 = stablehlo.logistic %v279 : tensor<32x6xf32>
    %v281 = stablehlo.multiply %v279, %v280 : tensor<32x6xf32>
    %v282 = stablehlo.dot_general %v281, %b3zW2, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x6xf32>, tensor<6x144xf32>) -> tensor<32x144xf32>
    %v283 = stablehlo.broadcast_in_dim %b3zb2, dims = [1] : (tensor<144xf32>) -> tensor<32x144xf32>
    %v284 = stablehlo.add %v282, %v283 : tensor<32x144xf32>
    %v285 = stablehlo.reshape %v271 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v286 = stablehlo.constant dense<0.0> : tensor<f32>
    %v287 = stablehlo.reduce(%v285 init: %v286) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v288 = stablehlo.constant dense<3136.0> : tensor<32x144xf32>
    %v289 = stablehlo.divide %v287, %v288 : tensor<32x144xf32>
    %v290 = stablehlo.dot_general %v289, %b3zW1, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x144xf32>, tensor<144x6xf32>) -> tensor<32x6xf32>
    %v291 = stablehlo.broadcast_in_dim %b3zb1, dims = [1] : (tensor<6xf32>) -> tensor<32x6xf32>
    %v292 = stablehlo.add %v290, %v291 : tensor<32x6xf32>
    %v293 = stablehlo.logistic %v292 : tensor<32x6xf32>
    %v294 = stablehlo.multiply %v292, %v293 : tensor<32x6xf32>
    %v295 = stablehlo.dot_general %v294, %b3zW2, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x6xf32>, tensor<6x144xf32>) -> tensor<32x144xf32>
    %v296 = stablehlo.broadcast_in_dim %b3zb2, dims = [1] : (tensor<144xf32>) -> tensor<32x144xf32>
    %v297 = stablehlo.add %v295, %v296 : tensor<32x144xf32>
    %v298 = stablehlo.logistic %v297 : tensor<32x144xf32>
    %v299 = stablehlo.broadcast_in_dim %v298, dims = [0, 1] : (tensor<32x144xf32>) -> tensor<32x144x56x56xf32>
    %v300 = stablehlo.multiply %v285, %v299 : tensor<32x144x56x56xf32>
    %v301 = stablehlo.reshape %v300 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v302 = stablehlo.reshape %v301 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v303 = stablehlo.convolution(%v302, %b3pW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x144x56x56xf32>, tensor<24x144x1x1xf32>) -> tensor<32x24x56x56xf32>
    %v304 = stablehlo.broadcast_in_dim %b3pb, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v305 = stablehlo.add %v303, %v304 : tensor<32x24x56x56xf32>
    %v306 = stablehlo.reshape %v305 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v307 = stablehlo.reshape %v306 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v308 = stablehlo.constant dense<0.0> : tensor<f32>
    %v309 = stablehlo.constant dense<100352.0> : tensor<32x24x56x56xf32>
    %v310 = stablehlo.constant dense<1.0e-5> : tensor<32x24x56x56xf32>
    %v311 = stablehlo.reduce(%v307 init: %v308) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<24xf32>
    %v312 = stablehlo.broadcast_in_dim %v311, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v313 = stablehlo.divide %v312, %v309 : tensor<32x24x56x56xf32>
    %v314 = stablehlo.subtract %v307, %v313 : tensor<32x24x56x56xf32>
    %v315 = stablehlo.multiply %v314, %v314 : tensor<32x24x56x56xf32>
    %v316 = stablehlo.reduce(%v315 init: %v308) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<24xf32>
    %v317 = stablehlo.broadcast_in_dim %v316, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v318 = stablehlo.divide %v317, %v309 : tensor<32x24x56x56xf32>
    %v319 = stablehlo.add %v318, %v310 : tensor<32x24x56x56xf32>
    %v320 = stablehlo.rsqrt %v319 : tensor<32x24x56x56xf32>
    %v321 = stablehlo.multiply %v314, %v320 : tensor<32x24x56x56xf32>
    %v322 = stablehlo.broadcast_in_dim %b3pg, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v323 = stablehlo.broadcast_in_dim %b3pbt, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v324 = stablehlo.multiply %v321, %v322 : tensor<32x24x56x56xf32>
    %v325 = stablehlo.add %v324, %v323 : tensor<32x24x56x56xf32>
    %v326 = stablehlo.reshape %v325 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v327 = stablehlo.add %v326, %v217 : tensor<32x75264xf32>
    %v328 = stablehlo.reshape %v327 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v329 = stablehlo.convolution(%v328, %b4eW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x24x56x56xf32>, tensor<144x24x1x1xf32>) -> tensor<32x144x56x56xf32>
    %v330 = stablehlo.broadcast_in_dim %b4eb, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v331 = stablehlo.add %v329, %v330 : tensor<32x144x56x56xf32>
    %v332 = stablehlo.reshape %v331 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v333 = stablehlo.reshape %v332 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v334 = stablehlo.constant dense<0.0> : tensor<f32>
    %v335 = stablehlo.constant dense<100352.0> : tensor<32x144x56x56xf32>
    %v336 = stablehlo.constant dense<1.0e-5> : tensor<32x144x56x56xf32>
    %v337 = stablehlo.reduce(%v333 init: %v334) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<144xf32>
    %v338 = stablehlo.broadcast_in_dim %v337, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v339 = stablehlo.divide %v338, %v335 : tensor<32x144x56x56xf32>
    %v340 = stablehlo.subtract %v333, %v339 : tensor<32x144x56x56xf32>
    %v341 = stablehlo.multiply %v340, %v340 : tensor<32x144x56x56xf32>
    %v342 = stablehlo.reduce(%v341 init: %v334) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<144xf32>
    %v343 = stablehlo.broadcast_in_dim %v342, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v344 = stablehlo.divide %v343, %v335 : tensor<32x144x56x56xf32>
    %v345 = stablehlo.add %v344, %v336 : tensor<32x144x56x56xf32>
    %v346 = stablehlo.rsqrt %v345 : tensor<32x144x56x56xf32>
    %v347 = stablehlo.multiply %v340, %v346 : tensor<32x144x56x56xf32>
    %v348 = stablehlo.broadcast_in_dim %b4eg, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v349 = stablehlo.broadcast_in_dim %b4ebt, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v350 = stablehlo.multiply %v347, %v348 : tensor<32x144x56x56xf32>
    %v351 = stablehlo.add %v350, %v349 : tensor<32x144x56x56xf32>
    %v352 = stablehlo.reshape %v351 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v353 = stablehlo.logistic %v352 : tensor<32x451584xf32>
    %v354 = stablehlo.multiply %v352, %v353 : tensor<32x451584xf32>
    %v355 = stablehlo.reshape %v354 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v356 = stablehlo.convolution(%v355, %b4dW)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[2, 2], [2, 2]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 144 : i64} : (tensor<32x144x56x56xf32>, tensor<144x1x5x5xf32>) -> tensor<32x144x28x28xf32>
    %v357 = stablehlo.broadcast_in_dim %b4db, dims = [1] : (tensor<144xf32>) -> tensor<32x144x28x28xf32>
    %v358 = stablehlo.add %v356, %v357 : tensor<32x144x28x28xf32>
    %v359 = stablehlo.reshape %v358 : (tensor<32x144x28x28xf32>) -> tensor<32x112896xf32>
    %v360 = stablehlo.reshape %v359 : (tensor<32x112896xf32>) -> tensor<32x144x28x28xf32>
    %v361 = stablehlo.constant dense<0.0> : tensor<f32>
    %v362 = stablehlo.constant dense<25088.0> : tensor<32x144x28x28xf32>
    %v363 = stablehlo.constant dense<1.0e-5> : tensor<32x144x28x28xf32>
    %v364 = stablehlo.reduce(%v360 init: %v361) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x144x28x28xf32>, tensor<f32>) -> tensor<144xf32>
    %v365 = stablehlo.broadcast_in_dim %v364, dims = [1] : (tensor<144xf32>) -> tensor<32x144x28x28xf32>
    %v366 = stablehlo.divide %v365, %v362 : tensor<32x144x28x28xf32>
    %v367 = stablehlo.subtract %v360, %v366 : tensor<32x144x28x28xf32>
    %v368 = stablehlo.multiply %v367, %v367 : tensor<32x144x28x28xf32>
    %v369 = stablehlo.reduce(%v368 init: %v361) applies stablehlo.add across dimensions = [0, 2, 3] : (tensor<32x144x28x28xf32>, tensor<f32>) -> tensor<144xf32>
    %v370 = stablehlo.broadcast_in_dim %v369, dims = [1] : (tensor<144xf32>) -> tensor<32x144x28x28xf32>
    %v371 = stablehlo.divide %v370, %v362 : tensor<32x144x28x28xf32>
    %v372 = stablehlo.add %v371, %v363 : tensor<32x144x28x28xf32>
    %v373 = stablehlo.rsqrt %v372 : tensor<32x144x28x28xf32>
    %v374 = stablehlo.multiply %v367, %v373 : tensor<32x144x28x28xf32>
    %v375 = stablehlo.broadcast_in_dim %b4dg, dims = [1] : (tensor<144xf32>) -> tensor<32x144x28x28xf32>
    %v376 = stablehlo.broadcast_in_dim %b4dbt, dims = [1] : (tensor<144xf32>) -> tensor<32x144x28x28xf32>
    %v377 = stablehlo.multiply %v374, %v375 : tensor<32x144x28x28xf32>
    %v378 = stablehlo.add %v377, %v376 : tensor<32x144x28x28xf32>
    %v379 = stablehlo.reshape %v378 : (tensor<32x144x28x28xf32>) -> tensor<32x112896xf32>
    %v380 = stablehlo.logistic %v379 : tensor<32x112896xf32>
    %v381 = stablehlo.multiply %v379, %v380 : tensor<32x112896xf32>
    %v382 = stablehlo.reshape %v381 : (tensor<32x112896xf32>) -> tensor<32x144x28x28xf32>
    %v383 = stablehlo.constant dense<0.0> : tensor<f32>
    %v384 = stablehlo.reduce(%v382 init: %v383) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x28x28xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v385 = stablehlo.constant dense<784.0> : tensor<32x144xf32>
    %v386 = stablehlo.divide %v384, %v385 : tensor<32x144xf32>
    %v387 = stablehlo.dot_general %v386, %b4zW1, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x144xf32>, tensor<144x6xf32>) -> tensor<32x6xf32>
    %v388 = stablehlo.broadcast_in_dim %b4zb1, dims = [1] : (tensor<6xf32>) -> tensor<32x6xf32>
    %v389 = stablehlo.add %v387, %v388 : tensor<32x6xf32>
    %v390 = stablehlo.logistic %v389 : tensor<32x6xf32>
    %v391 = stablehlo.multiply %v389, %v390 : tensor<32x6xf32>
    %v392 = stablehlo.dot_general %v391, %b4zW2, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x6xf32>, tensor<6x144xf32>) -> tensor<32x144xf32>
    %v393 = stablehlo.broadcast_in_dim %b4zb2, dims = [1] : (tensor<144xf32>) -> tensor<32x144xf32>
    %v394 = stablehlo.add %v392, %v393 : tensor<32x144xf32>
    %v395 = stablehlo.reshape %v381 : (tensor<32x112896xf32>) -> tensor<32x144x28x28xf32>
    %v396 = stablehlo.constant dense<0.0> : tensor<f32>
    %v397 = stablehlo.reduce(%v395 init: %v396) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x28x28xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v398 = stablehlo.constant dense<784.0> : tensor<32x144xf32>
    %v399 = stablehlo.divide %v397, %v398 : tensor<32x144xf32>
    %v400 = stablehlo.dot_general %v399, %b4zW1, contracting_dims = [1] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x144xf32>, tensor<144x6xf32>) -> tensor<32x6xf32>
    %v401 = stablehlo.broadcast_in_dim %b4zb1, dims = [1] : (tensor<6xf32>) -> tensor<32x6xf32>
    %v402 = stablehlo.add %v400, %v401 : tensor<32x6xf32>
    %v403 = stablehlo.logistic %v402 : tensor<32x6xf32>
