module @m {
  func.func @mobilenetv2_paper_train_step(%x: tensor<32x150528xf32>, %Ws: tensor<32x3x3x3xf32>, %bs: tensor<32xf32>, %gs: tensor<32xf32>, %bts: tensor<32xf32>, %Wd1: tensor<32x1x3x3xf32>, %bd1: tensor<32xf32>, %gd1: tensor<32xf32>, %btd1: tensor<32xf32>, %Wp1: tensor<16x32x1x1xf32>, %bp1: tensor<16xf32>, %gp1: tensor<16xf32>, %btp1: tensor<16xf32>, %We2: tensor<96x16x1x1xf32>, %be2: tensor<96xf32>, %ge2: tensor<96xf32>, %bte2: tensor<96xf32>, %Wd2: tensor<96x1x3x3xf32>, %bd2: tensor<96xf32>, %gd2: tensor<96xf32>, %btd2: tensor<96xf32>, %Wp2: tensor<24x96x1x1xf32>, %bp2: tensor<24xf32>, %gp2: tensor<24xf32>, %btp2: tensor<24xf32>, %We3: tensor<144x24x1x1xf32>, %be3: tensor<144xf32>, %ge3: tensor<144xf32>, %bte3: tensor<144xf32>, %Wd3: tensor<144x1x3x3xf32>, %bd3: tensor<144xf32>, %gd3: tensor<144xf32>, %btd3: tensor<144xf32>, %Wp3: tensor<24x144x1x1xf32>, %bp3: tensor<24xf32>, %gp3: tensor<24xf32>, %btp3: tensor<24xf32>, %We4: tensor<144x24x1x1xf32>, %be4: tensor<144xf32>, %ge4: tensor<144xf32>, %bte4: tensor<144xf32>, %Wd4: tensor<144x1x3x3xf32>, %bd4: tensor<144xf32>, %gd4: tensor<144xf32>, %btd4: tensor<144xf32>, %Wp4: tensor<32x144x1x1xf32>, %bp4: tensor<32xf32>, %gp4: tensor<32xf32>, %btp4: tensor<32xf32>, %We5: tensor<192x32x1x1xf32>, %be5: tensor<192xf32>, %ge5: tensor<192xf32>, %bte5: tensor<192xf32>, %Wd5: tensor<192x1x3x3xf32>, %bd5: tensor<192xf32>, %gd5: tensor<192xf32>, %btd5: tensor<192xf32>, %Wp5: tensor<32x192x1x1xf32>, %bp5: tensor<32xf32>, %gp5: tensor<32xf32>, %btp5: tensor<32xf32>, %We6: tensor<192x32x1x1xf32>, %be6: tensor<192xf32>, %ge6: tensor<192xf32>, %bte6: tensor<192xf32>, %Wd6: tensor<192x1x3x3xf32>, %bd6: tensor<192xf32>, %gd6: tensor<192xf32>, %btd6: tensor<192xf32>, %Wp6: tensor<32x192x1x1xf32>, %bp6: tensor<32xf32>, %gp6: tensor<32xf32>, %btp6: tensor<32xf32>, %We7: tensor<192x32x1x1xf32>, %be7: tensor<192xf32>, %ge7: tensor<192xf32>, %bte7: tensor<192xf32>, %Wd7: tensor<192x1x3x3xf32>, %bd7: tensor<192xf32>, %gd7: tensor<192xf32>, %btd7: tensor<192xf32>, %Wp7: tensor<64x192x1x1xf32>, %bp7: tensor<64xf32>, %gp7: tensor<64xf32>, %btp7: tensor<64xf32>, %We8: tensor<384x64x1x1xf32>, %be8: tensor<384xf32>, %ge8: tensor<384xf32>, %bte8: tensor<384xf32>, %Wd8: tensor<384x1x3x3xf32>, %bd8: tensor<384xf32>, %gd8: tensor<384xf32>, %btd8: tensor<384xf32>, %Wp8: tensor<64x384x1x1xf32>, %bp8: tensor<64xf32>, %gp8: tensor<64xf32>, %btp8: tensor<64xf32>, %We9: tensor<384x64x1x1xf32>, %be9: tensor<384xf32>, %ge9: tensor<384xf32>, %bte9: tensor<384xf32>, %Wd9: tensor<384x1x3x3xf32>, %bd9: tensor<384xf32>, %gd9: tensor<384xf32>, %btd9: tensor<384xf32>, %Wp9: tensor<64x384x1x1xf32>, %bp9: tensor<64xf32>, %gp9: tensor<64xf32>, %btp9: tensor<64xf32>, %We10: tensor<384x64x1x1xf32>, %be10: tensor<384xf32>, %ge10: tensor<384xf32>, %bte10: tensor<384xf32>, %Wd10: tensor<384x1x3x3xf32>, %bd10: tensor<384xf32>, %gd10: tensor<384xf32>, %btd10: tensor<384xf32>, %Wp10: tensor<64x384x1x1xf32>, %bp10: tensor<64xf32>, %gp10: tensor<64xf32>, %btp10: tensor<64xf32>, %We11: tensor<384x64x1x1xf32>, %be11: tensor<384xf32>, %ge11: tensor<384xf32>, %bte11: tensor<384xf32>, %Wd11: tensor<384x1x3x3xf32>, %bd11: tensor<384xf32>, %gd11: tensor<384xf32>, %btd11: tensor<384xf32>, %Wp11: tensor<96x384x1x1xf32>, %bp11: tensor<96xf32>, %gp11: tensor<96xf32>, %btp11: tensor<96xf32>, %We12: tensor<576x96x1x1xf32>, %be12: tensor<576xf32>, %ge12: tensor<576xf32>, %bte12: tensor<576xf32>, %Wd12: tensor<576x1x3x3xf32>, %bd12: tensor<576xf32>, %gd12: tensor<576xf32>, %btd12: tensor<576xf32>, %Wp12: tensor<96x576x1x1xf32>, %bp12: tensor<96xf32>, %gp12: tensor<96xf32>, %btp12: tensor<96xf32>, %We13: tensor<576x96x1x1xf32>, %be13: tensor<576xf32>, %ge13: tensor<576xf32>, %bte13: tensor<576xf32>, %Wd13: tensor<576x1x3x3xf32>, %bd13: tensor<576xf32>, %gd13: tensor<576xf32>, %btd13: tensor<576xf32>, %Wp13: tensor<96x576x1x1xf32>, %bp13: tensor<96xf32>, %gp13: tensor<96xf32>, %btp13: tensor<96xf32>, %We14: tensor<576x96x1x1xf32>, %be14: tensor<576xf32>, %ge14: tensor<576xf32>, %bte14: tensor<576xf32>, %Wd14: tensor<576x1x3x3xf32>, %bd14: tensor<576xf32>, %gd14: tensor<576xf32>, %btd14: tensor<576xf32>, %Wp14: tensor<160x576x1x1xf32>, %bp14: tensor<160xf32>, %gp14: tensor<160xf32>, %btp14: tensor<160xf32>, %We15: tensor<960x160x1x1xf32>, %be15: tensor<960xf32>, %ge15: tensor<960xf32>, %bte15: tensor<960xf32>, %Wd15: tensor<960x1x3x3xf32>, %bd15: tensor<960xf32>, %gd15: tensor<960xf32>, %btd15: tensor<960xf32>, %Wp15: tensor<160x960x1x1xf32>, %bp15: tensor<160xf32>, %gp15: tensor<160xf32>, %btp15: tensor<160xf32>, %We16: tensor<960x160x1x1xf32>, %be16: tensor<960xf32>, %ge16: tensor<960xf32>, %bte16: tensor<960xf32>, %Wd16: tensor<960x1x3x3xf32>, %bd16: tensor<960xf32>, %gd16: tensor<960xf32>, %btd16: tensor<960xf32>, %Wp16: tensor<160x960x1x1xf32>, %bp16: tensor<160xf32>, %gp16: tensor<160xf32>, %btp16: tensor<160xf32>, %We17: tensor<960x160x1x1xf32>, %be17: tensor<960xf32>, %ge17: tensor<960xf32>, %bte17: tensor<960xf32>, %Wd17: tensor<960x1x3x3xf32>, %bd17: tensor<960xf32>, %gd17: tensor<960xf32>, %btd17: tensor<960xf32>, %Wp17: tensor<320x960x1x1xf32>, %bp17: tensor<320xf32>, %gp17: tensor<320xf32>, %btp17: tensor<320xf32>, %Wh: tensor<1280x320x1x1xf32>, %bh: tensor<1280xf32>, %gh: tensor<1280xf32>, %bth: tensor<1280xf32>, %Wfc: tensor<1280x10xf32>, %bfc: tensor<10xf32>, %onehot: tensor<32x10xf32>) -> (tensor<32x3x3x3xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32x1x3x3xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32xf32>, tensor<16x32x1x1xf32>, tensor<16xf32>, tensor<16xf32>, tensor<16xf32>, tensor<96x16x1x1xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96x1x3x3xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96xf32>, tensor<24x96x1x1xf32>, tensor<24xf32>, tensor<24xf32>, tensor<24xf32>, tensor<144x24x1x1xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144x1x3x3xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144xf32>, tensor<24x144x1x1xf32>, tensor<24xf32>, tensor<24xf32>, tensor<24xf32>, tensor<144x24x1x1xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144x1x3x3xf32>, tensor<144xf32>, tensor<144xf32>, tensor<144xf32>, tensor<32x144x1x1xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32xf32>, tensor<192x32x1x1xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x1x3x3xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<32x192x1x1xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32xf32>, tensor<192x32x1x1xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x1x3x3xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<32x192x1x1xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32xf32>, tensor<192x32x1x1xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x1x3x3xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<64x192x1x1xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<384x64x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x3x3xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384xf32>, tensor<64x384x1x1xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<384x64x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x3x3xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384xf32>, tensor<64x384x1x1xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<384x64x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x3x3xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384xf32>, tensor<64x384x1x1xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<384x64x1x1xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384x1x3x3xf32>, tensor<384xf32>, tensor<384xf32>, tensor<384xf32>, tensor<96x384x1x1xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96xf32>, tensor<576x96x1x1xf32>, tensor<576xf32>, tensor<576xf32>, tensor<576xf32>, tensor<576x1x3x3xf32>, tensor<576xf32>, tensor<576xf32>, tensor<576xf32>, tensor<96x576x1x1xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96xf32>, tensor<576x96x1x1xf32>, tensor<576xf32>, tensor<576xf32>, tensor<576xf32>, tensor<576x1x3x3xf32>, tensor<576xf32>, tensor<576xf32>, tensor<576xf32>, tensor<96x576x1x1xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96xf32>, tensor<576x96x1x1xf32>, tensor<576xf32>, tensor<576xf32>, tensor<576xf32>, tensor<576x1x3x3xf32>, tensor<576xf32>, tensor<576xf32>, tensor<576xf32>, tensor<160x576x1x1xf32>, tensor<160xf32>, tensor<160xf32>, tensor<160xf32>, tensor<960x160x1x1xf32>, tensor<960xf32>, tensor<960xf32>, tensor<960xf32>, tensor<960x1x3x3xf32>, tensor<960xf32>, tensor<960xf32>, tensor<960xf32>, tensor<160x960x1x1xf32>, tensor<160xf32>, tensor<160xf32>, tensor<160xf32>, tensor<960x160x1x1xf32>, tensor<960xf32>, tensor<960xf32>, tensor<960xf32>, tensor<960x1x3x3xf32>, tensor<960xf32>, tensor<960xf32>, tensor<960xf32>, tensor<160x960x1x1xf32>, tensor<160xf32>, tensor<160xf32>, tensor<160xf32>, tensor<960x160x1x1xf32>, tensor<960xf32>, tensor<960xf32>, tensor<960xf32>, tensor<960x1x3x3xf32>, tensor<960xf32>, tensor<960xf32>, tensor<960xf32>, tensor<320x960x1x1xf32>, tensor<320xf32>, tensor<320xf32>, tensor<320xf32>, tensor<1280x320x1x1xf32>, tensor<1280xf32>, tensor<1280xf32>, tensor<1280xf32>, tensor<1280x10xf32>, tensor<10xf32>) {
    // ── MobileNetV2 (17-block paper) train step: every line is pretty(verified AST node) ──
    %v0 = stablehlo.reshape %x : (tensor<32x150528xf32>) -> tensor<32x3x224x224xf32>
    %v1 = stablehlo.convolution(%v0, %Ws)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x3x224x224xf32>, tensor<32x3x3x3xf32>) -> tensor<32x32x112x112xf32>
    %v2 = stablehlo.broadcast_in_dim %bs, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v3 = stablehlo.add %v1, %v2 : tensor<32x32x112x112xf32>
    %v4 = stablehlo.reshape %v3 : (tensor<32x32x112x112xf32>) -> tensor<32x401408xf32>
    %v5 = stablehlo.reshape %v4 : (tensor<32x401408xf32>) -> tensor<32x32x112x112xf32>
    %v6 = stablehlo.constant dense<0.0> : tensor<f32>
    %v7 = stablehlo.constant dense<12544.0> : tensor<32x32x112x112xf32>
    %v8 = stablehlo.constant dense<1.0e-5> : tensor<32x32x112x112xf32>
    %v9 = stablehlo.reduce(%v5 init: %v6) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x112x112xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v10 = stablehlo.broadcast_in_dim %v9, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x112x112xf32>
    %v11 = stablehlo.divide %v10, %v7 : tensor<32x32x112x112xf32>
    %v12 = stablehlo.subtract %v5, %v11 : tensor<32x32x112x112xf32>
    %v13 = stablehlo.multiply %v12, %v12 : tensor<32x32x112x112xf32>
    %v14 = stablehlo.reduce(%v13 init: %v6) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x112x112xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v15 = stablehlo.broadcast_in_dim %v14, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x112x112xf32>
    %v16 = stablehlo.divide %v15, %v7 : tensor<32x32x112x112xf32>
    %v17 = stablehlo.add %v16, %v8 : tensor<32x32x112x112xf32>
    %v18 = stablehlo.rsqrt %v17 : tensor<32x32x112x112xf32>
    %v19 = stablehlo.multiply %v12, %v18 : tensor<32x32x112x112xf32>
    %v20 = stablehlo.broadcast_in_dim %gs, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v21 = stablehlo.broadcast_in_dim %bts, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v22 = stablehlo.multiply %v19, %v20 : tensor<32x32x112x112xf32>
    %v23 = stablehlo.add %v22, %v21 : tensor<32x32x112x112xf32>
    %v24 = stablehlo.reshape %v23 : (tensor<32x32x112x112xf32>) -> tensor<32x401408xf32>
    %v25 = stablehlo.constant dense<0.0> : tensor<32x401408xf32>
    %v26 = stablehlo.constant dense<6.0> : tensor<32x401408xf32>
    %v27 = stablehlo.maximum %v24, %v25 : tensor<32x401408xf32>
    %v28 = stablehlo.minimum %v27, %v26 : tensor<32x401408xf32>
    %v29 = stablehlo.reshape %v28 : (tensor<32x401408xf32>) -> tensor<32x32x112x112xf32>
    %v30 = stablehlo.convolution(%v29, %Wd1)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 32 : i64} : (tensor<32x32x112x112xf32>, tensor<32x1x3x3xf32>) -> tensor<32x32x112x112xf32>
    %v31 = stablehlo.broadcast_in_dim %bd1, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v32 = stablehlo.add %v30, %v31 : tensor<32x32x112x112xf32>
    %v33 = stablehlo.reshape %v32 : (tensor<32x32x112x112xf32>) -> tensor<32x401408xf32>
    %v34 = stablehlo.reshape %v33 : (tensor<32x401408xf32>) -> tensor<32x32x112x112xf32>
    %v35 = stablehlo.constant dense<0.0> : tensor<f32>
    %v36 = stablehlo.constant dense<12544.0> : tensor<32x32x112x112xf32>
    %v37 = stablehlo.constant dense<1.0e-5> : tensor<32x32x112x112xf32>
    %v38 = stablehlo.reduce(%v34 init: %v35) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x112x112xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v39 = stablehlo.broadcast_in_dim %v38, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x112x112xf32>
    %v40 = stablehlo.divide %v39, %v36 : tensor<32x32x112x112xf32>
    %v41 = stablehlo.subtract %v34, %v40 : tensor<32x32x112x112xf32>
    %v42 = stablehlo.multiply %v41, %v41 : tensor<32x32x112x112xf32>
    %v43 = stablehlo.reduce(%v42 init: %v35) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x112x112xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v44 = stablehlo.broadcast_in_dim %v43, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x112x112xf32>
    %v45 = stablehlo.divide %v44, %v36 : tensor<32x32x112x112xf32>
    %v46 = stablehlo.add %v45, %v37 : tensor<32x32x112x112xf32>
    %v47 = stablehlo.rsqrt %v46 : tensor<32x32x112x112xf32>
    %v48 = stablehlo.multiply %v41, %v47 : tensor<32x32x112x112xf32>
    %v49 = stablehlo.broadcast_in_dim %gd1, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v50 = stablehlo.broadcast_in_dim %btd1, dims = [1] : (tensor<32xf32>) -> tensor<32x32x112x112xf32>
    %v51 = stablehlo.multiply %v48, %v49 : tensor<32x32x112x112xf32>
    %v52 = stablehlo.add %v51, %v50 : tensor<32x32x112x112xf32>
    %v53 = stablehlo.reshape %v52 : (tensor<32x32x112x112xf32>) -> tensor<32x401408xf32>
    %v54 = stablehlo.constant dense<0.0> : tensor<32x401408xf32>
    %v55 = stablehlo.constant dense<6.0> : tensor<32x401408xf32>
    %v56 = stablehlo.maximum %v53, %v54 : tensor<32x401408xf32>
    %v57 = stablehlo.minimum %v56, %v55 : tensor<32x401408xf32>
    %v58 = stablehlo.reshape %v57 : (tensor<32x401408xf32>) -> tensor<32x32x112x112xf32>
    %v59 = stablehlo.convolution(%v58, %Wp1)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x32x112x112xf32>, tensor<16x32x1x1xf32>) -> tensor<32x16x112x112xf32>
    %v60 = stablehlo.broadcast_in_dim %bp1, dims = [1] : (tensor<16xf32>) -> tensor<32x16x112x112xf32>
    %v61 = stablehlo.add %v59, %v60 : tensor<32x16x112x112xf32>
    %v62 = stablehlo.reshape %v61 : (tensor<32x16x112x112xf32>) -> tensor<32x200704xf32>
    %v63 = stablehlo.reshape %v62 : (tensor<32x200704xf32>) -> tensor<32x16x112x112xf32>
    %v64 = stablehlo.constant dense<0.0> : tensor<f32>
    %v65 = stablehlo.constant dense<12544.0> : tensor<32x16x112x112xf32>
    %v66 = stablehlo.constant dense<1.0e-5> : tensor<32x16x112x112xf32>
    %v67 = stablehlo.reduce(%v63 init: %v64) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x16x112x112xf32>, tensor<f32>) -> tensor<32x16xf32>
    %v68 = stablehlo.broadcast_in_dim %v67, dims = [0, 1] : (tensor<32x16xf32>) -> tensor<32x16x112x112xf32>
    %v69 = stablehlo.divide %v68, %v65 : tensor<32x16x112x112xf32>
    %v70 = stablehlo.subtract %v63, %v69 : tensor<32x16x112x112xf32>
    %v71 = stablehlo.multiply %v70, %v70 : tensor<32x16x112x112xf32>
    %v72 = stablehlo.reduce(%v71 init: %v64) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x16x112x112xf32>, tensor<f32>) -> tensor<32x16xf32>
    %v73 = stablehlo.broadcast_in_dim %v72, dims = [0, 1] : (tensor<32x16xf32>) -> tensor<32x16x112x112xf32>
    %v74 = stablehlo.divide %v73, %v65 : tensor<32x16x112x112xf32>
    %v75 = stablehlo.add %v74, %v66 : tensor<32x16x112x112xf32>
    %v76 = stablehlo.rsqrt %v75 : tensor<32x16x112x112xf32>
    %v77 = stablehlo.multiply %v70, %v76 : tensor<32x16x112x112xf32>
    %v78 = stablehlo.broadcast_in_dim %gp1, dims = [1] : (tensor<16xf32>) -> tensor<32x16x112x112xf32>
    %v79 = stablehlo.broadcast_in_dim %btp1, dims = [1] : (tensor<16xf32>) -> tensor<32x16x112x112xf32>
    %v80 = stablehlo.multiply %v77, %v78 : tensor<32x16x112x112xf32>
    %v81 = stablehlo.add %v80, %v79 : tensor<32x16x112x112xf32>
    %v82 = stablehlo.reshape %v81 : (tensor<32x16x112x112xf32>) -> tensor<32x200704xf32>
    %v83 = stablehlo.reshape %v82 : (tensor<32x200704xf32>) -> tensor<32x16x112x112xf32>
    %v84 = stablehlo.convolution(%v83, %We2)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x16x112x112xf32>, tensor<96x16x1x1xf32>) -> tensor<32x96x112x112xf32>
    %v85 = stablehlo.broadcast_in_dim %be2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x112x112xf32>
    %v86 = stablehlo.add %v84, %v85 : tensor<32x96x112x112xf32>
    %v87 = stablehlo.reshape %v86 : (tensor<32x96x112x112xf32>) -> tensor<32x1204224xf32>
    %v88 = stablehlo.reshape %v87 : (tensor<32x1204224xf32>) -> tensor<32x96x112x112xf32>
    %v89 = stablehlo.constant dense<0.0> : tensor<f32>
    %v90 = stablehlo.constant dense<12544.0> : tensor<32x96x112x112xf32>
    %v91 = stablehlo.constant dense<1.0e-5> : tensor<32x96x112x112xf32>
    %v92 = stablehlo.reduce(%v88 init: %v89) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x112x112xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v93 = stablehlo.broadcast_in_dim %v92, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x112x112xf32>
    %v94 = stablehlo.divide %v93, %v90 : tensor<32x96x112x112xf32>
    %v95 = stablehlo.subtract %v88, %v94 : tensor<32x96x112x112xf32>
    %v96 = stablehlo.multiply %v95, %v95 : tensor<32x96x112x112xf32>
    %v97 = stablehlo.reduce(%v96 init: %v89) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x112x112xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v98 = stablehlo.broadcast_in_dim %v97, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x112x112xf32>
    %v99 = stablehlo.divide %v98, %v90 : tensor<32x96x112x112xf32>
    %v100 = stablehlo.add %v99, %v91 : tensor<32x96x112x112xf32>
    %v101 = stablehlo.rsqrt %v100 : tensor<32x96x112x112xf32>
    %v102 = stablehlo.multiply %v95, %v101 : tensor<32x96x112x112xf32>
    %v103 = stablehlo.broadcast_in_dim %ge2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x112x112xf32>
    %v104 = stablehlo.broadcast_in_dim %bte2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x112x112xf32>
    %v105 = stablehlo.multiply %v102, %v103 : tensor<32x96x112x112xf32>
    %v106 = stablehlo.add %v105, %v104 : tensor<32x96x112x112xf32>
    %v107 = stablehlo.reshape %v106 : (tensor<32x96x112x112xf32>) -> tensor<32x1204224xf32>
    %v108 = stablehlo.constant dense<0.0> : tensor<32x1204224xf32>
    %v109 = stablehlo.constant dense<6.0> : tensor<32x1204224xf32>
    %v110 = stablehlo.maximum %v107, %v108 : tensor<32x1204224xf32>
    %v111 = stablehlo.minimum %v110, %v109 : tensor<32x1204224xf32>
    %v112 = stablehlo.reshape %v111 : (tensor<32x1204224xf32>) -> tensor<32x96x112x112xf32>
    %v113 = stablehlo.convolution(%v112, %Wd2)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 96 : i64} : (tensor<32x96x112x112xf32>, tensor<96x1x3x3xf32>) -> tensor<32x96x56x56xf32>
    %v114 = stablehlo.broadcast_in_dim %bd2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v115 = stablehlo.add %v113, %v114 : tensor<32x96x56x56xf32>
    %v116 = stablehlo.reshape %v115 : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %v117 = stablehlo.reshape %v116 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v118 = stablehlo.constant dense<0.0> : tensor<f32>
    %v119 = stablehlo.constant dense<3136.0> : tensor<32x96x56x56xf32>
    %v120 = stablehlo.constant dense<1.0e-5> : tensor<32x96x56x56xf32>
    %v121 = stablehlo.reduce(%v117 init: %v118) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v122 = stablehlo.broadcast_in_dim %v121, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x56x56xf32>
    %v123 = stablehlo.divide %v122, %v119 : tensor<32x96x56x56xf32>
    %v124 = stablehlo.subtract %v117, %v123 : tensor<32x96x56x56xf32>
    %v125 = stablehlo.multiply %v124, %v124 : tensor<32x96x56x56xf32>
    %v126 = stablehlo.reduce(%v125 init: %v118) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v127 = stablehlo.broadcast_in_dim %v126, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x56x56xf32>
    %v128 = stablehlo.divide %v127, %v119 : tensor<32x96x56x56xf32>
    %v129 = stablehlo.add %v128, %v120 : tensor<32x96x56x56xf32>
    %v130 = stablehlo.rsqrt %v129 : tensor<32x96x56x56xf32>
    %v131 = stablehlo.multiply %v124, %v130 : tensor<32x96x56x56xf32>
    %v132 = stablehlo.broadcast_in_dim %gd2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v133 = stablehlo.broadcast_in_dim %btd2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v134 = stablehlo.multiply %v131, %v132 : tensor<32x96x56x56xf32>
    %v135 = stablehlo.add %v134, %v133 : tensor<32x96x56x56xf32>
    %v136 = stablehlo.reshape %v135 : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %v137 = stablehlo.constant dense<0.0> : tensor<32x301056xf32>
    %v138 = stablehlo.constant dense<6.0> : tensor<32x301056xf32>
    %v139 = stablehlo.maximum %v136, %v137 : tensor<32x301056xf32>
    %v140 = stablehlo.minimum %v139, %v138 : tensor<32x301056xf32>
    %v141 = stablehlo.reshape %v140 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v142 = stablehlo.convolution(%v141, %Wp2)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x96x56x56xf32>, tensor<24x96x1x1xf32>) -> tensor<32x24x56x56xf32>
    %v143 = stablehlo.broadcast_in_dim %bp2, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v144 = stablehlo.add %v142, %v143 : tensor<32x24x56x56xf32>
    %v145 = stablehlo.reshape %v144 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v146 = stablehlo.reshape %v145 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v147 = stablehlo.constant dense<0.0> : tensor<f32>
    %v148 = stablehlo.constant dense<3136.0> : tensor<32x24x56x56xf32>
    %v149 = stablehlo.constant dense<1.0e-5> : tensor<32x24x56x56xf32>
    %v150 = stablehlo.reduce(%v146 init: %v147) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<32x24xf32>
    %v151 = stablehlo.broadcast_in_dim %v150, dims = [0, 1] : (tensor<32x24xf32>) -> tensor<32x24x56x56xf32>
    %v152 = stablehlo.divide %v151, %v148 : tensor<32x24x56x56xf32>
    %v153 = stablehlo.subtract %v146, %v152 : tensor<32x24x56x56xf32>
    %v154 = stablehlo.multiply %v153, %v153 : tensor<32x24x56x56xf32>
    %v155 = stablehlo.reduce(%v154 init: %v147) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<32x24xf32>
    %v156 = stablehlo.broadcast_in_dim %v155, dims = [0, 1] : (tensor<32x24xf32>) -> tensor<32x24x56x56xf32>
    %v157 = stablehlo.divide %v156, %v148 : tensor<32x24x56x56xf32>
    %v158 = stablehlo.add %v157, %v149 : tensor<32x24x56x56xf32>
    %v159 = stablehlo.rsqrt %v158 : tensor<32x24x56x56xf32>
    %v160 = stablehlo.multiply %v153, %v159 : tensor<32x24x56x56xf32>
    %v161 = stablehlo.broadcast_in_dim %gp2, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v162 = stablehlo.broadcast_in_dim %btp2, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v163 = stablehlo.multiply %v160, %v161 : tensor<32x24x56x56xf32>
    %v164 = stablehlo.add %v163, %v162 : tensor<32x24x56x56xf32>
    %v165 = stablehlo.reshape %v164 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v166 = stablehlo.reshape %v165 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v167 = stablehlo.convolution(%v166, %We3)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x24x56x56xf32>, tensor<144x24x1x1xf32>) -> tensor<32x144x56x56xf32>
    %v168 = stablehlo.broadcast_in_dim %be3, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v169 = stablehlo.add %v167, %v168 : tensor<32x144x56x56xf32>
    %v170 = stablehlo.reshape %v169 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v171 = stablehlo.reshape %v170 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v172 = stablehlo.constant dense<0.0> : tensor<f32>
    %v173 = stablehlo.constant dense<3136.0> : tensor<32x144x56x56xf32>
    %v174 = stablehlo.constant dense<1.0e-5> : tensor<32x144x56x56xf32>
    %v175 = stablehlo.reduce(%v171 init: %v172) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v176 = stablehlo.broadcast_in_dim %v175, dims = [0, 1] : (tensor<32x144xf32>) -> tensor<32x144x56x56xf32>
    %v177 = stablehlo.divide %v176, %v173 : tensor<32x144x56x56xf32>
    %v178 = stablehlo.subtract %v171, %v177 : tensor<32x144x56x56xf32>
    %v179 = stablehlo.multiply %v178, %v178 : tensor<32x144x56x56xf32>
    %v180 = stablehlo.reduce(%v179 init: %v172) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v181 = stablehlo.broadcast_in_dim %v180, dims = [0, 1] : (tensor<32x144xf32>) -> tensor<32x144x56x56xf32>
    %v182 = stablehlo.divide %v181, %v173 : tensor<32x144x56x56xf32>
    %v183 = stablehlo.add %v182, %v174 : tensor<32x144x56x56xf32>
    %v184 = stablehlo.rsqrt %v183 : tensor<32x144x56x56xf32>
    %v185 = stablehlo.multiply %v178, %v184 : tensor<32x144x56x56xf32>
    %v186 = stablehlo.broadcast_in_dim %ge3, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v187 = stablehlo.broadcast_in_dim %bte3, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v188 = stablehlo.multiply %v185, %v186 : tensor<32x144x56x56xf32>
    %v189 = stablehlo.add %v188, %v187 : tensor<32x144x56x56xf32>
    %v190 = stablehlo.reshape %v189 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v191 = stablehlo.constant dense<0.0> : tensor<32x451584xf32>
    %v192 = stablehlo.constant dense<6.0> : tensor<32x451584xf32>
    %v193 = stablehlo.maximum %v190, %v191 : tensor<32x451584xf32>
    %v194 = stablehlo.minimum %v193, %v192 : tensor<32x451584xf32>
    %v195 = stablehlo.reshape %v194 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v196 = stablehlo.convolution(%v195, %Wd3)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 144 : i64} : (tensor<32x144x56x56xf32>, tensor<144x1x3x3xf32>) -> tensor<32x144x56x56xf32>
    %v197 = stablehlo.broadcast_in_dim %bd3, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v198 = stablehlo.add %v196, %v197 : tensor<32x144x56x56xf32>
    %v199 = stablehlo.reshape %v198 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v200 = stablehlo.reshape %v199 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v201 = stablehlo.constant dense<0.0> : tensor<f32>
    %v202 = stablehlo.constant dense<3136.0> : tensor<32x144x56x56xf32>
    %v203 = stablehlo.constant dense<1.0e-5> : tensor<32x144x56x56xf32>
    %v204 = stablehlo.reduce(%v200 init: %v201) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v205 = stablehlo.broadcast_in_dim %v204, dims = [0, 1] : (tensor<32x144xf32>) -> tensor<32x144x56x56xf32>
    %v206 = stablehlo.divide %v205, %v202 : tensor<32x144x56x56xf32>
    %v207 = stablehlo.subtract %v200, %v206 : tensor<32x144x56x56xf32>
    %v208 = stablehlo.multiply %v207, %v207 : tensor<32x144x56x56xf32>
    %v209 = stablehlo.reduce(%v208 init: %v201) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v210 = stablehlo.broadcast_in_dim %v209, dims = [0, 1] : (tensor<32x144xf32>) -> tensor<32x144x56x56xf32>
    %v211 = stablehlo.divide %v210, %v202 : tensor<32x144x56x56xf32>
    %v212 = stablehlo.add %v211, %v203 : tensor<32x144x56x56xf32>
    %v213 = stablehlo.rsqrt %v212 : tensor<32x144x56x56xf32>
    %v214 = stablehlo.multiply %v207, %v213 : tensor<32x144x56x56xf32>
    %v215 = stablehlo.broadcast_in_dim %gd3, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v216 = stablehlo.broadcast_in_dim %btd3, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v217 = stablehlo.multiply %v214, %v215 : tensor<32x144x56x56xf32>
    %v218 = stablehlo.add %v217, %v216 : tensor<32x144x56x56xf32>
    %v219 = stablehlo.reshape %v218 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v220 = stablehlo.constant dense<0.0> : tensor<32x451584xf32>
    %v221 = stablehlo.constant dense<6.0> : tensor<32x451584xf32>
    %v222 = stablehlo.maximum %v219, %v220 : tensor<32x451584xf32>
    %v223 = stablehlo.minimum %v222, %v221 : tensor<32x451584xf32>
    %v224 = stablehlo.reshape %v223 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v225 = stablehlo.convolution(%v224, %Wp3)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x144x56x56xf32>, tensor<24x144x1x1xf32>) -> tensor<32x24x56x56xf32>
    %v226 = stablehlo.broadcast_in_dim %bp3, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v227 = stablehlo.add %v225, %v226 : tensor<32x24x56x56xf32>
    %v228 = stablehlo.reshape %v227 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v229 = stablehlo.reshape %v228 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v230 = stablehlo.constant dense<0.0> : tensor<f32>
    %v231 = stablehlo.constant dense<3136.0> : tensor<32x24x56x56xf32>
    %v232 = stablehlo.constant dense<1.0e-5> : tensor<32x24x56x56xf32>
    %v233 = stablehlo.reduce(%v229 init: %v230) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<32x24xf32>
    %v234 = stablehlo.broadcast_in_dim %v233, dims = [0, 1] : (tensor<32x24xf32>) -> tensor<32x24x56x56xf32>
    %v235 = stablehlo.divide %v234, %v231 : tensor<32x24x56x56xf32>
    %v236 = stablehlo.subtract %v229, %v235 : tensor<32x24x56x56xf32>
    %v237 = stablehlo.multiply %v236, %v236 : tensor<32x24x56x56xf32>
    %v238 = stablehlo.reduce(%v237 init: %v230) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<32x24xf32>
    %v239 = stablehlo.broadcast_in_dim %v238, dims = [0, 1] : (tensor<32x24xf32>) -> tensor<32x24x56x56xf32>
    %v240 = stablehlo.divide %v239, %v231 : tensor<32x24x56x56xf32>
    %v241 = stablehlo.add %v240, %v232 : tensor<32x24x56x56xf32>
    %v242 = stablehlo.rsqrt %v241 : tensor<32x24x56x56xf32>
    %v243 = stablehlo.multiply %v236, %v242 : tensor<32x24x56x56xf32>
    %v244 = stablehlo.broadcast_in_dim %gp3, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v245 = stablehlo.broadcast_in_dim %btp3, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v246 = stablehlo.multiply %v243, %v244 : tensor<32x24x56x56xf32>
    %v247 = stablehlo.add %v246, %v245 : tensor<32x24x56x56xf32>
    %v248 = stablehlo.reshape %v247 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v249 = stablehlo.add %v248, %v165 : tensor<32x75264xf32>
    %v250 = stablehlo.reshape %v249 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v251 = stablehlo.convolution(%v250, %We4)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x24x56x56xf32>, tensor<144x24x1x1xf32>) -> tensor<32x144x56x56xf32>
    %v252 = stablehlo.broadcast_in_dim %be4, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v253 = stablehlo.add %v251, %v252 : tensor<32x144x56x56xf32>
    %v254 = stablehlo.reshape %v253 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v255 = stablehlo.reshape %v254 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v256 = stablehlo.constant dense<0.0> : tensor<f32>
    %v257 = stablehlo.constant dense<3136.0> : tensor<32x144x56x56xf32>
    %v258 = stablehlo.constant dense<1.0e-5> : tensor<32x144x56x56xf32>
    %v259 = stablehlo.reduce(%v255 init: %v256) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v260 = stablehlo.broadcast_in_dim %v259, dims = [0, 1] : (tensor<32x144xf32>) -> tensor<32x144x56x56xf32>
    %v261 = stablehlo.divide %v260, %v257 : tensor<32x144x56x56xf32>
    %v262 = stablehlo.subtract %v255, %v261 : tensor<32x144x56x56xf32>
    %v263 = stablehlo.multiply %v262, %v262 : tensor<32x144x56x56xf32>
    %v264 = stablehlo.reduce(%v263 init: %v256) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x56x56xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v265 = stablehlo.broadcast_in_dim %v264, dims = [0, 1] : (tensor<32x144xf32>) -> tensor<32x144x56x56xf32>
    %v266 = stablehlo.divide %v265, %v257 : tensor<32x144x56x56xf32>
    %v267 = stablehlo.add %v266, %v258 : tensor<32x144x56x56xf32>
    %v268 = stablehlo.rsqrt %v267 : tensor<32x144x56x56xf32>
    %v269 = stablehlo.multiply %v262, %v268 : tensor<32x144x56x56xf32>
    %v270 = stablehlo.broadcast_in_dim %ge4, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v271 = stablehlo.broadcast_in_dim %bte4, dims = [1] : (tensor<144xf32>) -> tensor<32x144x56x56xf32>
    %v272 = stablehlo.multiply %v269, %v270 : tensor<32x144x56x56xf32>
    %v273 = stablehlo.add %v272, %v271 : tensor<32x144x56x56xf32>
    %v274 = stablehlo.reshape %v273 : (tensor<32x144x56x56xf32>) -> tensor<32x451584xf32>
    %v275 = stablehlo.constant dense<0.0> : tensor<32x451584xf32>
    %v276 = stablehlo.constant dense<6.0> : tensor<32x451584xf32>
    %v277 = stablehlo.maximum %v274, %v275 : tensor<32x451584xf32>
    %v278 = stablehlo.minimum %v277, %v276 : tensor<32x451584xf32>
    %v279 = stablehlo.reshape %v278 : (tensor<32x451584xf32>) -> tensor<32x144x56x56xf32>
    %v280 = stablehlo.convolution(%v279, %Wd4)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 144 : i64} : (tensor<32x144x56x56xf32>, tensor<144x1x3x3xf32>) -> tensor<32x144x28x28xf32>
    %v281 = stablehlo.broadcast_in_dim %bd4, dims = [1] : (tensor<144xf32>) -> tensor<32x144x28x28xf32>
    %v282 = stablehlo.add %v280, %v281 : tensor<32x144x28x28xf32>
    %v283 = stablehlo.reshape %v282 : (tensor<32x144x28x28xf32>) -> tensor<32x112896xf32>
    %v284 = stablehlo.reshape %v283 : (tensor<32x112896xf32>) -> tensor<32x144x28x28xf32>
    %v285 = stablehlo.constant dense<0.0> : tensor<f32>
    %v286 = stablehlo.constant dense<784.0> : tensor<32x144x28x28xf32>
    %v287 = stablehlo.constant dense<1.0e-5> : tensor<32x144x28x28xf32>
    %v288 = stablehlo.reduce(%v284 init: %v285) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x28x28xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v289 = stablehlo.broadcast_in_dim %v288, dims = [0, 1] : (tensor<32x144xf32>) -> tensor<32x144x28x28xf32>
    %v290 = stablehlo.divide %v289, %v286 : tensor<32x144x28x28xf32>
    %v291 = stablehlo.subtract %v284, %v290 : tensor<32x144x28x28xf32>
    %v292 = stablehlo.multiply %v291, %v291 : tensor<32x144x28x28xf32>
    %v293 = stablehlo.reduce(%v292 init: %v285) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x144x28x28xf32>, tensor<f32>) -> tensor<32x144xf32>
    %v294 = stablehlo.broadcast_in_dim %v293, dims = [0, 1] : (tensor<32x144xf32>) -> tensor<32x144x28x28xf32>
    %v295 = stablehlo.divide %v294, %v286 : tensor<32x144x28x28xf32>
    %v296 = stablehlo.add %v295, %v287 : tensor<32x144x28x28xf32>
    %v297 = stablehlo.rsqrt %v296 : tensor<32x144x28x28xf32>
    %v298 = stablehlo.multiply %v291, %v297 : tensor<32x144x28x28xf32>
    %v299 = stablehlo.broadcast_in_dim %gd4, dims = [1] : (tensor<144xf32>) -> tensor<32x144x28x28xf32>
    %v300 = stablehlo.broadcast_in_dim %btd4, dims = [1] : (tensor<144xf32>) -> tensor<32x144x28x28xf32>
    %v301 = stablehlo.multiply %v298, %v299 : tensor<32x144x28x28xf32>
    %v302 = stablehlo.add %v301, %v300 : tensor<32x144x28x28xf32>
    %v303 = stablehlo.reshape %v302 : (tensor<32x144x28x28xf32>) -> tensor<32x112896xf32>
    %v304 = stablehlo.constant dense<0.0> : tensor<32x112896xf32>
    %v305 = stablehlo.constant dense<6.0> : tensor<32x112896xf32>
    %v306 = stablehlo.maximum %v303, %v304 : tensor<32x112896xf32>
    %v307 = stablehlo.minimum %v306, %v305 : tensor<32x112896xf32>
    %v308 = stablehlo.reshape %v307 : (tensor<32x112896xf32>) -> tensor<32x144x28x28xf32>
    %v309 = stablehlo.convolution(%v308, %Wp4)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x144x28x28xf32>, tensor<32x144x1x1xf32>) -> tensor<32x32x28x28xf32>
    %v310 = stablehlo.broadcast_in_dim %bp4, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v311 = stablehlo.add %v309, %v310 : tensor<32x32x28x28xf32>
    %v312 = stablehlo.reshape %v311 : (tensor<32x32x28x28xf32>) -> tensor<32x25088xf32>
    %v313 = stablehlo.reshape %v312 : (tensor<32x25088xf32>) -> tensor<32x32x28x28xf32>
    %v314 = stablehlo.constant dense<0.0> : tensor<f32>
    %v315 = stablehlo.constant dense<784.0> : tensor<32x32x28x28xf32>
    %v316 = stablehlo.constant dense<1.0e-5> : tensor<32x32x28x28xf32>
    %v317 = stablehlo.reduce(%v313 init: %v314) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x28x28xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v318 = stablehlo.broadcast_in_dim %v317, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x28x28xf32>
    %v319 = stablehlo.divide %v318, %v315 : tensor<32x32x28x28xf32>
    %v320 = stablehlo.subtract %v313, %v319 : tensor<32x32x28x28xf32>
    %v321 = stablehlo.multiply %v320, %v320 : tensor<32x32x28x28xf32>
    %v322 = stablehlo.reduce(%v321 init: %v314) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x28x28xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v323 = stablehlo.broadcast_in_dim %v322, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x28x28xf32>
    %v324 = stablehlo.divide %v323, %v315 : tensor<32x32x28x28xf32>
    %v325 = stablehlo.add %v324, %v316 : tensor<32x32x28x28xf32>
    %v326 = stablehlo.rsqrt %v325 : tensor<32x32x28x28xf32>
    %v327 = stablehlo.multiply %v320, %v326 : tensor<32x32x28x28xf32>
    %v328 = stablehlo.broadcast_in_dim %gp4, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v329 = stablehlo.broadcast_in_dim %btp4, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v330 = stablehlo.multiply %v327, %v328 : tensor<32x32x28x28xf32>
    %v331 = stablehlo.add %v330, %v329 : tensor<32x32x28x28xf32>
    %v332 = stablehlo.reshape %v331 : (tensor<32x32x28x28xf32>) -> tensor<32x25088xf32>
    %v333 = stablehlo.reshape %v332 : (tensor<32x25088xf32>) -> tensor<32x32x28x28xf32>
    %v334 = stablehlo.convolution(%v333, %We5)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x32x28x28xf32>, tensor<192x32x1x1xf32>) -> tensor<32x192x28x28xf32>
    %v335 = stablehlo.broadcast_in_dim %be5, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %v336 = stablehlo.add %v334, %v335 : tensor<32x192x28x28xf32>
    %v337 = stablehlo.reshape %v336 : (tensor<32x192x28x28xf32>) -> tensor<32x150528xf32>
    %v338 = stablehlo.reshape %v337 : (tensor<32x150528xf32>) -> tensor<32x192x28x28xf32>
    %v339 = stablehlo.constant dense<0.0> : tensor<f32>
    %v340 = stablehlo.constant dense<784.0> : tensor<32x192x28x28xf32>
    %v341 = stablehlo.constant dense<1.0e-5> : tensor<32x192x28x28xf32>
    %v342 = stablehlo.reduce(%v338 init: %v339) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x192x28x28xf32>, tensor<f32>) -> tensor<32x192xf32>
    %v343 = stablehlo.broadcast_in_dim %v342, dims = [0, 1] : (tensor<32x192xf32>) -> tensor<32x192x28x28xf32>
    %v344 = stablehlo.divide %v343, %v340 : tensor<32x192x28x28xf32>
    %v345 = stablehlo.subtract %v338, %v344 : tensor<32x192x28x28xf32>
    %v346 = stablehlo.multiply %v345, %v345 : tensor<32x192x28x28xf32>
    %v347 = stablehlo.reduce(%v346 init: %v339) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x192x28x28xf32>, tensor<f32>) -> tensor<32x192xf32>
    %v348 = stablehlo.broadcast_in_dim %v347, dims = [0, 1] : (tensor<32x192xf32>) -> tensor<32x192x28x28xf32>
    %v349 = stablehlo.divide %v348, %v340 : tensor<32x192x28x28xf32>
    %v350 = stablehlo.add %v349, %v341 : tensor<32x192x28x28xf32>
    %v351 = stablehlo.rsqrt %v350 : tensor<32x192x28x28xf32>
    %v352 = stablehlo.multiply %v345, %v351 : tensor<32x192x28x28xf32>
    %v353 = stablehlo.broadcast_in_dim %ge5, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %v354 = stablehlo.broadcast_in_dim %bte5, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %v355 = stablehlo.multiply %v352, %v353 : tensor<32x192x28x28xf32>
    %v356 = stablehlo.add %v355, %v354 : tensor<32x192x28x28xf32>
    %v357 = stablehlo.reshape %v356 : (tensor<32x192x28x28xf32>) -> tensor<32x150528xf32>
    %v358 = stablehlo.constant dense<0.0> : tensor<32x150528xf32>
    %v359 = stablehlo.constant dense<6.0> : tensor<32x150528xf32>
    %v360 = stablehlo.maximum %v357, %v358 : tensor<32x150528xf32>
    %v361 = stablehlo.minimum %v360, %v359 : tensor<32x150528xf32>
    %v362 = stablehlo.reshape %v361 : (tensor<32x150528xf32>) -> tensor<32x192x28x28xf32>
    %v363 = stablehlo.convolution(%v362, %Wd5)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 192 : i64} : (tensor<32x192x28x28xf32>, tensor<192x1x3x3xf32>) -> tensor<32x192x28x28xf32>
    %v364 = stablehlo.broadcast_in_dim %bd5, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %v365 = stablehlo.add %v363, %v364 : tensor<32x192x28x28xf32>
    %v366 = stablehlo.reshape %v365 : (tensor<32x192x28x28xf32>) -> tensor<32x150528xf32>
    %v367 = stablehlo.reshape %v366 : (tensor<32x150528xf32>) -> tensor<32x192x28x28xf32>
    %v368 = stablehlo.constant dense<0.0> : tensor<f32>
    %v369 = stablehlo.constant dense<784.0> : tensor<32x192x28x28xf32>
    %v370 = stablehlo.constant dense<1.0e-5> : tensor<32x192x28x28xf32>
    %v371 = stablehlo.reduce(%v367 init: %v368) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x192x28x28xf32>, tensor<f32>) -> tensor<32x192xf32>
    %v372 = stablehlo.broadcast_in_dim %v371, dims = [0, 1] : (tensor<32x192xf32>) -> tensor<32x192x28x28xf32>
    %v373 = stablehlo.divide %v372, %v369 : tensor<32x192x28x28xf32>
    %v374 = stablehlo.subtract %v367, %v373 : tensor<32x192x28x28xf32>
    %v375 = stablehlo.multiply %v374, %v374 : tensor<32x192x28x28xf32>
    %v376 = stablehlo.reduce(%v375 init: %v368) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x192x28x28xf32>, tensor<f32>) -> tensor<32x192xf32>
    %v377 = stablehlo.broadcast_in_dim %v376, dims = [0, 1] : (tensor<32x192xf32>) -> tensor<32x192x28x28xf32>
    %v378 = stablehlo.divide %v377, %v369 : tensor<32x192x28x28xf32>
    %v379 = stablehlo.add %v378, %v370 : tensor<32x192x28x28xf32>
    %v380 = stablehlo.rsqrt %v379 : tensor<32x192x28x28xf32>
    %v381 = stablehlo.multiply %v374, %v380 : tensor<32x192x28x28xf32>
    %v382 = stablehlo.broadcast_in_dim %gd5, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %v383 = stablehlo.broadcast_in_dim %btd5, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %v384 = stablehlo.multiply %v381, %v382 : tensor<32x192x28x28xf32>
    %v385 = stablehlo.add %v384, %v383 : tensor<32x192x28x28xf32>
    %v386 = stablehlo.reshape %v385 : (tensor<32x192x28x28xf32>) -> tensor<32x150528xf32>
    %v387 = stablehlo.constant dense<0.0> : tensor<32x150528xf32>
    %v388 = stablehlo.constant dense<6.0> : tensor<32x150528xf32>
    %v389 = stablehlo.maximum %v386, %v387 : tensor<32x150528xf32>
    %v390 = stablehlo.minimum %v389, %v388 : tensor<32x150528xf32>
    %v391 = stablehlo.reshape %v390 : (tensor<32x150528xf32>) -> tensor<32x192x28x28xf32>
    %v392 = stablehlo.convolution(%v391, %Wp5)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x192x28x28xf32>, tensor<32x192x1x1xf32>) -> tensor<32x32x28x28xf32>
    %v393 = stablehlo.broadcast_in_dim %bp5, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v394 = stablehlo.add %v392, %v393 : tensor<32x32x28x28xf32>
    %v395 = stablehlo.reshape %v394 : (tensor<32x32x28x28xf32>) -> tensor<32x25088xf32>
    %v396 = stablehlo.reshape %v395 : (tensor<32x25088xf32>) -> tensor<32x32x28x28xf32>
    %v397 = stablehlo.constant dense<0.0> : tensor<f32>
    %v398 = stablehlo.constant dense<784.0> : tensor<32x32x28x28xf32>
    %v399 = stablehlo.constant dense<1.0e-5> : tensor<32x32x28x28xf32>
    %v400 = stablehlo.reduce(%v396 init: %v397) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x28x28xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v401 = stablehlo.broadcast_in_dim %v400, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x28x28xf32>
    %v402 = stablehlo.divide %v401, %v398 : tensor<32x32x28x28xf32>
    %v403 = stablehlo.subtract %v396, %v402 : tensor<32x32x28x28xf32>
    %v404 = stablehlo.multiply %v403, %v403 : tensor<32x32x28x28xf32>
    %v405 = stablehlo.reduce(%v404 init: %v397) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x28x28xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v406 = stablehlo.broadcast_in_dim %v405, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x28x28xf32>
    %v407 = stablehlo.divide %v406, %v398 : tensor<32x32x28x28xf32>
    %v408 = stablehlo.add %v407, %v399 : tensor<32x32x28x28xf32>
    %v409 = stablehlo.rsqrt %v408 : tensor<32x32x28x28xf32>
    %v410 = stablehlo.multiply %v403, %v409 : tensor<32x32x28x28xf32>
    %v411 = stablehlo.broadcast_in_dim %gp5, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v412 = stablehlo.broadcast_in_dim %btp5, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v413 = stablehlo.multiply %v410, %v411 : tensor<32x32x28x28xf32>
    %v414 = stablehlo.add %v413, %v412 : tensor<32x32x28x28xf32>
    %v415 = stablehlo.reshape %v414 : (tensor<32x32x28x28xf32>) -> tensor<32x25088xf32>
    %v416 = stablehlo.add %v415, %v332 : tensor<32x25088xf32>
    %v417 = stablehlo.reshape %v416 : (tensor<32x25088xf32>) -> tensor<32x32x28x28xf32>
    %v418 = stablehlo.convolution(%v417, %We6)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x32x28x28xf32>, tensor<192x32x1x1xf32>) -> tensor<32x192x28x28xf32>
    %v419 = stablehlo.broadcast_in_dim %be6, dims = [1] : (tensor<192xf32>) -> tensor<32x192x28x28xf32>
    %v420 = stablehlo.add %v418, %v419 : tensor<32x192x28x28xf32>
    %v421 = stablehlo.reshape %v420 : (tensor<32x192x28x28xf32>) -> tensor<32x150528xf32>
    %v422 = stablehlo.reshape %v421 : (tensor<32x150528xf32>) -> tensor<32x192x28x28xf32>
    %v423 = stablehlo.constant dense<0.0> : tensor<f32>
    %v424 = stablehlo.constant dense<784.0> : tensor<32x192x28x28xf32>
    %v425 = stablehlo.constant dense<1.0e-5> : tensor<32x192x28x28xf32>
    %v426 = stablehlo.reduce(%v422 init: %v423) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x192x28x28xf32>, tensor<f32>) -> tensor<32x192xf32>
    %v427 = stablehlo.broadcast_in_dim %v426, dims = [0, 1] : (tensor<32x192xf32>) -> tensor<32x192x28x28xf32>
    %v428 = stablehlo.divide %v427, %v424 : tensor<32x192x28x28xf32>
    %v429 = stablehlo.subtract %v422, %v428 : tensor<32x192x28x28xf32>
