module @m {
  func.func @mobilenetv2_train_step(%x: tensor<32x150528xf32>, %Ws: tensor<16x3x3x3xf32>, %bs: tensor<16xf32>, %gs: tensor<16xf32>, %bts: tensor<16xf32>, %We1: tensor<64x16x1x1xf32>, %be1: tensor<64xf32>, %ge1: tensor<64xf32>, %bte1: tensor<64xf32>, %Wd1: tensor<64x1x3x3xf32>, %bd1: tensor<64xf32>, %gd1: tensor<64xf32>, %btd1: tensor<64xf32>, %Wp1: tensor<24x64x1x1xf32>, %bp1: tensor<24xf32>, %gp1: tensor<24xf32>, %btp1: tensor<24xf32>, %We2: tensor<96x24x1x1xf32>, %be2: tensor<96xf32>, %ge2: tensor<96xf32>, %bte2: tensor<96xf32>, %Wd2: tensor<96x1x3x3xf32>, %bd2: tensor<96xf32>, %gd2: tensor<96xf32>, %btd2: tensor<96xf32>, %Wp2: tensor<24x96x1x1xf32>, %bp2: tensor<24xf32>, %gp2: tensor<24xf32>, %btp2: tensor<24xf32>, %We3: tensor<96x24x1x1xf32>, %be3: tensor<96xf32>, %ge3: tensor<96xf32>, %bte3: tensor<96xf32>, %Wd3: tensor<96x1x3x3xf32>, %bd3: tensor<96xf32>, %gd3: tensor<96xf32>, %btd3: tensor<96xf32>, %Wp3: tensor<32x96x1x1xf32>, %bp3: tensor<32xf32>, %gp3: tensor<32xf32>, %btp3: tensor<32xf32>, %We4: tensor<128x32x1x1xf32>, %be4: tensor<128xf32>, %ge4: tensor<128xf32>, %bte4: tensor<128xf32>, %Wd4: tensor<128x1x3x3xf32>, %bd4: tensor<128xf32>, %gd4: tensor<128xf32>, %btd4: tensor<128xf32>, %Wp4: tensor<32x128x1x1xf32>, %bp4: tensor<32xf32>, %gp4: tensor<32xf32>, %btp4: tensor<32xf32>, %We5: tensor<128x32x1x1xf32>, %be5: tensor<128xf32>, %ge5: tensor<128xf32>, %bte5: tensor<128xf32>, %Wd5: tensor<128x1x3x3xf32>, %bd5: tensor<128xf32>, %gd5: tensor<128xf32>, %btd5: tensor<128xf32>, %Wp5: tensor<64x128x1x1xf32>, %bp5: tensor<64xf32>, %gp5: tensor<64xf32>, %btp5: tensor<64xf32>, %We6: tensor<256x64x1x1xf32>, %be6: tensor<256xf32>, %ge6: tensor<256xf32>, %bte6: tensor<256xf32>, %Wd6: tensor<256x1x3x3xf32>, %bd6: tensor<256xf32>, %gd6: tensor<256xf32>, %btd6: tensor<256xf32>, %Wp6: tensor<64x256x1x1xf32>, %bp6: tensor<64xf32>, %gp6: tensor<64xf32>, %btp6: tensor<64xf32>, %Wh: tensor<128x64x1x1xf32>, %bh: tensor<128xf32>, %gh: tensor<128xf32>, %bth: tensor<128xf32>, %Wfc: tensor<128x10xf32>, %bfc: tensor<10xf32>, %onehot: tensor<32x10xf32>) -> (tensor<16x3x3x3xf32>, tensor<16xf32>, tensor<16xf32>, tensor<16xf32>, tensor<64x16x1x1xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64x1x3x3xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<24x64x1x1xf32>, tensor<24xf32>, tensor<24xf32>, tensor<24xf32>, tensor<96x24x1x1xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96x1x3x3xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96xf32>, tensor<24x96x1x1xf32>, tensor<24xf32>, tensor<24xf32>, tensor<24xf32>, tensor<96x24x1x1xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96x1x3x3xf32>, tensor<96xf32>, tensor<96xf32>, tensor<96xf32>, tensor<32x96x1x1xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32xf32>, tensor<128x32x1x1xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128x1x3x3xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<32x128x1x1xf32>, tensor<32xf32>, tensor<32xf32>, tensor<32xf32>, tensor<128x32x1x1xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128x1x3x3xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<64x128x1x1xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<256x64x1x1xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256x1x3x3xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<64x256x1x1xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<128x64x1x1xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128x10xf32>, tensor<10xf32>) {
    // ── MobileNetV2 train step: every line is pretty(verified AST node) ──
    %v0 = stablehlo.reshape %x : (tensor<32x150528xf32>) -> tensor<32x3x224x224xf32>
    %v1 = stablehlo.convolution(%v0, %Ws)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x3x224x224xf32>, tensor<16x3x3x3xf32>) -> tensor<32x16x112x112xf32>
    %v2 = stablehlo.broadcast_in_dim %bs, dims = [1] : (tensor<16xf32>) -> tensor<32x16x112x112xf32>
    %v3 = stablehlo.add %v1, %v2 : tensor<32x16x112x112xf32>
    %v4 = stablehlo.reshape %v3 : (tensor<32x16x112x112xf32>) -> tensor<32x200704xf32>
    %v5 = stablehlo.reshape %v4 : (tensor<32x200704xf32>) -> tensor<32x16x112x112xf32>
    %v6 = stablehlo.constant dense<0.0> : tensor<f32>
    %v7 = stablehlo.constant dense<12544.0> : tensor<32x16x112x112xf32>
    %v8 = stablehlo.constant dense<1.0e-5> : tensor<32x16x112x112xf32>
    %v9 = stablehlo.reduce(%v5 init: %v6) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x16x112x112xf32>, tensor<f32>) -> tensor<32x16xf32>
    %v10 = stablehlo.broadcast_in_dim %v9, dims = [0, 1] : (tensor<32x16xf32>) -> tensor<32x16x112x112xf32>
    %v11 = stablehlo.divide %v10, %v7 : tensor<32x16x112x112xf32>
    %v12 = stablehlo.subtract %v5, %v11 : tensor<32x16x112x112xf32>
    %v13 = stablehlo.multiply %v12, %v12 : tensor<32x16x112x112xf32>
    %v14 = stablehlo.reduce(%v13 init: %v6) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x16x112x112xf32>, tensor<f32>) -> tensor<32x16xf32>
    %v15 = stablehlo.broadcast_in_dim %v14, dims = [0, 1] : (tensor<32x16xf32>) -> tensor<32x16x112x112xf32>
    %v16 = stablehlo.divide %v15, %v7 : tensor<32x16x112x112xf32>
    %v17 = stablehlo.add %v16, %v8 : tensor<32x16x112x112xf32>
    %v18 = stablehlo.rsqrt %v17 : tensor<32x16x112x112xf32>
    %v19 = stablehlo.multiply %v12, %v18 : tensor<32x16x112x112xf32>
    %v20 = stablehlo.broadcast_in_dim %gs, dims = [1] : (tensor<16xf32>) -> tensor<32x16x112x112xf32>
    %v21 = stablehlo.broadcast_in_dim %bts, dims = [1] : (tensor<16xf32>) -> tensor<32x16x112x112xf32>
    %v22 = stablehlo.multiply %v19, %v20 : tensor<32x16x112x112xf32>
    %v23 = stablehlo.add %v22, %v21 : tensor<32x16x112x112xf32>
    %v24 = stablehlo.reshape %v23 : (tensor<32x16x112x112xf32>) -> tensor<32x200704xf32>
    %v25 = stablehlo.constant dense<0.0> : tensor<32x200704xf32>
    %v26 = stablehlo.constant dense<6.0> : tensor<32x200704xf32>
    %v27 = stablehlo.maximum %v24, %v25 : tensor<32x200704xf32>
    %v28 = stablehlo.minimum %v27, %v26 : tensor<32x200704xf32>
    %v29 = stablehlo.reshape %v28 : (tensor<32x200704xf32>) -> tensor<32x16x112x112xf32>
    %v30 = stablehlo.convolution(%v29, %We1)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x16x112x112xf32>, tensor<64x16x1x1xf32>) -> tensor<32x64x112x112xf32>
    %v31 = stablehlo.broadcast_in_dim %be1, dims = [1] : (tensor<64xf32>) -> tensor<32x64x112x112xf32>
    %v32 = stablehlo.add %v30, %v31 : tensor<32x64x112x112xf32>
    %v33 = stablehlo.reshape %v32 : (tensor<32x64x112x112xf32>) -> tensor<32x802816xf32>
    %v34 = stablehlo.reshape %v33 : (tensor<32x802816xf32>) -> tensor<32x64x112x112xf32>
    %v35 = stablehlo.constant dense<0.0> : tensor<f32>
    %v36 = stablehlo.constant dense<12544.0> : tensor<32x64x112x112xf32>
    %v37 = stablehlo.constant dense<1.0e-5> : tensor<32x64x112x112xf32>
    %v38 = stablehlo.reduce(%v34 init: %v35) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x64x112x112xf32>, tensor<f32>) -> tensor<32x64xf32>
    %v39 = stablehlo.broadcast_in_dim %v38, dims = [0, 1] : (tensor<32x64xf32>) -> tensor<32x64x112x112xf32>
    %v40 = stablehlo.divide %v39, %v36 : tensor<32x64x112x112xf32>
    %v41 = stablehlo.subtract %v34, %v40 : tensor<32x64x112x112xf32>
    %v42 = stablehlo.multiply %v41, %v41 : tensor<32x64x112x112xf32>
    %v43 = stablehlo.reduce(%v42 init: %v35) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x64x112x112xf32>, tensor<f32>) -> tensor<32x64xf32>
    %v44 = stablehlo.broadcast_in_dim %v43, dims = [0, 1] : (tensor<32x64xf32>) -> tensor<32x64x112x112xf32>
    %v45 = stablehlo.divide %v44, %v36 : tensor<32x64x112x112xf32>
    %v46 = stablehlo.add %v45, %v37 : tensor<32x64x112x112xf32>
    %v47 = stablehlo.rsqrt %v46 : tensor<32x64x112x112xf32>
    %v48 = stablehlo.multiply %v41, %v47 : tensor<32x64x112x112xf32>
    %v49 = stablehlo.broadcast_in_dim %ge1, dims = [1] : (tensor<64xf32>) -> tensor<32x64x112x112xf32>
    %v50 = stablehlo.broadcast_in_dim %bte1, dims = [1] : (tensor<64xf32>) -> tensor<32x64x112x112xf32>
    %v51 = stablehlo.multiply %v48, %v49 : tensor<32x64x112x112xf32>
    %v52 = stablehlo.add %v51, %v50 : tensor<32x64x112x112xf32>
    %v53 = stablehlo.reshape %v52 : (tensor<32x64x112x112xf32>) -> tensor<32x802816xf32>
    %v54 = stablehlo.constant dense<0.0> : tensor<32x802816xf32>
    %v55 = stablehlo.constant dense<6.0> : tensor<32x802816xf32>
    %v56 = stablehlo.maximum %v53, %v54 : tensor<32x802816xf32>
    %v57 = stablehlo.minimum %v56, %v55 : tensor<32x802816xf32>
    %v58 = stablehlo.reshape %v57 : (tensor<32x802816xf32>) -> tensor<32x64x112x112xf32>
    %v59 = stablehlo.convolution(%v58, %Wd1)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 64 : i64} : (tensor<32x64x112x112xf32>, tensor<64x1x3x3xf32>) -> tensor<32x64x56x56xf32>
    %v60 = stablehlo.broadcast_in_dim %bd1, dims = [1] : (tensor<64xf32>) -> tensor<32x64x56x56xf32>
    %v61 = stablehlo.add %v59, %v60 : tensor<32x64x56x56xf32>
    %v62 = stablehlo.reshape %v61 : (tensor<32x64x56x56xf32>) -> tensor<32x200704xf32>
    %v63 = stablehlo.reshape %v62 : (tensor<32x200704xf32>) -> tensor<32x64x56x56xf32>
    %v64 = stablehlo.constant dense<0.0> : tensor<f32>
    %v65 = stablehlo.constant dense<3136.0> : tensor<32x64x56x56xf32>
    %v66 = stablehlo.constant dense<1.0e-5> : tensor<32x64x56x56xf32>
    %v67 = stablehlo.reduce(%v63 init: %v64) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x64x56x56xf32>, tensor<f32>) -> tensor<32x64xf32>
    %v68 = stablehlo.broadcast_in_dim %v67, dims = [0, 1] : (tensor<32x64xf32>) -> tensor<32x64x56x56xf32>
    %v69 = stablehlo.divide %v68, %v65 : tensor<32x64x56x56xf32>
    %v70 = stablehlo.subtract %v63, %v69 : tensor<32x64x56x56xf32>
    %v71 = stablehlo.multiply %v70, %v70 : tensor<32x64x56x56xf32>
    %v72 = stablehlo.reduce(%v71 init: %v64) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x64x56x56xf32>, tensor<f32>) -> tensor<32x64xf32>
    %v73 = stablehlo.broadcast_in_dim %v72, dims = [0, 1] : (tensor<32x64xf32>) -> tensor<32x64x56x56xf32>
    %v74 = stablehlo.divide %v73, %v65 : tensor<32x64x56x56xf32>
    %v75 = stablehlo.add %v74, %v66 : tensor<32x64x56x56xf32>
    %v76 = stablehlo.rsqrt %v75 : tensor<32x64x56x56xf32>
    %v77 = stablehlo.multiply %v70, %v76 : tensor<32x64x56x56xf32>
    %v78 = stablehlo.broadcast_in_dim %gd1, dims = [1] : (tensor<64xf32>) -> tensor<32x64x56x56xf32>
    %v79 = stablehlo.broadcast_in_dim %btd1, dims = [1] : (tensor<64xf32>) -> tensor<32x64x56x56xf32>
    %v80 = stablehlo.multiply %v77, %v78 : tensor<32x64x56x56xf32>
    %v81 = stablehlo.add %v80, %v79 : tensor<32x64x56x56xf32>
    %v82 = stablehlo.reshape %v81 : (tensor<32x64x56x56xf32>) -> tensor<32x200704xf32>
    %v83 = stablehlo.constant dense<0.0> : tensor<32x200704xf32>
    %v84 = stablehlo.constant dense<6.0> : tensor<32x200704xf32>
    %v85 = stablehlo.maximum %v82, %v83 : tensor<32x200704xf32>
    %v86 = stablehlo.minimum %v85, %v84 : tensor<32x200704xf32>
    %v87 = stablehlo.reshape %v86 : (tensor<32x200704xf32>) -> tensor<32x64x56x56xf32>
    %v88 = stablehlo.convolution(%v87, %Wp1)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x64x56x56xf32>, tensor<24x64x1x1xf32>) -> tensor<32x24x56x56xf32>
    %v89 = stablehlo.broadcast_in_dim %bp1, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v90 = stablehlo.add %v88, %v89 : tensor<32x24x56x56xf32>
    %v91 = stablehlo.reshape %v90 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v92 = stablehlo.reshape %v91 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v93 = stablehlo.constant dense<0.0> : tensor<f32>
    %v94 = stablehlo.constant dense<3136.0> : tensor<32x24x56x56xf32>
    %v95 = stablehlo.constant dense<1.0e-5> : tensor<32x24x56x56xf32>
    %v96 = stablehlo.reduce(%v92 init: %v93) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<32x24xf32>
    %v97 = stablehlo.broadcast_in_dim %v96, dims = [0, 1] : (tensor<32x24xf32>) -> tensor<32x24x56x56xf32>
    %v98 = stablehlo.divide %v97, %v94 : tensor<32x24x56x56xf32>
    %v99 = stablehlo.subtract %v92, %v98 : tensor<32x24x56x56xf32>
    %v100 = stablehlo.multiply %v99, %v99 : tensor<32x24x56x56xf32>
    %v101 = stablehlo.reduce(%v100 init: %v93) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<32x24xf32>
    %v102 = stablehlo.broadcast_in_dim %v101, dims = [0, 1] : (tensor<32x24xf32>) -> tensor<32x24x56x56xf32>
    %v103 = stablehlo.divide %v102, %v94 : tensor<32x24x56x56xf32>
    %v104 = stablehlo.add %v103, %v95 : tensor<32x24x56x56xf32>
    %v105 = stablehlo.rsqrt %v104 : tensor<32x24x56x56xf32>
    %v106 = stablehlo.multiply %v99, %v105 : tensor<32x24x56x56xf32>
    %v107 = stablehlo.broadcast_in_dim %gp1, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v108 = stablehlo.broadcast_in_dim %btp1, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v109 = stablehlo.multiply %v106, %v107 : tensor<32x24x56x56xf32>
    %v110 = stablehlo.add %v109, %v108 : tensor<32x24x56x56xf32>
    %v111 = stablehlo.reshape %v110 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v112 = stablehlo.reshape %v111 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v113 = stablehlo.convolution(%v112, %We2)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x24x56x56xf32>, tensor<96x24x1x1xf32>) -> tensor<32x96x56x56xf32>
    %v114 = stablehlo.broadcast_in_dim %be2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v115 = stablehlo.add %v113, %v114 : tensor<32x96x56x56xf32>
    %v116 = stablehlo.reshape %v115 : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %v117 = stablehlo.reshape %v116 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v118 = stablehlo.constant dense<0.0> : tensor<f32>
    %v119 = stablehlo.constant dense<3136.0> : tensor<32x96x56x56xf32>
    %v120 = stablehlo.constant dense<1.0e-5> : tensor<32x96x56x56xf32>
    %v121 = stablehlo.reduce(%v117 init: %v118) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v122 = stablehlo.broadcast_in_dim %v121, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x56x56xf32>
    %v123 = stablehlo.divide %v122, %v119 : tensor<32x96x56x56xf32>
    %v124 = stablehlo.subtract %v117, %v123 : tensor<32x96x56x56xf32>
    %v125 = stablehlo.multiply %v124, %v124 : tensor<32x96x56x56xf32>
    %v126 = stablehlo.reduce(%v125 init: %v118) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v127 = stablehlo.broadcast_in_dim %v126, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x56x56xf32>
    %v128 = stablehlo.divide %v127, %v119 : tensor<32x96x56x56xf32>
    %v129 = stablehlo.add %v128, %v120 : tensor<32x96x56x56xf32>
    %v130 = stablehlo.rsqrt %v129 : tensor<32x96x56x56xf32>
    %v131 = stablehlo.multiply %v124, %v130 : tensor<32x96x56x56xf32>
    %v132 = stablehlo.broadcast_in_dim %ge2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v133 = stablehlo.broadcast_in_dim %bte2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v134 = stablehlo.multiply %v131, %v132 : tensor<32x96x56x56xf32>
    %v135 = stablehlo.add %v134, %v133 : tensor<32x96x56x56xf32>
    %v136 = stablehlo.reshape %v135 : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %v137 = stablehlo.constant dense<0.0> : tensor<32x301056xf32>
    %v138 = stablehlo.constant dense<6.0> : tensor<32x301056xf32>
    %v139 = stablehlo.maximum %v136, %v137 : tensor<32x301056xf32>
    %v140 = stablehlo.minimum %v139, %v138 : tensor<32x301056xf32>
    %v141 = stablehlo.reshape %v140 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v142 = stablehlo.convolution(%v141, %Wd2)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 96 : i64} : (tensor<32x96x56x56xf32>, tensor<96x1x3x3xf32>) -> tensor<32x96x56x56xf32>
    %v143 = stablehlo.broadcast_in_dim %bd2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v144 = stablehlo.add %v142, %v143 : tensor<32x96x56x56xf32>
    %v145 = stablehlo.reshape %v144 : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %v146 = stablehlo.reshape %v145 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v147 = stablehlo.constant dense<0.0> : tensor<f32>
    %v148 = stablehlo.constant dense<3136.0> : tensor<32x96x56x56xf32>
    %v149 = stablehlo.constant dense<1.0e-5> : tensor<32x96x56x56xf32>
    %v150 = stablehlo.reduce(%v146 init: %v147) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v151 = stablehlo.broadcast_in_dim %v150, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x56x56xf32>
    %v152 = stablehlo.divide %v151, %v148 : tensor<32x96x56x56xf32>
    %v153 = stablehlo.subtract %v146, %v152 : tensor<32x96x56x56xf32>
    %v154 = stablehlo.multiply %v153, %v153 : tensor<32x96x56x56xf32>
    %v155 = stablehlo.reduce(%v154 init: %v147) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v156 = stablehlo.broadcast_in_dim %v155, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x56x56xf32>
    %v157 = stablehlo.divide %v156, %v148 : tensor<32x96x56x56xf32>
    %v158 = stablehlo.add %v157, %v149 : tensor<32x96x56x56xf32>
    %v159 = stablehlo.rsqrt %v158 : tensor<32x96x56x56xf32>
    %v160 = stablehlo.multiply %v153, %v159 : tensor<32x96x56x56xf32>
    %v161 = stablehlo.broadcast_in_dim %gd2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v162 = stablehlo.broadcast_in_dim %btd2, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v163 = stablehlo.multiply %v160, %v161 : tensor<32x96x56x56xf32>
    %v164 = stablehlo.add %v163, %v162 : tensor<32x96x56x56xf32>
    %v165 = stablehlo.reshape %v164 : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %v166 = stablehlo.constant dense<0.0> : tensor<32x301056xf32>
    %v167 = stablehlo.constant dense<6.0> : tensor<32x301056xf32>
    %v168 = stablehlo.maximum %v165, %v166 : tensor<32x301056xf32>
    %v169 = stablehlo.minimum %v168, %v167 : tensor<32x301056xf32>
    %v170 = stablehlo.reshape %v169 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v171 = stablehlo.convolution(%v170, %Wp2)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x96x56x56xf32>, tensor<24x96x1x1xf32>) -> tensor<32x24x56x56xf32>
    %v172 = stablehlo.broadcast_in_dim %bp2, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v173 = stablehlo.add %v171, %v172 : tensor<32x24x56x56xf32>
    %v174 = stablehlo.reshape %v173 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v175 = stablehlo.reshape %v174 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v176 = stablehlo.constant dense<0.0> : tensor<f32>
    %v177 = stablehlo.constant dense<3136.0> : tensor<32x24x56x56xf32>
    %v178 = stablehlo.constant dense<1.0e-5> : tensor<32x24x56x56xf32>
    %v179 = stablehlo.reduce(%v175 init: %v176) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<32x24xf32>
    %v180 = stablehlo.broadcast_in_dim %v179, dims = [0, 1] : (tensor<32x24xf32>) -> tensor<32x24x56x56xf32>
    %v181 = stablehlo.divide %v180, %v177 : tensor<32x24x56x56xf32>
    %v182 = stablehlo.subtract %v175, %v181 : tensor<32x24x56x56xf32>
    %v183 = stablehlo.multiply %v182, %v182 : tensor<32x24x56x56xf32>
    %v184 = stablehlo.reduce(%v183 init: %v176) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x24x56x56xf32>, tensor<f32>) -> tensor<32x24xf32>
    %v185 = stablehlo.broadcast_in_dim %v184, dims = [0, 1] : (tensor<32x24xf32>) -> tensor<32x24x56x56xf32>
    %v186 = stablehlo.divide %v185, %v177 : tensor<32x24x56x56xf32>
    %v187 = stablehlo.add %v186, %v178 : tensor<32x24x56x56xf32>
    %v188 = stablehlo.rsqrt %v187 : tensor<32x24x56x56xf32>
    %v189 = stablehlo.multiply %v182, %v188 : tensor<32x24x56x56xf32>
    %v190 = stablehlo.broadcast_in_dim %gp2, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v191 = stablehlo.broadcast_in_dim %btp2, dims = [1] : (tensor<24xf32>) -> tensor<32x24x56x56xf32>
    %v192 = stablehlo.multiply %v189, %v190 : tensor<32x24x56x56xf32>
    %v193 = stablehlo.add %v192, %v191 : tensor<32x24x56x56xf32>
    %v194 = stablehlo.reshape %v193 : (tensor<32x24x56x56xf32>) -> tensor<32x75264xf32>
    %v195 = stablehlo.add %v194, %v111 : tensor<32x75264xf32>
    %v196 = stablehlo.reshape %v195 : (tensor<32x75264xf32>) -> tensor<32x24x56x56xf32>
    %v197 = stablehlo.convolution(%v196, %We3)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x24x56x56xf32>, tensor<96x24x1x1xf32>) -> tensor<32x96x56x56xf32>
    %v198 = stablehlo.broadcast_in_dim %be3, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v199 = stablehlo.add %v197, %v198 : tensor<32x96x56x56xf32>
    %v200 = stablehlo.reshape %v199 : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %v201 = stablehlo.reshape %v200 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v202 = stablehlo.constant dense<0.0> : tensor<f32>
    %v203 = stablehlo.constant dense<3136.0> : tensor<32x96x56x56xf32>
    %v204 = stablehlo.constant dense<1.0e-5> : tensor<32x96x56x56xf32>
    %v205 = stablehlo.reduce(%v201 init: %v202) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v206 = stablehlo.broadcast_in_dim %v205, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x56x56xf32>
    %v207 = stablehlo.divide %v206, %v203 : tensor<32x96x56x56xf32>
    %v208 = stablehlo.subtract %v201, %v207 : tensor<32x96x56x56xf32>
    %v209 = stablehlo.multiply %v208, %v208 : tensor<32x96x56x56xf32>
    %v210 = stablehlo.reduce(%v209 init: %v202) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x56x56xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v211 = stablehlo.broadcast_in_dim %v210, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x56x56xf32>
    %v212 = stablehlo.divide %v211, %v203 : tensor<32x96x56x56xf32>
    %v213 = stablehlo.add %v212, %v204 : tensor<32x96x56x56xf32>
    %v214 = stablehlo.rsqrt %v213 : tensor<32x96x56x56xf32>
    %v215 = stablehlo.multiply %v208, %v214 : tensor<32x96x56x56xf32>
    %v216 = stablehlo.broadcast_in_dim %ge3, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v217 = stablehlo.broadcast_in_dim %bte3, dims = [1] : (tensor<96xf32>) -> tensor<32x96x56x56xf32>
    %v218 = stablehlo.multiply %v215, %v216 : tensor<32x96x56x56xf32>
    %v219 = stablehlo.add %v218, %v217 : tensor<32x96x56x56xf32>
    %v220 = stablehlo.reshape %v219 : (tensor<32x96x56x56xf32>) -> tensor<32x301056xf32>
    %v221 = stablehlo.constant dense<0.0> : tensor<32x301056xf32>
    %v222 = stablehlo.constant dense<6.0> : tensor<32x301056xf32>
    %v223 = stablehlo.maximum %v220, %v221 : tensor<32x301056xf32>
    %v224 = stablehlo.minimum %v223, %v222 : tensor<32x301056xf32>
    %v225 = stablehlo.reshape %v224 : (tensor<32x301056xf32>) -> tensor<32x96x56x56xf32>
    %v226 = stablehlo.convolution(%v225, %Wd3)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 96 : i64} : (tensor<32x96x56x56xf32>, tensor<96x1x3x3xf32>) -> tensor<32x96x28x28xf32>
    %v227 = stablehlo.broadcast_in_dim %bd3, dims = [1] : (tensor<96xf32>) -> tensor<32x96x28x28xf32>
    %v228 = stablehlo.add %v226, %v227 : tensor<32x96x28x28xf32>
    %v229 = stablehlo.reshape %v228 : (tensor<32x96x28x28xf32>) -> tensor<32x75264xf32>
    %v230 = stablehlo.reshape %v229 : (tensor<32x75264xf32>) -> tensor<32x96x28x28xf32>
    %v231 = stablehlo.constant dense<0.0> : tensor<f32>
    %v232 = stablehlo.constant dense<784.0> : tensor<32x96x28x28xf32>
    %v233 = stablehlo.constant dense<1.0e-5> : tensor<32x96x28x28xf32>
    %v234 = stablehlo.reduce(%v230 init: %v231) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x28x28xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v235 = stablehlo.broadcast_in_dim %v234, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x28x28xf32>
    %v236 = stablehlo.divide %v235, %v232 : tensor<32x96x28x28xf32>
    %v237 = stablehlo.subtract %v230, %v236 : tensor<32x96x28x28xf32>
    %v238 = stablehlo.multiply %v237, %v237 : tensor<32x96x28x28xf32>
    %v239 = stablehlo.reduce(%v238 init: %v231) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x96x28x28xf32>, tensor<f32>) -> tensor<32x96xf32>
    %v240 = stablehlo.broadcast_in_dim %v239, dims = [0, 1] : (tensor<32x96xf32>) -> tensor<32x96x28x28xf32>
    %v241 = stablehlo.divide %v240, %v232 : tensor<32x96x28x28xf32>
    %v242 = stablehlo.add %v241, %v233 : tensor<32x96x28x28xf32>
    %v243 = stablehlo.rsqrt %v242 : tensor<32x96x28x28xf32>
    %v244 = stablehlo.multiply %v237, %v243 : tensor<32x96x28x28xf32>
    %v245 = stablehlo.broadcast_in_dim %gd3, dims = [1] : (tensor<96xf32>) -> tensor<32x96x28x28xf32>
    %v246 = stablehlo.broadcast_in_dim %btd3, dims = [1] : (tensor<96xf32>) -> tensor<32x96x28x28xf32>
    %v247 = stablehlo.multiply %v244, %v245 : tensor<32x96x28x28xf32>
    %v248 = stablehlo.add %v247, %v246 : tensor<32x96x28x28xf32>
    %v249 = stablehlo.reshape %v248 : (tensor<32x96x28x28xf32>) -> tensor<32x75264xf32>
    %v250 = stablehlo.constant dense<0.0> : tensor<32x75264xf32>
    %v251 = stablehlo.constant dense<6.0> : tensor<32x75264xf32>
    %v252 = stablehlo.maximum %v249, %v250 : tensor<32x75264xf32>
    %v253 = stablehlo.minimum %v252, %v251 : tensor<32x75264xf32>
    %v254 = stablehlo.reshape %v253 : (tensor<32x75264xf32>) -> tensor<32x96x28x28xf32>
    %v255 = stablehlo.convolution(%v254, %Wp3)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x96x28x28xf32>, tensor<32x96x1x1xf32>) -> tensor<32x32x28x28xf32>
    %v256 = stablehlo.broadcast_in_dim %bp3, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v257 = stablehlo.add %v255, %v256 : tensor<32x32x28x28xf32>
    %v258 = stablehlo.reshape %v257 : (tensor<32x32x28x28xf32>) -> tensor<32x25088xf32>
    %v259 = stablehlo.reshape %v258 : (tensor<32x25088xf32>) -> tensor<32x32x28x28xf32>
    %v260 = stablehlo.constant dense<0.0> : tensor<f32>
    %v261 = stablehlo.constant dense<784.0> : tensor<32x32x28x28xf32>
    %v262 = stablehlo.constant dense<1.0e-5> : tensor<32x32x28x28xf32>
    %v263 = stablehlo.reduce(%v259 init: %v260) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x28x28xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v264 = stablehlo.broadcast_in_dim %v263, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x28x28xf32>
    %v265 = stablehlo.divide %v264, %v261 : tensor<32x32x28x28xf32>
    %v266 = stablehlo.subtract %v259, %v265 : tensor<32x32x28x28xf32>
    %v267 = stablehlo.multiply %v266, %v266 : tensor<32x32x28x28xf32>
    %v268 = stablehlo.reduce(%v267 init: %v260) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x28x28xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v269 = stablehlo.broadcast_in_dim %v268, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x28x28xf32>
    %v270 = stablehlo.divide %v269, %v261 : tensor<32x32x28x28xf32>
    %v271 = stablehlo.add %v270, %v262 : tensor<32x32x28x28xf32>
    %v272 = stablehlo.rsqrt %v271 : tensor<32x32x28x28xf32>
    %v273 = stablehlo.multiply %v266, %v272 : tensor<32x32x28x28xf32>
    %v274 = stablehlo.broadcast_in_dim %gp3, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v275 = stablehlo.broadcast_in_dim %btp3, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v276 = stablehlo.multiply %v273, %v274 : tensor<32x32x28x28xf32>
    %v277 = stablehlo.add %v276, %v275 : tensor<32x32x28x28xf32>
    %v278 = stablehlo.reshape %v277 : (tensor<32x32x28x28xf32>) -> tensor<32x25088xf32>
    %v279 = stablehlo.reshape %v278 : (tensor<32x25088xf32>) -> tensor<32x32x28x28xf32>
    %v280 = stablehlo.convolution(%v279, %We4)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x32x28x28xf32>, tensor<128x32x1x1xf32>) -> tensor<32x128x28x28xf32>
    %v281 = stablehlo.broadcast_in_dim %be4, dims = [1] : (tensor<128xf32>) -> tensor<32x128x28x28xf32>
    %v282 = stablehlo.add %v280, %v281 : tensor<32x128x28x28xf32>
    %v283 = stablehlo.reshape %v282 : (tensor<32x128x28x28xf32>) -> tensor<32x100352xf32>
    %v284 = stablehlo.reshape %v283 : (tensor<32x100352xf32>) -> tensor<32x128x28x28xf32>
    %v285 = stablehlo.constant dense<0.0> : tensor<f32>
    %v286 = stablehlo.constant dense<784.0> : tensor<32x128x28x28xf32>
    %v287 = stablehlo.constant dense<1.0e-5> : tensor<32x128x28x28xf32>
    %v288 = stablehlo.reduce(%v284 init: %v285) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x128x28x28xf32>, tensor<f32>) -> tensor<32x128xf32>
    %v289 = stablehlo.broadcast_in_dim %v288, dims = [0, 1] : (tensor<32x128xf32>) -> tensor<32x128x28x28xf32>
    %v290 = stablehlo.divide %v289, %v286 : tensor<32x128x28x28xf32>
    %v291 = stablehlo.subtract %v284, %v290 : tensor<32x128x28x28xf32>
    %v292 = stablehlo.multiply %v291, %v291 : tensor<32x128x28x28xf32>
    %v293 = stablehlo.reduce(%v292 init: %v285) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x128x28x28xf32>, tensor<f32>) -> tensor<32x128xf32>
    %v294 = stablehlo.broadcast_in_dim %v293, dims = [0, 1] : (tensor<32x128xf32>) -> tensor<32x128x28x28xf32>
    %v295 = stablehlo.divide %v294, %v286 : tensor<32x128x28x28xf32>
    %v296 = stablehlo.add %v295, %v287 : tensor<32x128x28x28xf32>
    %v297 = stablehlo.rsqrt %v296 : tensor<32x128x28x28xf32>
    %v298 = stablehlo.multiply %v291, %v297 : tensor<32x128x28x28xf32>
    %v299 = stablehlo.broadcast_in_dim %ge4, dims = [1] : (tensor<128xf32>) -> tensor<32x128x28x28xf32>
    %v300 = stablehlo.broadcast_in_dim %bte4, dims = [1] : (tensor<128xf32>) -> tensor<32x128x28x28xf32>
    %v301 = stablehlo.multiply %v298, %v299 : tensor<32x128x28x28xf32>
    %v302 = stablehlo.add %v301, %v300 : tensor<32x128x28x28xf32>
    %v303 = stablehlo.reshape %v302 : (tensor<32x128x28x28xf32>) -> tensor<32x100352xf32>
    %v304 = stablehlo.constant dense<0.0> : tensor<32x100352xf32>
    %v305 = stablehlo.constant dense<6.0> : tensor<32x100352xf32>
    %v306 = stablehlo.maximum %v303, %v304 : tensor<32x100352xf32>
    %v307 = stablehlo.minimum %v306, %v305 : tensor<32x100352xf32>
    %v308 = stablehlo.reshape %v307 : (tensor<32x100352xf32>) -> tensor<32x128x28x28xf32>
    %v309 = stablehlo.convolution(%v308, %Wd4)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 128 : i64} : (tensor<32x128x28x28xf32>, tensor<128x1x3x3xf32>) -> tensor<32x128x28x28xf32>
    %v310 = stablehlo.broadcast_in_dim %bd4, dims = [1] : (tensor<128xf32>) -> tensor<32x128x28x28xf32>
    %v311 = stablehlo.add %v309, %v310 : tensor<32x128x28x28xf32>
    %v312 = stablehlo.reshape %v311 : (tensor<32x128x28x28xf32>) -> tensor<32x100352xf32>
    %v313 = stablehlo.reshape %v312 : (tensor<32x100352xf32>) -> tensor<32x128x28x28xf32>
    %v314 = stablehlo.constant dense<0.0> : tensor<f32>
    %v315 = stablehlo.constant dense<784.0> : tensor<32x128x28x28xf32>
    %v316 = stablehlo.constant dense<1.0e-5> : tensor<32x128x28x28xf32>
    %v317 = stablehlo.reduce(%v313 init: %v314) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x128x28x28xf32>, tensor<f32>) -> tensor<32x128xf32>
    %v318 = stablehlo.broadcast_in_dim %v317, dims = [0, 1] : (tensor<32x128xf32>) -> tensor<32x128x28x28xf32>
    %v319 = stablehlo.divide %v318, %v315 : tensor<32x128x28x28xf32>
    %v320 = stablehlo.subtract %v313, %v319 : tensor<32x128x28x28xf32>
    %v321 = stablehlo.multiply %v320, %v320 : tensor<32x128x28x28xf32>
    %v322 = stablehlo.reduce(%v321 init: %v314) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x128x28x28xf32>, tensor<f32>) -> tensor<32x128xf32>
    %v323 = stablehlo.broadcast_in_dim %v322, dims = [0, 1] : (tensor<32x128xf32>) -> tensor<32x128x28x28xf32>
    %v324 = stablehlo.divide %v323, %v315 : tensor<32x128x28x28xf32>
    %v325 = stablehlo.add %v324, %v316 : tensor<32x128x28x28xf32>
    %v326 = stablehlo.rsqrt %v325 : tensor<32x128x28x28xf32>
    %v327 = stablehlo.multiply %v320, %v326 : tensor<32x128x28x28xf32>
    %v328 = stablehlo.broadcast_in_dim %gd4, dims = [1] : (tensor<128xf32>) -> tensor<32x128x28x28xf32>
    %v329 = stablehlo.broadcast_in_dim %btd4, dims = [1] : (tensor<128xf32>) -> tensor<32x128x28x28xf32>
    %v330 = stablehlo.multiply %v327, %v328 : tensor<32x128x28x28xf32>
    %v331 = stablehlo.add %v330, %v329 : tensor<32x128x28x28xf32>
    %v332 = stablehlo.reshape %v331 : (tensor<32x128x28x28xf32>) -> tensor<32x100352xf32>
    %v333 = stablehlo.constant dense<0.0> : tensor<32x100352xf32>
    %v334 = stablehlo.constant dense<6.0> : tensor<32x100352xf32>
    %v335 = stablehlo.maximum %v332, %v333 : tensor<32x100352xf32>
    %v336 = stablehlo.minimum %v335, %v334 : tensor<32x100352xf32>
    %v337 = stablehlo.reshape %v336 : (tensor<32x100352xf32>) -> tensor<32x128x28x28xf32>
    %v338 = stablehlo.convolution(%v337, %Wp4)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x128x28x28xf32>, tensor<32x128x1x1xf32>) -> tensor<32x32x28x28xf32>
    %v339 = stablehlo.broadcast_in_dim %bp4, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v340 = stablehlo.add %v338, %v339 : tensor<32x32x28x28xf32>
    %v341 = stablehlo.reshape %v340 : (tensor<32x32x28x28xf32>) -> tensor<32x25088xf32>
    %v342 = stablehlo.reshape %v341 : (tensor<32x25088xf32>) -> tensor<32x32x28x28xf32>
    %v343 = stablehlo.constant dense<0.0> : tensor<f32>
    %v344 = stablehlo.constant dense<784.0> : tensor<32x32x28x28xf32>
    %v345 = stablehlo.constant dense<1.0e-5> : tensor<32x32x28x28xf32>
    %v346 = stablehlo.reduce(%v342 init: %v343) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x28x28xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v347 = stablehlo.broadcast_in_dim %v346, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x28x28xf32>
    %v348 = stablehlo.divide %v347, %v344 : tensor<32x32x28x28xf32>
    %v349 = stablehlo.subtract %v342, %v348 : tensor<32x32x28x28xf32>
    %v350 = stablehlo.multiply %v349, %v349 : tensor<32x32x28x28xf32>
    %v351 = stablehlo.reduce(%v350 init: %v343) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x32x28x28xf32>, tensor<f32>) -> tensor<32x32xf32>
    %v352 = stablehlo.broadcast_in_dim %v351, dims = [0, 1] : (tensor<32x32xf32>) -> tensor<32x32x28x28xf32>
    %v353 = stablehlo.divide %v352, %v344 : tensor<32x32x28x28xf32>
    %v354 = stablehlo.add %v353, %v345 : tensor<32x32x28x28xf32>
    %v355 = stablehlo.rsqrt %v354 : tensor<32x32x28x28xf32>
    %v356 = stablehlo.multiply %v349, %v355 : tensor<32x32x28x28xf32>
    %v357 = stablehlo.broadcast_in_dim %gp4, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v358 = stablehlo.broadcast_in_dim %btp4, dims = [1] : (tensor<32xf32>) -> tensor<32x32x28x28xf32>
    %v359 = stablehlo.multiply %v356, %v357 : tensor<32x32x28x28xf32>
    %v360 = stablehlo.add %v359, %v358 : tensor<32x32x28x28xf32>
    %v361 = stablehlo.reshape %v360 : (tensor<32x32x28x28xf32>) -> tensor<32x25088xf32>
    %v362 = stablehlo.add %v361, %v278 : tensor<32x25088xf32>
    %v363 = stablehlo.reshape %v362 : (tensor<32x25088xf32>) -> tensor<32x32x28x28xf32>
    %v364 = stablehlo.convolution(%v363, %We5)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x32x28x28xf32>, tensor<128x32x1x1xf32>) -> tensor<32x128x28x28xf32>
    %v365 = stablehlo.broadcast_in_dim %be5, dims = [1] : (tensor<128xf32>) -> tensor<32x128x28x28xf32>
    %v366 = stablehlo.add %v364, %v365 : tensor<32x128x28x28xf32>
    %v367 = stablehlo.reshape %v366 : (tensor<32x128x28x28xf32>) -> tensor<32x100352xf32>
    %v368 = stablehlo.reshape %v367 : (tensor<32x100352xf32>) -> tensor<32x128x28x28xf32>
    %v369 = stablehlo.constant dense<0.0> : tensor<f32>
    %v370 = stablehlo.constant dense<784.0> : tensor<32x128x28x28xf32>
    %v371 = stablehlo.constant dense<1.0e-5> : tensor<32x128x28x28xf32>
    %v372 = stablehlo.reduce(%v368 init: %v369) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x128x28x28xf32>, tensor<f32>) -> tensor<32x128xf32>
    %v373 = stablehlo.broadcast_in_dim %v372, dims = [0, 1] : (tensor<32x128xf32>) -> tensor<32x128x28x28xf32>
    %v374 = stablehlo.divide %v373, %v370 : tensor<32x128x28x28xf32>
    %v375 = stablehlo.subtract %v368, %v374 : tensor<32x128x28x28xf32>
    %v376 = stablehlo.multiply %v375, %v375 : tensor<32x128x28x28xf32>
    %v377 = stablehlo.reduce(%v376 init: %v369) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x128x28x28xf32>, tensor<f32>) -> tensor<32x128xf32>
    %v378 = stablehlo.broadcast_in_dim %v377, dims = [0, 1] : (tensor<32x128xf32>) -> tensor<32x128x28x28xf32>
    %v379 = stablehlo.divide %v378, %v370 : tensor<32x128x28x28xf32>
    %v380 = stablehlo.add %v379, %v371 : tensor<32x128x28x28xf32>
    %v381 = stablehlo.rsqrt %v380 : tensor<32x128x28x28xf32>
    %v382 = stablehlo.multiply %v375, %v381 : tensor<32x128x28x28xf32>
    %v383 = stablehlo.broadcast_in_dim %ge5, dims = [1] : (tensor<128xf32>) -> tensor<32x128x28x28xf32>
    %v384 = stablehlo.broadcast_in_dim %bte5, dims = [1] : (tensor<128xf32>) -> tensor<32x128x28x28xf32>
    %v385 = stablehlo.multiply %v382, %v383 : tensor<32x128x28x28xf32>
    %v386 = stablehlo.add %v385, %v384 : tensor<32x128x28x28xf32>
    %v387 = stablehlo.reshape %v386 : (tensor<32x128x28x28xf32>) -> tensor<32x100352xf32>
    %v388 = stablehlo.constant dense<0.0> : tensor<32x100352xf32>
    %v389 = stablehlo.constant dense<6.0> : tensor<32x100352xf32>
    %v390 = stablehlo.maximum %v387, %v388 : tensor<32x100352xf32>
    %v391 = stablehlo.minimum %v390, %v389 : tensor<32x100352xf32>
    %v392 = stablehlo.reshape %v391 : (tensor<32x100352xf32>) -> tensor<32x128x28x28xf32>
    %v393 = stablehlo.convolution(%v392, %Wd5)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 128 : i64} : (tensor<32x128x28x28xf32>, tensor<128x1x3x3xf32>) -> tensor<32x128x14x14xf32>
    %v394 = stablehlo.broadcast_in_dim %bd5, dims = [1] : (tensor<128xf32>) -> tensor<32x128x14x14xf32>
    %v395 = stablehlo.add %v393, %v394 : tensor<32x128x14x14xf32>
    %v396 = stablehlo.reshape %v395 : (tensor<32x128x14x14xf32>) -> tensor<32x25088xf32>
    %v397 = stablehlo.reshape %v396 : (tensor<32x25088xf32>) -> tensor<32x128x14x14xf32>
    %v398 = stablehlo.constant dense<0.0> : tensor<f32>
    %v399 = stablehlo.constant dense<196.0> : tensor<32x128x14x14xf32>
    %v400 = stablehlo.constant dense<1.0e-5> : tensor<32x128x14x14xf32>
    %v401 = stablehlo.reduce(%v397 init: %v398) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x128x14x14xf32>, tensor<f32>) -> tensor<32x128xf32>
    %v402 = stablehlo.broadcast_in_dim %v401, dims = [0, 1] : (tensor<32x128xf32>) -> tensor<32x128x14x14xf32>
    %v403 = stablehlo.divide %v402, %v399 : tensor<32x128x14x14xf32>
    %v404 = stablehlo.subtract %v397, %v403 : tensor<32x128x14x14xf32>
    %v405 = stablehlo.multiply %v404, %v404 : tensor<32x128x14x14xf32>
    %v406 = stablehlo.reduce(%v405 init: %v398) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x128x14x14xf32>, tensor<f32>) -> tensor<32x128xf32>
    %v407 = stablehlo.broadcast_in_dim %v406, dims = [0, 1] : (tensor<32x128xf32>) -> tensor<32x128x14x14xf32>
    %v408 = stablehlo.divide %v407, %v399 : tensor<32x128x14x14xf32>
    %v409 = stablehlo.add %v408, %v400 : tensor<32x128x14x14xf32>
    %v410 = stablehlo.rsqrt %v409 : tensor<32x128x14x14xf32>
    %v411 = stablehlo.multiply %v404, %v410 : tensor<32x128x14x14xf32>
    %v412 = stablehlo.broadcast_in_dim %gd5, dims = [1] : (tensor<128xf32>) -> tensor<32x128x14x14xf32>
    %v413 = stablehlo.broadcast_in_dim %btd5, dims = [1] : (tensor<128xf32>) -> tensor<32x128x14x14xf32>
    %v414 = stablehlo.multiply %v411, %v412 : tensor<32x128x14x14xf32>
    %v415 = stablehlo.add %v414, %v413 : tensor<32x128x14x14xf32>
    %v416 = stablehlo.reshape %v415 : (tensor<32x128x14x14xf32>) -> tensor<32x25088xf32>
    %v417 = stablehlo.constant dense<0.0> : tensor<32x25088xf32>
    %v418 = stablehlo.constant dense<6.0> : tensor<32x25088xf32>
    %v419 = stablehlo.maximum %v416, %v417 : tensor<32x25088xf32>
    %v420 = stablehlo.minimum %v419, %v418 : tensor<32x25088xf32>
    %v421 = stablehlo.reshape %v420 : (tensor<32x25088xf32>) -> tensor<32x128x14x14xf32>
    %v422 = stablehlo.convolution(%v421, %Wp5)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x128x14x14xf32>, tensor<64x128x1x1xf32>) -> tensor<32x64x14x14xf32>
    %v423 = stablehlo.broadcast_in_dim %bp5, dims = [1] : (tensor<64xf32>) -> tensor<32x64x14x14xf32>
    %v424 = stablehlo.add %v422, %v423 : tensor<32x64x14x14xf32>
    %v425 = stablehlo.reshape %v424 : (tensor<32x64x14x14xf32>) -> tensor<32x12544xf32>
    %v426 = stablehlo.reshape %v425 : (tensor<32x12544xf32>) -> tensor<32x64x14x14xf32>
    %v427 = stablehlo.constant dense<0.0> : tensor<f32>
    %v428 = stablehlo.constant dense<196.0> : tensor<32x64x14x14xf32>
    %v429 = stablehlo.constant dense<1.0e-5> : tensor<32x64x14x14xf32>
    %v430 = stablehlo.reduce(%v426 init: %v427) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x64x14x14xf32>, tensor<f32>) -> tensor<32x64xf32>
    %v431 = stablehlo.broadcast_in_dim %v430, dims = [0, 1] : (tensor<32x64xf32>) -> tensor<32x64x14x14xf32>
    %v432 = stablehlo.divide %v431, %v428 : tensor<32x64x14x14xf32>
    %v433 = stablehlo.subtract %v426, %v432 : tensor<32x64x14x14xf32>
    %v434 = stablehlo.multiply %v433, %v433 : tensor<32x64x14x14xf32>
    %v435 = stablehlo.reduce(%v434 init: %v427) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x64x14x14xf32>, tensor<f32>) -> tensor<32x64xf32>
    %v436 = stablehlo.broadcast_in_dim %v435, dims = [0, 1] : (tensor<32x64xf32>) -> tensor<32x64x14x14xf32>
    %v437 = stablehlo.divide %v436, %v428 : tensor<32x64x14x14xf32>
    %v438 = stablehlo.add %v437, %v429 : tensor<32x64x14x14xf32>
    %v439 = stablehlo.rsqrt %v438 : tensor<32x64x14x14xf32>
    %v440 = stablehlo.multiply %v433, %v439 : tensor<32x64x14x14xf32>
    %v441 = stablehlo.broadcast_in_dim %gp5, dims = [1] : (tensor<64xf32>) -> tensor<32x64x14x14xf32>
    %v442 = stablehlo.broadcast_in_dim %btp5, dims = [1] : (tensor<64xf32>) -> tensor<32x64x14x14xf32>
    %v443 = stablehlo.multiply %v440, %v441 : tensor<32x64x14x14xf32>
    %v444 = stablehlo.add %v443, %v442 : tensor<32x64x14x14xf32>
    %v445 = stablehlo.reshape %v444 : (tensor<32x64x14x14xf32>) -> tensor<32x12544xf32>
    %v446 = stablehlo.reshape %v445 : (tensor<32x12544xf32>) -> tensor<32x64x14x14xf32>
    %v447 = stablehlo.convolution(%v446, %We6)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [1, 1], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x64x14x14xf32>, tensor<256x64x1x1xf32>) -> tensor<32x256x14x14xf32>
    %v448 = stablehlo.broadcast_in_dim %be6, dims = [1] : (tensor<256xf32>) -> tensor<32x256x14x14xf32>
    %v449 = stablehlo.add %v447, %v448 : tensor<32x256x14x14xf32>
    %v450 = stablehlo.reshape %v449 : (tensor<32x256x14x14xf32>) -> tensor<32x50176xf32>
    %v451 = stablehlo.reshape %v450 : (tensor<32x50176xf32>) -> tensor<32x256x14x14xf32>
    %v452 = stablehlo.constant dense<0.0> : tensor<f32>
    %v453 = stablehlo.constant dense<196.0> : tensor<32x256x14x14xf32>
    %v454 = stablehlo.constant dense<1.0e-5> : tensor<32x256x14x14xf32>
    %v455 = stablehlo.reduce(%v451 init: %v452) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x256x14x14xf32>, tensor<f32>) -> tensor<32x256xf32>
    %v456 = stablehlo.broadcast_in_dim %v455, dims = [0, 1] : (tensor<32x256xf32>) -> tensor<32x256x14x14xf32>
    %v457 = stablehlo.divide %v456, %v453 : tensor<32x256x14x14xf32>
    %v458 = stablehlo.subtract %v451, %v457 : tensor<32x256x14x14xf32>
    %v459 = stablehlo.multiply %v458, %v458 : tensor<32x256x14x14xf32>
    %v460 = stablehlo.reduce(%v459 init: %v452) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x256x14x14xf32>, tensor<f32>) -> tensor<32x256xf32>
    %v461 = stablehlo.broadcast_in_dim %v460, dims = [0, 1] : (tensor<32x256xf32>) -> tensor<32x256x14x14xf32>
    %v462 = stablehlo.divide %v461, %v453 : tensor<32x256x14x14xf32>
    %v463 = stablehlo.add %v462, %v454 : tensor<32x256x14x14xf32>
    %v464 = stablehlo.rsqrt %v463 : tensor<32x256x14x14xf32>
    %v465 = stablehlo.multiply %v458, %v464 : tensor<32x256x14x14xf32>
    %v466 = stablehlo.broadcast_in_dim %ge6, dims = [1] : (tensor<256xf32>) -> tensor<32x256x14x14xf32>
    %v467 = stablehlo.broadcast_in_dim %bte6, dims = [1] : (tensor<256xf32>) -> tensor<32x256x14x14xf32>
    %v468 = stablehlo.multiply %v465, %v466 : tensor<32x256x14x14xf32>
    %v469 = stablehlo.add %v468, %v467 : tensor<32x256x14x14xf32>
    %v470 = stablehlo.reshape %v469 : (tensor<32x256x14x14xf32>) -> tensor<32x50176xf32>
    %v471 = stablehlo.constant dense<0.0> : tensor<32x50176xf32>
    %v472 = stablehlo.constant dense<6.0> : tensor<32x50176xf32>
    %v473 = stablehlo.maximum %v470, %v471 : tensor<32x50176xf32>
    %v474 = stablehlo.minimum %v473, %v472 : tensor<32x50176xf32>
    %v475 = stablehlo.reshape %v474 : (tensor<32x50176xf32>) -> tensor<32x256x14x14xf32>
    %v476 = stablehlo.convolution(%v475, %Wd6)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [2, 2], pad = [[1, 1], [1, 1]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 256 : i64} : (tensor<32x256x14x14xf32>, tensor<256x1x3x3xf32>) -> tensor<32x256x7x7xf32>
    %v477 = stablehlo.broadcast_in_dim %bd6, dims = [1] : (tensor<256xf32>) -> tensor<32x256x7x7xf32>
    %v478 = stablehlo.add %v476, %v477 : tensor<32x256x7x7xf32>
    %v479 = stablehlo.reshape %v478 : (tensor<32x256x7x7xf32>) -> tensor<32x12544xf32>
    %v480 = stablehlo.reshape %v479 : (tensor<32x12544xf32>) -> tensor<32x256x7x7xf32>
    %v481 = stablehlo.constant dense<0.0> : tensor<f32>
    %v482 = stablehlo.constant dense<49.0> : tensor<32x256x7x7xf32>
    %v483 = stablehlo.constant dense<1.0e-5> : tensor<32x256x7x7xf32>
    %v484 = stablehlo.reduce(%v480 init: %v481) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x256x7x7xf32>, tensor<f32>) -> tensor<32x256xf32>
    %v485 = stablehlo.broadcast_in_dim %v484, dims = [0, 1] : (tensor<32x256xf32>) -> tensor<32x256x7x7xf32>
    %v486 = stablehlo.divide %v485, %v482 : tensor<32x256x7x7xf32>
    %v487 = stablehlo.subtract %v480, %v486 : tensor<32x256x7x7xf32>
    %v488 = stablehlo.multiply %v487, %v487 : tensor<32x256x7x7xf32>
    %v489 = stablehlo.reduce(%v488 init: %v481) applies stablehlo.add across dimensions = [2, 3] : (tensor<32x256x7x7xf32>, tensor<f32>) -> tensor<32x256xf32>
    %v490 = stablehlo.broadcast_in_dim %v489, dims = [0, 1] : (tensor<32x256xf32>) -> tensor<32x256x7x7xf32>
    %v491 = stablehlo.divide %v490, %v482 : tensor<32x256x7x7xf32>
    %v492 = stablehlo.add %v491, %v483 : tensor<32x256x7x7xf32>
    %v493 = stablehlo.rsqrt %v492 : tensor<32x256x7x7xf32>
