module @m {
  func.func @vit_train_step(%x: tensor<32x150528xf32>, %wConv: tensor<192x3x16x16xf32>, %bConv: tensor<192xf32>, %cls: tensor<1x192xf32>, %pos: tensor<197x192xf32>, %g1_0: tensor<192xf32>, %b1_0: tensor<192xf32>, %Wq_0: tensor<192x192xf32>, %bq_0: tensor<192xf32>, %Wk_0: tensor<192x192xf32>, %bk_0: tensor<192xf32>, %Wv_0: tensor<192x192xf32>, %bv_0: tensor<192xf32>, %Wo_0: tensor<192x192xf32>, %bo_0: tensor<192xf32>, %g2_0: tensor<192xf32>, %b2_0: tensor<192xf32>, %Wfc1_0: tensor<192x768xf32>, %bfc1_0: tensor<768xf32>, %Wfc2_0: tensor<768x192xf32>, %bfc2_0: tensor<192xf32>, %g1_1: tensor<192xf32>, %b1_1: tensor<192xf32>, %Wq_1: tensor<192x192xf32>, %bq_1: tensor<192xf32>, %Wk_1: tensor<192x192xf32>, %bk_1: tensor<192xf32>, %Wv_1: tensor<192x192xf32>, %bv_1: tensor<192xf32>, %Wo_1: tensor<192x192xf32>, %bo_1: tensor<192xf32>, %g2_1: tensor<192xf32>, %b2_1: tensor<192xf32>, %Wfc1_1: tensor<192x768xf32>, %bfc1_1: tensor<768xf32>, %Wfc2_1: tensor<768x192xf32>, %bfc2_1: tensor<192xf32>, %g1_2: tensor<192xf32>, %b1_2: tensor<192xf32>, %Wq_2: tensor<192x192xf32>, %bq_2: tensor<192xf32>, %Wk_2: tensor<192x192xf32>, %bk_2: tensor<192xf32>, %Wv_2: tensor<192x192xf32>, %bv_2: tensor<192xf32>, %Wo_2: tensor<192x192xf32>, %bo_2: tensor<192xf32>, %g2_2: tensor<192xf32>, %b2_2: tensor<192xf32>, %Wfc1_2: tensor<192x768xf32>, %bfc1_2: tensor<768xf32>, %Wfc2_2: tensor<768x192xf32>, %bfc2_2: tensor<192xf32>, %g1_3: tensor<192xf32>, %b1_3: tensor<192xf32>, %Wq_3: tensor<192x192xf32>, %bq_3: tensor<192xf32>, %Wk_3: tensor<192x192xf32>, %bk_3: tensor<192xf32>, %Wv_3: tensor<192x192xf32>, %bv_3: tensor<192xf32>, %Wo_3: tensor<192x192xf32>, %bo_3: tensor<192xf32>, %g2_3: tensor<192xf32>, %b2_3: tensor<192xf32>, %Wfc1_3: tensor<192x768xf32>, %bfc1_3: tensor<768xf32>, %Wfc2_3: tensor<768x192xf32>, %bfc2_3: tensor<192xf32>, %g1_4: tensor<192xf32>, %b1_4: tensor<192xf32>, %Wq_4: tensor<192x192xf32>, %bq_4: tensor<192xf32>, %Wk_4: tensor<192x192xf32>, %bk_4: tensor<192xf32>, %Wv_4: tensor<192x192xf32>, %bv_4: tensor<192xf32>, %Wo_4: tensor<192x192xf32>, %bo_4: tensor<192xf32>, %g2_4: tensor<192xf32>, %b2_4: tensor<192xf32>, %Wfc1_4: tensor<192x768xf32>, %bfc1_4: tensor<768xf32>, %Wfc2_4: tensor<768x192xf32>, %bfc2_4: tensor<192xf32>, %g1_5: tensor<192xf32>, %b1_5: tensor<192xf32>, %Wq_5: tensor<192x192xf32>, %bq_5: tensor<192xf32>, %Wk_5: tensor<192x192xf32>, %bk_5: tensor<192xf32>, %Wv_5: tensor<192x192xf32>, %bv_5: tensor<192xf32>, %Wo_5: tensor<192x192xf32>, %bo_5: tensor<192xf32>, %g2_5: tensor<192xf32>, %b2_5: tensor<192xf32>, %Wfc1_5: tensor<192x768xf32>, %bfc1_5: tensor<768xf32>, %Wfc2_5: tensor<768x192xf32>, %bfc2_5: tensor<192xf32>, %g1_6: tensor<192xf32>, %b1_6: tensor<192xf32>, %Wq_6: tensor<192x192xf32>, %bq_6: tensor<192xf32>, %Wk_6: tensor<192x192xf32>, %bk_6: tensor<192xf32>, %Wv_6: tensor<192x192xf32>, %bv_6: tensor<192xf32>, %Wo_6: tensor<192x192xf32>, %bo_6: tensor<192xf32>, %g2_6: tensor<192xf32>, %b2_6: tensor<192xf32>, %Wfc1_6: tensor<192x768xf32>, %bfc1_6: tensor<768xf32>, %Wfc2_6: tensor<768x192xf32>, %bfc2_6: tensor<192xf32>, %g1_7: tensor<192xf32>, %b1_7: tensor<192xf32>, %Wq_7: tensor<192x192xf32>, %bq_7: tensor<192xf32>, %Wk_7: tensor<192x192xf32>, %bk_7: tensor<192xf32>, %Wv_7: tensor<192x192xf32>, %bv_7: tensor<192xf32>, %Wo_7: tensor<192x192xf32>, %bo_7: tensor<192xf32>, %g2_7: tensor<192xf32>, %b2_7: tensor<192xf32>, %Wfc1_7: tensor<192x768xf32>, %bfc1_7: tensor<768xf32>, %Wfc2_7: tensor<768x192xf32>, %bfc2_7: tensor<192xf32>, %g1_8: tensor<192xf32>, %b1_8: tensor<192xf32>, %Wq_8: tensor<192x192xf32>, %bq_8: tensor<192xf32>, %Wk_8: tensor<192x192xf32>, %bk_8: tensor<192xf32>, %Wv_8: tensor<192x192xf32>, %bv_8: tensor<192xf32>, %Wo_8: tensor<192x192xf32>, %bo_8: tensor<192xf32>, %g2_8: tensor<192xf32>, %b2_8: tensor<192xf32>, %Wfc1_8: tensor<192x768xf32>, %bfc1_8: tensor<768xf32>, %Wfc2_8: tensor<768x192xf32>, %bfc2_8: tensor<192xf32>, %g1_9: tensor<192xf32>, %b1_9: tensor<192xf32>, %Wq_9: tensor<192x192xf32>, %bq_9: tensor<192xf32>, %Wk_9: tensor<192x192xf32>, %bk_9: tensor<192xf32>, %Wv_9: tensor<192x192xf32>, %bv_9: tensor<192xf32>, %Wo_9: tensor<192x192xf32>, %bo_9: tensor<192xf32>, %g2_9: tensor<192xf32>, %b2_9: tensor<192xf32>, %Wfc1_9: tensor<192x768xf32>, %bfc1_9: tensor<768xf32>, %Wfc2_9: tensor<768x192xf32>, %bfc2_9: tensor<192xf32>, %g1_10: tensor<192xf32>, %b1_10: tensor<192xf32>, %Wq_10: tensor<192x192xf32>, %bq_10: tensor<192xf32>, %Wk_10: tensor<192x192xf32>, %bk_10: tensor<192xf32>, %Wv_10: tensor<192x192xf32>, %bv_10: tensor<192xf32>, %Wo_10: tensor<192x192xf32>, %bo_10: tensor<192xf32>, %g2_10: tensor<192xf32>, %b2_10: tensor<192xf32>, %Wfc1_10: tensor<192x768xf32>, %bfc1_10: tensor<768xf32>, %Wfc2_10: tensor<768x192xf32>, %bfc2_10: tensor<192xf32>, %g1_11: tensor<192xf32>, %b1_11: tensor<192xf32>, %Wq_11: tensor<192x192xf32>, %bq_11: tensor<192xf32>, %Wk_11: tensor<192x192xf32>, %bk_11: tensor<192xf32>, %Wv_11: tensor<192x192xf32>, %bv_11: tensor<192xf32>, %Wo_11: tensor<192x192xf32>, %bo_11: tensor<192xf32>, %g2_11: tensor<192xf32>, %b2_11: tensor<192xf32>, %Wfc1_11: tensor<192x768xf32>, %bfc1_11: tensor<768xf32>, %Wfc2_11: tensor<768x192xf32>, %bfc2_11: tensor<192xf32>, %gF: tensor<192xf32>, %bF: tensor<192xf32>, %Wc: tensor<192x10xf32>, %bc: tensor<10xf32>, %onehot: tensor<32x10xf32>) -> (tensor<192x3x16x16xf32>, tensor<192xf32>, tensor<1x192xf32>, tensor<197x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x768xf32>, tensor<768xf32>, tensor<768x192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192xf32>, tensor<192x10xf32>, tensor<10xf32>) {
    %sc = stablehlo.constant dense<0.0> : tensor<f32>
    %xr = stablehlo.reshape %x : (tensor<32x150528xf32>) -> tensor<32x3x224x224xf32>
    %vitpec = stablehlo.convolution(%xr, %wConv)
      dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1],
      window = {stride = [16, 16], pad = [[0, 0], [0, 0]], lhs_dilate = [1, 1], rhs_dilate = [1, 1]}
      {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<32x3x224x224xf32>, tensor<192x3x16x16xf32>) -> tensor<32x192x14x14xf32>
    %vitpecbb = stablehlo.broadcast_in_dim %bConv, dims = [1] : (tensor<192xf32>) -> tensor<32x192x14x14xf32>
    %vitpepe = stablehlo.add %vitpec, %vitpecbb : tensor<32x192x14x14xf32>
    %vitpept = stablehlo.transpose %vitpepe, dims = [0, 2, 3, 1] : (tensor<32x192x14x14xf32>) -> tensor<32x14x14x192xf32>
    %vitpetok = stablehlo.reshape %vitpept : (tensor<32x14x14x192xf32>) -> tensor<32x196x192xf32>
    %vitcpclsb = stablehlo.broadcast_in_dim %cls, dims = [1, 2] : (tensor<1x192xf32>) -> tensor<32x1x192xf32>
    %vitcpcat = stablehlo.concatenate %vitcpclsb, %vitpetok, dim = 1 : (tensor<32x1x192xf32>, tensor<32x196x192xf32>) -> tensor<32x197x192xf32>
    %vitcpposb = stablehlo.broadcast_in_dim %pos, dims = [1, 2] : (tensor<197x192xf32>) -> tensor<32x197x192xf32>
    %vitcpz = stablehlo.add %vitcpcat, %vitcpposb : tensor<32x197x192xf32>
    %vitb0_1sum = stablehlo.reduce(%vitcpz init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb0_1nf = stablehlo.constant dense<192.0> : tensor<32x197xf32>
    %vitb0_1mu = stablehlo.divide %vitb0_1sum, %vitb0_1nf : tensor<32x197xf32>
    %vitb0_1mub = stablehlo.broadcast_in_dim %vitb0_1mu, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb0_1xc = stablehlo.subtract %vitcpz, %vitb0_1mub : tensor<32x197x192xf32>
    %vitb0_1sq = stablehlo.multiply %vitb0_1xc, %vitb0_1xc : tensor<32x197x192xf32>
    %vitb0_1vsum = stablehlo.reduce(%vitb0_1sq init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb0_1var = stablehlo.divide %vitb0_1vsum, %vitb0_1nf : tensor<32x197xf32>
    %vitb0_1eps = stablehlo.constant dense<1.0e-5> : tensor<32x197xf32>
    %vitb0_1ve = stablehlo.add %vitb0_1var, %vitb0_1eps : tensor<32x197xf32>
    %vitb0_1istd = stablehlo.rsqrt %vitb0_1ve : tensor<32x197xf32>
    %vitb0_1istdb = stablehlo.broadcast_in_dim %vitb0_1istd, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb0_1xhat = stablehlo.multiply %vitb0_1xc, %vitb0_1istdb : tensor<32x197x192xf32>
    %vitb0_1gb = stablehlo.broadcast_in_dim %g1_0, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb0_1bbc = stablehlo.broadcast_in_dim %b1_0, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb0_1gx = stablehlo.multiply %vitb0_1xhat, %vitb0_1gb : tensor<32x197x192xf32>
    %vitb0_1y = stablehlo.add %vitb0_1gx, %vitb0_1bbc : tensor<32x197x192xf32>
    %vitb0_mQd = stablehlo.dot_general %vitb0_1y, %Wq_0, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb0_mQbb = stablehlo.broadcast_in_dim %bq_0, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb0_mQ = stablehlo.add %vitb0_mQd, %vitb0_mQbb : tensor<32x197x192xf32>
    %vitb0_mKd = stablehlo.dot_general %vitb0_1y, %Wk_0, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb0_mKbb = stablehlo.broadcast_in_dim %bk_0, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb0_mK = stablehlo.add %vitb0_mKd, %vitb0_mKbb : tensor<32x197x192xf32>
    %vitb0_mVd = stablehlo.dot_general %vitb0_1y, %Wv_0, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb0_mVbb = stablehlo.broadcast_in_dim %bv_0, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb0_mV = stablehlo.add %vitb0_mVd, %vitb0_mVbb : tensor<32x197x192xf32>
    %vitb0_mQhr = stablehlo.reshape %vitb0_mQ : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb0_mQh = stablehlo.transpose %vitb0_mQhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb0_mKhr = stablehlo.reshape %vitb0_mK : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb0_mKh = stablehlo.transpose %vitb0_mKhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb0_mVhr = stablehlo.reshape %vitb0_mV : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb0_mVh = stablehlo.transpose %vitb0_mVhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb0_mS = stablehlo.dot_general %vitb0_mQh, %vitb0_mKh, batching_dims = [0, 1] x [0, 1], contracting_dims = [3] x [3], precision = [DEFAULT, DEFAULT] : (tensor<32x3x197x64xf32>, tensor<32x3x197x64xf32>) -> tensor<32x3x197x197xf32>
    %vitb0_mscl = stablehlo.constant dense<0.125> : tensor<32x3x197x197xf32>
    %vitb0_mSs = stablehlo.multiply %vitb0_mS, %vitb0_mscl : tensor<32x3x197x197xf32>
    %vitb0_mse = stablehlo.exponential %vitb0_mSs : tensor<32x3x197x197xf32>
    %vitb0_msum = stablehlo.reduce(%vitb0_mse init: %sc) applies stablehlo.add across dimensions = [3] : (tensor<32x3x197x197xf32>, tensor<f32>) -> tensor<32x3x197xf32>
    %vitb0_msumb = stablehlo.broadcast_in_dim %vitb0_msum, dims = [0, 1, 2] : (tensor<32x3x197xf32>) -> tensor<32x3x197x197xf32>
    %vitb0_mW = stablehlo.divide %vitb0_mse, %vitb0_msumb : tensor<32x3x197x197xf32>
    %vitb0_mA = stablehlo.dot_general %vitb0_mW, %vitb0_mVh, batching_dims = [0, 1] x [0, 1], contracting_dims = [3] x [2], precision = [DEFAULT, DEFAULT] : (tensor<32x3x197x197xf32>, tensor<32x3x197x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb0_mAT = stablehlo.transpose %vitb0_mA, dims = [0, 2, 1, 3] : (tensor<32x3x197x64xf32>) -> tensor<32x197x3x64xf32>
    %vitb0_mP = stablehlo.reshape %vitb0_mAT : (tensor<32x197x3x64xf32>) -> tensor<32x197x192xf32>
    %vitb0_mod = stablehlo.dot_general %vitb0_mP, %Wo_0, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb0_mobb = stablehlo.broadcast_in_dim %bo_0, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb0_mO = stablehlo.add %vitb0_mod, %vitb0_mobb : tensor<32x197x192xf32>
    %vitb0_r1 = stablehlo.add %vitcpz, %vitb0_mO : tensor<32x197x192xf32>
    %vitb0_2sum = stablehlo.reduce(%vitb0_r1 init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb0_2nf = stablehlo.constant dense<192.0> : tensor<32x197xf32>
    %vitb0_2mu = stablehlo.divide %vitb0_2sum, %vitb0_2nf : tensor<32x197xf32>
    %vitb0_2mub = stablehlo.broadcast_in_dim %vitb0_2mu, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb0_2xc = stablehlo.subtract %vitb0_r1, %vitb0_2mub : tensor<32x197x192xf32>
    %vitb0_2sq = stablehlo.multiply %vitb0_2xc, %vitb0_2xc : tensor<32x197x192xf32>
    %vitb0_2vsum = stablehlo.reduce(%vitb0_2sq init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb0_2var = stablehlo.divide %vitb0_2vsum, %vitb0_2nf : tensor<32x197xf32>
    %vitb0_2eps = stablehlo.constant dense<1.0e-5> : tensor<32x197xf32>
    %vitb0_2ve = stablehlo.add %vitb0_2var, %vitb0_2eps : tensor<32x197xf32>
    %vitb0_2istd = stablehlo.rsqrt %vitb0_2ve : tensor<32x197xf32>
    %vitb0_2istdb = stablehlo.broadcast_in_dim %vitb0_2istd, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb0_2xhat = stablehlo.multiply %vitb0_2xc, %vitb0_2istdb : tensor<32x197x192xf32>
    %vitb0_2gb = stablehlo.broadcast_in_dim %g2_0, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb0_2bbc = stablehlo.broadcast_in_dim %b2_0, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb0_2gx = stablehlo.multiply %vitb0_2xhat, %vitb0_2gb : tensor<32x197x192xf32>
    %vitb0_2y = stablehlo.add %vitb0_2gx, %vitb0_2bbc : tensor<32x197x192xf32>
    %vitb0_ph1d = stablehlo.dot_general %vitb0_2y, %Wfc1_0, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x768xf32>) -> tensor<32x197x768xf32>
    %vitb0_ph1bb = stablehlo.broadcast_in_dim %bfc1_0, dims = [2] : (tensor<768xf32>) -> tensor<32x197x768xf32>
    %vitb0_ph1 = stablehlo.add %vitb0_ph1d, %vitb0_ph1bb : tensor<32x197x768xf32>
    %vitb0_pgx2 = stablehlo.multiply %vitb0_ph1, %vitb0_ph1 : tensor<32x197x768xf32>
    %vitb0_pgx3 = stablehlo.multiply %vitb0_pgx2, %vitb0_ph1 : tensor<32x197x768xf32>
    %vitb0_pgck = stablehlo.constant dense<0.044715> : tensor<32x197x768xf32>
    %vitb0_pgkx3 = stablehlo.multiply %vitb0_pgck, %vitb0_pgx3 : tensor<32x197x768xf32>
    %vitb0_pginn = stablehlo.add %vitb0_ph1, %vitb0_pgkx3 : tensor<32x197x768xf32>
    %vitb0_pgcsqrt = stablehlo.constant dense<0.7978845608028654> : tensor<32x197x768xf32>
    %vitb0_pgu = stablehlo.multiply %vitb0_pgcsqrt, %vitb0_pginn : tensor<32x197x768xf32>
    %vitb0_pgt = stablehlo.tanh %vitb0_pgu : tensor<32x197x768xf32>
    %vitb0_pgone = stablehlo.constant dense<1.0> : tensor<32x197x768xf32>
    %vitb0_pgopt = stablehlo.add %vitb0_pgone, %vitb0_pgt : tensor<32x197x768xf32>
    %vitb0_pgchalf = stablehlo.constant dense<0.5> : tensor<32x197x768xf32>
    %vitb0_pghx = stablehlo.multiply %vitb0_pgchalf, %vitb0_ph1 : tensor<32x197x768xf32>
    %vitb0_pga = stablehlo.multiply %vitb0_pghx, %vitb0_pgopt : tensor<32x197x768xf32>
    %vitb0_py2d = stablehlo.dot_general %vitb0_pga, %Wfc2_0, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x768xf32>, tensor<768x192xf32>) -> tensor<32x197x192xf32>
    %vitb0_py2bb = stablehlo.broadcast_in_dim %bfc2_0, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb0_py = stablehlo.add %vitb0_py2d, %vitb0_py2bb : tensor<32x197x192xf32>
    %vitb0_out = stablehlo.add %vitb0_r1, %vitb0_py : tensor<32x197x192xf32>
    %vitb1_1sum = stablehlo.reduce(%vitb0_out init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb1_1nf = stablehlo.constant dense<192.0> : tensor<32x197xf32>
    %vitb1_1mu = stablehlo.divide %vitb1_1sum, %vitb1_1nf : tensor<32x197xf32>
    %vitb1_1mub = stablehlo.broadcast_in_dim %vitb1_1mu, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb1_1xc = stablehlo.subtract %vitb0_out, %vitb1_1mub : tensor<32x197x192xf32>
    %vitb1_1sq = stablehlo.multiply %vitb1_1xc, %vitb1_1xc : tensor<32x197x192xf32>
    %vitb1_1vsum = stablehlo.reduce(%vitb1_1sq init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb1_1var = stablehlo.divide %vitb1_1vsum, %vitb1_1nf : tensor<32x197xf32>
    %vitb1_1eps = stablehlo.constant dense<1.0e-5> : tensor<32x197xf32>
    %vitb1_1ve = stablehlo.add %vitb1_1var, %vitb1_1eps : tensor<32x197xf32>
    %vitb1_1istd = stablehlo.rsqrt %vitb1_1ve : tensor<32x197xf32>
    %vitb1_1istdb = stablehlo.broadcast_in_dim %vitb1_1istd, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb1_1xhat = stablehlo.multiply %vitb1_1xc, %vitb1_1istdb : tensor<32x197x192xf32>
    %vitb1_1gb = stablehlo.broadcast_in_dim %g1_1, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb1_1bbc = stablehlo.broadcast_in_dim %b1_1, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb1_1gx = stablehlo.multiply %vitb1_1xhat, %vitb1_1gb : tensor<32x197x192xf32>
    %vitb1_1y = stablehlo.add %vitb1_1gx, %vitb1_1bbc : tensor<32x197x192xf32>
    %vitb1_mQd = stablehlo.dot_general %vitb1_1y, %Wq_1, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb1_mQbb = stablehlo.broadcast_in_dim %bq_1, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb1_mQ = stablehlo.add %vitb1_mQd, %vitb1_mQbb : tensor<32x197x192xf32>
    %vitb1_mKd = stablehlo.dot_general %vitb1_1y, %Wk_1, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb1_mKbb = stablehlo.broadcast_in_dim %bk_1, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb1_mK = stablehlo.add %vitb1_mKd, %vitb1_mKbb : tensor<32x197x192xf32>
    %vitb1_mVd = stablehlo.dot_general %vitb1_1y, %Wv_1, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb1_mVbb = stablehlo.broadcast_in_dim %bv_1, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb1_mV = stablehlo.add %vitb1_mVd, %vitb1_mVbb : tensor<32x197x192xf32>
    %vitb1_mQhr = stablehlo.reshape %vitb1_mQ : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb1_mQh = stablehlo.transpose %vitb1_mQhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb1_mKhr = stablehlo.reshape %vitb1_mK : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb1_mKh = stablehlo.transpose %vitb1_mKhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb1_mVhr = stablehlo.reshape %vitb1_mV : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb1_mVh = stablehlo.transpose %vitb1_mVhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb1_mS = stablehlo.dot_general %vitb1_mQh, %vitb1_mKh, batching_dims = [0, 1] x [0, 1], contracting_dims = [3] x [3], precision = [DEFAULT, DEFAULT] : (tensor<32x3x197x64xf32>, tensor<32x3x197x64xf32>) -> tensor<32x3x197x197xf32>
    %vitb1_mscl = stablehlo.constant dense<0.125> : tensor<32x3x197x197xf32>
    %vitb1_mSs = stablehlo.multiply %vitb1_mS, %vitb1_mscl : tensor<32x3x197x197xf32>
    %vitb1_mse = stablehlo.exponential %vitb1_mSs : tensor<32x3x197x197xf32>
    %vitb1_msum = stablehlo.reduce(%vitb1_mse init: %sc) applies stablehlo.add across dimensions = [3] : (tensor<32x3x197x197xf32>, tensor<f32>) -> tensor<32x3x197xf32>
    %vitb1_msumb = stablehlo.broadcast_in_dim %vitb1_msum, dims = [0, 1, 2] : (tensor<32x3x197xf32>) -> tensor<32x3x197x197xf32>
    %vitb1_mW = stablehlo.divide %vitb1_mse, %vitb1_msumb : tensor<32x3x197x197xf32>
    %vitb1_mA = stablehlo.dot_general %vitb1_mW, %vitb1_mVh, batching_dims = [0, 1] x [0, 1], contracting_dims = [3] x [2], precision = [DEFAULT, DEFAULT] : (tensor<32x3x197x197xf32>, tensor<32x3x197x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb1_mAT = stablehlo.transpose %vitb1_mA, dims = [0, 2, 1, 3] : (tensor<32x3x197x64xf32>) -> tensor<32x197x3x64xf32>
    %vitb1_mP = stablehlo.reshape %vitb1_mAT : (tensor<32x197x3x64xf32>) -> tensor<32x197x192xf32>
    %vitb1_mod = stablehlo.dot_general %vitb1_mP, %Wo_1, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb1_mobb = stablehlo.broadcast_in_dim %bo_1, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb1_mO = stablehlo.add %vitb1_mod, %vitb1_mobb : tensor<32x197x192xf32>
    %vitb1_r1 = stablehlo.add %vitb0_out, %vitb1_mO : tensor<32x197x192xf32>
    %vitb1_2sum = stablehlo.reduce(%vitb1_r1 init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb1_2nf = stablehlo.constant dense<192.0> : tensor<32x197xf32>
    %vitb1_2mu = stablehlo.divide %vitb1_2sum, %vitb1_2nf : tensor<32x197xf32>
    %vitb1_2mub = stablehlo.broadcast_in_dim %vitb1_2mu, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb1_2xc = stablehlo.subtract %vitb1_r1, %vitb1_2mub : tensor<32x197x192xf32>
    %vitb1_2sq = stablehlo.multiply %vitb1_2xc, %vitb1_2xc : tensor<32x197x192xf32>
    %vitb1_2vsum = stablehlo.reduce(%vitb1_2sq init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb1_2var = stablehlo.divide %vitb1_2vsum, %vitb1_2nf : tensor<32x197xf32>
    %vitb1_2eps = stablehlo.constant dense<1.0e-5> : tensor<32x197xf32>
    %vitb1_2ve = stablehlo.add %vitb1_2var, %vitb1_2eps : tensor<32x197xf32>
    %vitb1_2istd = stablehlo.rsqrt %vitb1_2ve : tensor<32x197xf32>
    %vitb1_2istdb = stablehlo.broadcast_in_dim %vitb1_2istd, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb1_2xhat = stablehlo.multiply %vitb1_2xc, %vitb1_2istdb : tensor<32x197x192xf32>
    %vitb1_2gb = stablehlo.broadcast_in_dim %g2_1, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb1_2bbc = stablehlo.broadcast_in_dim %b2_1, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb1_2gx = stablehlo.multiply %vitb1_2xhat, %vitb1_2gb : tensor<32x197x192xf32>
    %vitb1_2y = stablehlo.add %vitb1_2gx, %vitb1_2bbc : tensor<32x197x192xf32>
    %vitb1_ph1d = stablehlo.dot_general %vitb1_2y, %Wfc1_1, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x768xf32>) -> tensor<32x197x768xf32>
    %vitb1_ph1bb = stablehlo.broadcast_in_dim %bfc1_1, dims = [2] : (tensor<768xf32>) -> tensor<32x197x768xf32>
    %vitb1_ph1 = stablehlo.add %vitb1_ph1d, %vitb1_ph1bb : tensor<32x197x768xf32>
    %vitb1_pgx2 = stablehlo.multiply %vitb1_ph1, %vitb1_ph1 : tensor<32x197x768xf32>
    %vitb1_pgx3 = stablehlo.multiply %vitb1_pgx2, %vitb1_ph1 : tensor<32x197x768xf32>
    %vitb1_pgck = stablehlo.constant dense<0.044715> : tensor<32x197x768xf32>
    %vitb1_pgkx3 = stablehlo.multiply %vitb1_pgck, %vitb1_pgx3 : tensor<32x197x768xf32>
    %vitb1_pginn = stablehlo.add %vitb1_ph1, %vitb1_pgkx3 : tensor<32x197x768xf32>
    %vitb1_pgcsqrt = stablehlo.constant dense<0.7978845608028654> : tensor<32x197x768xf32>
    %vitb1_pgu = stablehlo.multiply %vitb1_pgcsqrt, %vitb1_pginn : tensor<32x197x768xf32>
    %vitb1_pgt = stablehlo.tanh %vitb1_pgu : tensor<32x197x768xf32>
    %vitb1_pgone = stablehlo.constant dense<1.0> : tensor<32x197x768xf32>
    %vitb1_pgopt = stablehlo.add %vitb1_pgone, %vitb1_pgt : tensor<32x197x768xf32>
    %vitb1_pgchalf = stablehlo.constant dense<0.5> : tensor<32x197x768xf32>
    %vitb1_pghx = stablehlo.multiply %vitb1_pgchalf, %vitb1_ph1 : tensor<32x197x768xf32>
    %vitb1_pga = stablehlo.multiply %vitb1_pghx, %vitb1_pgopt : tensor<32x197x768xf32>
    %vitb1_py2d = stablehlo.dot_general %vitb1_pga, %Wfc2_1, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x768xf32>, tensor<768x192xf32>) -> tensor<32x197x192xf32>
    %vitb1_py2bb = stablehlo.broadcast_in_dim %bfc2_1, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb1_py = stablehlo.add %vitb1_py2d, %vitb1_py2bb : tensor<32x197x192xf32>
    %vitb1_out = stablehlo.add %vitb1_r1, %vitb1_py : tensor<32x197x192xf32>
    %vitb2_1sum = stablehlo.reduce(%vitb1_out init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb2_1nf = stablehlo.constant dense<192.0> : tensor<32x197xf32>
    %vitb2_1mu = stablehlo.divide %vitb2_1sum, %vitb2_1nf : tensor<32x197xf32>
    %vitb2_1mub = stablehlo.broadcast_in_dim %vitb2_1mu, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb2_1xc = stablehlo.subtract %vitb1_out, %vitb2_1mub : tensor<32x197x192xf32>
    %vitb2_1sq = stablehlo.multiply %vitb2_1xc, %vitb2_1xc : tensor<32x197x192xf32>
    %vitb2_1vsum = stablehlo.reduce(%vitb2_1sq init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb2_1var = stablehlo.divide %vitb2_1vsum, %vitb2_1nf : tensor<32x197xf32>
    %vitb2_1eps = stablehlo.constant dense<1.0e-5> : tensor<32x197xf32>
    %vitb2_1ve = stablehlo.add %vitb2_1var, %vitb2_1eps : tensor<32x197xf32>
    %vitb2_1istd = stablehlo.rsqrt %vitb2_1ve : tensor<32x197xf32>
    %vitb2_1istdb = stablehlo.broadcast_in_dim %vitb2_1istd, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb2_1xhat = stablehlo.multiply %vitb2_1xc, %vitb2_1istdb : tensor<32x197x192xf32>
    %vitb2_1gb = stablehlo.broadcast_in_dim %g1_2, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb2_1bbc = stablehlo.broadcast_in_dim %b1_2, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb2_1gx = stablehlo.multiply %vitb2_1xhat, %vitb2_1gb : tensor<32x197x192xf32>
    %vitb2_1y = stablehlo.add %vitb2_1gx, %vitb2_1bbc : tensor<32x197x192xf32>
    %vitb2_mQd = stablehlo.dot_general %vitb2_1y, %Wq_2, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb2_mQbb = stablehlo.broadcast_in_dim %bq_2, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb2_mQ = stablehlo.add %vitb2_mQd, %vitb2_mQbb : tensor<32x197x192xf32>
    %vitb2_mKd = stablehlo.dot_general %vitb2_1y, %Wk_2, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb2_mKbb = stablehlo.broadcast_in_dim %bk_2, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb2_mK = stablehlo.add %vitb2_mKd, %vitb2_mKbb : tensor<32x197x192xf32>
    %vitb2_mVd = stablehlo.dot_general %vitb2_1y, %Wv_2, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb2_mVbb = stablehlo.broadcast_in_dim %bv_2, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb2_mV = stablehlo.add %vitb2_mVd, %vitb2_mVbb : tensor<32x197x192xf32>
    %vitb2_mQhr = stablehlo.reshape %vitb2_mQ : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb2_mQh = stablehlo.transpose %vitb2_mQhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb2_mKhr = stablehlo.reshape %vitb2_mK : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb2_mKh = stablehlo.transpose %vitb2_mKhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb2_mVhr = stablehlo.reshape %vitb2_mV : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb2_mVh = stablehlo.transpose %vitb2_mVhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb2_mS = stablehlo.dot_general %vitb2_mQh, %vitb2_mKh, batching_dims = [0, 1] x [0, 1], contracting_dims = [3] x [3], precision = [DEFAULT, DEFAULT] : (tensor<32x3x197x64xf32>, tensor<32x3x197x64xf32>) -> tensor<32x3x197x197xf32>
    %vitb2_mscl = stablehlo.constant dense<0.125> : tensor<32x3x197x197xf32>
    %vitb2_mSs = stablehlo.multiply %vitb2_mS, %vitb2_mscl : tensor<32x3x197x197xf32>
    %vitb2_mse = stablehlo.exponential %vitb2_mSs : tensor<32x3x197x197xf32>
    %vitb2_msum = stablehlo.reduce(%vitb2_mse init: %sc) applies stablehlo.add across dimensions = [3] : (tensor<32x3x197x197xf32>, tensor<f32>) -> tensor<32x3x197xf32>
    %vitb2_msumb = stablehlo.broadcast_in_dim %vitb2_msum, dims = [0, 1, 2] : (tensor<32x3x197xf32>) -> tensor<32x3x197x197xf32>
    %vitb2_mW = stablehlo.divide %vitb2_mse, %vitb2_msumb : tensor<32x3x197x197xf32>
    %vitb2_mA = stablehlo.dot_general %vitb2_mW, %vitb2_mVh, batching_dims = [0, 1] x [0, 1], contracting_dims = [3] x [2], precision = [DEFAULT, DEFAULT] : (tensor<32x3x197x197xf32>, tensor<32x3x197x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb2_mAT = stablehlo.transpose %vitb2_mA, dims = [0, 2, 1, 3] : (tensor<32x3x197x64xf32>) -> tensor<32x197x3x64xf32>
    %vitb2_mP = stablehlo.reshape %vitb2_mAT : (tensor<32x197x3x64xf32>) -> tensor<32x197x192xf32>
    %vitb2_mod = stablehlo.dot_general %vitb2_mP, %Wo_2, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb2_mobb = stablehlo.broadcast_in_dim %bo_2, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb2_mO = stablehlo.add %vitb2_mod, %vitb2_mobb : tensor<32x197x192xf32>
    %vitb2_r1 = stablehlo.add %vitb1_out, %vitb2_mO : tensor<32x197x192xf32>
    %vitb2_2sum = stablehlo.reduce(%vitb2_r1 init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb2_2nf = stablehlo.constant dense<192.0> : tensor<32x197xf32>
    %vitb2_2mu = stablehlo.divide %vitb2_2sum, %vitb2_2nf : tensor<32x197xf32>
    %vitb2_2mub = stablehlo.broadcast_in_dim %vitb2_2mu, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb2_2xc = stablehlo.subtract %vitb2_r1, %vitb2_2mub : tensor<32x197x192xf32>
    %vitb2_2sq = stablehlo.multiply %vitb2_2xc, %vitb2_2xc : tensor<32x197x192xf32>
    %vitb2_2vsum = stablehlo.reduce(%vitb2_2sq init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb2_2var = stablehlo.divide %vitb2_2vsum, %vitb2_2nf : tensor<32x197xf32>
    %vitb2_2eps = stablehlo.constant dense<1.0e-5> : tensor<32x197xf32>
    %vitb2_2ve = stablehlo.add %vitb2_2var, %vitb2_2eps : tensor<32x197xf32>
    %vitb2_2istd = stablehlo.rsqrt %vitb2_2ve : tensor<32x197xf32>
    %vitb2_2istdb = stablehlo.broadcast_in_dim %vitb2_2istd, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb2_2xhat = stablehlo.multiply %vitb2_2xc, %vitb2_2istdb : tensor<32x197x192xf32>
    %vitb2_2gb = stablehlo.broadcast_in_dim %g2_2, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb2_2bbc = stablehlo.broadcast_in_dim %b2_2, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb2_2gx = stablehlo.multiply %vitb2_2xhat, %vitb2_2gb : tensor<32x197x192xf32>
    %vitb2_2y = stablehlo.add %vitb2_2gx, %vitb2_2bbc : tensor<32x197x192xf32>
    %vitb2_ph1d = stablehlo.dot_general %vitb2_2y, %Wfc1_2, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x768xf32>) -> tensor<32x197x768xf32>
    %vitb2_ph1bb = stablehlo.broadcast_in_dim %bfc1_2, dims = [2] : (tensor<768xf32>) -> tensor<32x197x768xf32>
    %vitb2_ph1 = stablehlo.add %vitb2_ph1d, %vitb2_ph1bb : tensor<32x197x768xf32>
    %vitb2_pgx2 = stablehlo.multiply %vitb2_ph1, %vitb2_ph1 : tensor<32x197x768xf32>
    %vitb2_pgx3 = stablehlo.multiply %vitb2_pgx2, %vitb2_ph1 : tensor<32x197x768xf32>
    %vitb2_pgck = stablehlo.constant dense<0.044715> : tensor<32x197x768xf32>
    %vitb2_pgkx3 = stablehlo.multiply %vitb2_pgck, %vitb2_pgx3 : tensor<32x197x768xf32>
    %vitb2_pginn = stablehlo.add %vitb2_ph1, %vitb2_pgkx3 : tensor<32x197x768xf32>
    %vitb2_pgcsqrt = stablehlo.constant dense<0.7978845608028654> : tensor<32x197x768xf32>
    %vitb2_pgu = stablehlo.multiply %vitb2_pgcsqrt, %vitb2_pginn : tensor<32x197x768xf32>
    %vitb2_pgt = stablehlo.tanh %vitb2_pgu : tensor<32x197x768xf32>
    %vitb2_pgone = stablehlo.constant dense<1.0> : tensor<32x197x768xf32>
    %vitb2_pgopt = stablehlo.add %vitb2_pgone, %vitb2_pgt : tensor<32x197x768xf32>
    %vitb2_pgchalf = stablehlo.constant dense<0.5> : tensor<32x197x768xf32>
    %vitb2_pghx = stablehlo.multiply %vitb2_pgchalf, %vitb2_ph1 : tensor<32x197x768xf32>
    %vitb2_pga = stablehlo.multiply %vitb2_pghx, %vitb2_pgopt : tensor<32x197x768xf32>
    %vitb2_py2d = stablehlo.dot_general %vitb2_pga, %Wfc2_2, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x768xf32>, tensor<768x192xf32>) -> tensor<32x197x192xf32>
    %vitb2_py2bb = stablehlo.broadcast_in_dim %bfc2_2, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb2_py = stablehlo.add %vitb2_py2d, %vitb2_py2bb : tensor<32x197x192xf32>
    %vitb2_out = stablehlo.add %vitb2_r1, %vitb2_py : tensor<32x197x192xf32>
    %vitb3_1sum = stablehlo.reduce(%vitb2_out init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb3_1nf = stablehlo.constant dense<192.0> : tensor<32x197xf32>
    %vitb3_1mu = stablehlo.divide %vitb3_1sum, %vitb3_1nf : tensor<32x197xf32>
    %vitb3_1mub = stablehlo.broadcast_in_dim %vitb3_1mu, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb3_1xc = stablehlo.subtract %vitb2_out, %vitb3_1mub : tensor<32x197x192xf32>
    %vitb3_1sq = stablehlo.multiply %vitb3_1xc, %vitb3_1xc : tensor<32x197x192xf32>
    %vitb3_1vsum = stablehlo.reduce(%vitb3_1sq init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb3_1var = stablehlo.divide %vitb3_1vsum, %vitb3_1nf : tensor<32x197xf32>
    %vitb3_1eps = stablehlo.constant dense<1.0e-5> : tensor<32x197xf32>
    %vitb3_1ve = stablehlo.add %vitb3_1var, %vitb3_1eps : tensor<32x197xf32>
    %vitb3_1istd = stablehlo.rsqrt %vitb3_1ve : tensor<32x197xf32>
    %vitb3_1istdb = stablehlo.broadcast_in_dim %vitb3_1istd, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb3_1xhat = stablehlo.multiply %vitb3_1xc, %vitb3_1istdb : tensor<32x197x192xf32>
    %vitb3_1gb = stablehlo.broadcast_in_dim %g1_3, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb3_1bbc = stablehlo.broadcast_in_dim %b1_3, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb3_1gx = stablehlo.multiply %vitb3_1xhat, %vitb3_1gb : tensor<32x197x192xf32>
    %vitb3_1y = stablehlo.add %vitb3_1gx, %vitb3_1bbc : tensor<32x197x192xf32>
    %vitb3_mQd = stablehlo.dot_general %vitb3_1y, %Wq_3, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb3_mQbb = stablehlo.broadcast_in_dim %bq_3, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb3_mQ = stablehlo.add %vitb3_mQd, %vitb3_mQbb : tensor<32x197x192xf32>
    %vitb3_mKd = stablehlo.dot_general %vitb3_1y, %Wk_3, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb3_mKbb = stablehlo.broadcast_in_dim %bk_3, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb3_mK = stablehlo.add %vitb3_mKd, %vitb3_mKbb : tensor<32x197x192xf32>
    %vitb3_mVd = stablehlo.dot_general %vitb3_1y, %Wv_3, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb3_mVbb = stablehlo.broadcast_in_dim %bv_3, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb3_mV = stablehlo.add %vitb3_mVd, %vitb3_mVbb : tensor<32x197x192xf32>
    %vitb3_mQhr = stablehlo.reshape %vitb3_mQ : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb3_mQh = stablehlo.transpose %vitb3_mQhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb3_mKhr = stablehlo.reshape %vitb3_mK : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb3_mKh = stablehlo.transpose %vitb3_mKhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb3_mVhr = stablehlo.reshape %vitb3_mV : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb3_mVh = stablehlo.transpose %vitb3_mVhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb3_mS = stablehlo.dot_general %vitb3_mQh, %vitb3_mKh, batching_dims = [0, 1] x [0, 1], contracting_dims = [3] x [3], precision = [DEFAULT, DEFAULT] : (tensor<32x3x197x64xf32>, tensor<32x3x197x64xf32>) -> tensor<32x3x197x197xf32>
    %vitb3_mscl = stablehlo.constant dense<0.125> : tensor<32x3x197x197xf32>
    %vitb3_mSs = stablehlo.multiply %vitb3_mS, %vitb3_mscl : tensor<32x3x197x197xf32>
    %vitb3_mse = stablehlo.exponential %vitb3_mSs : tensor<32x3x197x197xf32>
    %vitb3_msum = stablehlo.reduce(%vitb3_mse init: %sc) applies stablehlo.add across dimensions = [3] : (tensor<32x3x197x197xf32>, tensor<f32>) -> tensor<32x3x197xf32>
    %vitb3_msumb = stablehlo.broadcast_in_dim %vitb3_msum, dims = [0, 1, 2] : (tensor<32x3x197xf32>) -> tensor<32x3x197x197xf32>
    %vitb3_mW = stablehlo.divide %vitb3_mse, %vitb3_msumb : tensor<32x3x197x197xf32>
    %vitb3_mA = stablehlo.dot_general %vitb3_mW, %vitb3_mVh, batching_dims = [0, 1] x [0, 1], contracting_dims = [3] x [2], precision = [DEFAULT, DEFAULT] : (tensor<32x3x197x197xf32>, tensor<32x3x197x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb3_mAT = stablehlo.transpose %vitb3_mA, dims = [0, 2, 1, 3] : (tensor<32x3x197x64xf32>) -> tensor<32x197x3x64xf32>
    %vitb3_mP = stablehlo.reshape %vitb3_mAT : (tensor<32x197x3x64xf32>) -> tensor<32x197x192xf32>
    %vitb3_mod = stablehlo.dot_general %vitb3_mP, %Wo_3, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb3_mobb = stablehlo.broadcast_in_dim %bo_3, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb3_mO = stablehlo.add %vitb3_mod, %vitb3_mobb : tensor<32x197x192xf32>
    %vitb3_r1 = stablehlo.add %vitb2_out, %vitb3_mO : tensor<32x197x192xf32>
    %vitb3_2sum = stablehlo.reduce(%vitb3_r1 init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb3_2nf = stablehlo.constant dense<192.0> : tensor<32x197xf32>
    %vitb3_2mu = stablehlo.divide %vitb3_2sum, %vitb3_2nf : tensor<32x197xf32>
    %vitb3_2mub = stablehlo.broadcast_in_dim %vitb3_2mu, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb3_2xc = stablehlo.subtract %vitb3_r1, %vitb3_2mub : tensor<32x197x192xf32>
    %vitb3_2sq = stablehlo.multiply %vitb3_2xc, %vitb3_2xc : tensor<32x197x192xf32>
    %vitb3_2vsum = stablehlo.reduce(%vitb3_2sq init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb3_2var = stablehlo.divide %vitb3_2vsum, %vitb3_2nf : tensor<32x197xf32>
    %vitb3_2eps = stablehlo.constant dense<1.0e-5> : tensor<32x197xf32>
    %vitb3_2ve = stablehlo.add %vitb3_2var, %vitb3_2eps : tensor<32x197xf32>
    %vitb3_2istd = stablehlo.rsqrt %vitb3_2ve : tensor<32x197xf32>
    %vitb3_2istdb = stablehlo.broadcast_in_dim %vitb3_2istd, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb3_2xhat = stablehlo.multiply %vitb3_2xc, %vitb3_2istdb : tensor<32x197x192xf32>
    %vitb3_2gb = stablehlo.broadcast_in_dim %g2_3, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb3_2bbc = stablehlo.broadcast_in_dim %b2_3, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb3_2gx = stablehlo.multiply %vitb3_2xhat, %vitb3_2gb : tensor<32x197x192xf32>
    %vitb3_2y = stablehlo.add %vitb3_2gx, %vitb3_2bbc : tensor<32x197x192xf32>
    %vitb3_ph1d = stablehlo.dot_general %vitb3_2y, %Wfc1_3, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x768xf32>) -> tensor<32x197x768xf32>
    %vitb3_ph1bb = stablehlo.broadcast_in_dim %bfc1_3, dims = [2] : (tensor<768xf32>) -> tensor<32x197x768xf32>
    %vitb3_ph1 = stablehlo.add %vitb3_ph1d, %vitb3_ph1bb : tensor<32x197x768xf32>
    %vitb3_pgx2 = stablehlo.multiply %vitb3_ph1, %vitb3_ph1 : tensor<32x197x768xf32>
    %vitb3_pgx3 = stablehlo.multiply %vitb3_pgx2, %vitb3_ph1 : tensor<32x197x768xf32>
    %vitb3_pgck = stablehlo.constant dense<0.044715> : tensor<32x197x768xf32>
    %vitb3_pgkx3 = stablehlo.multiply %vitb3_pgck, %vitb3_pgx3 : tensor<32x197x768xf32>
    %vitb3_pginn = stablehlo.add %vitb3_ph1, %vitb3_pgkx3 : tensor<32x197x768xf32>
    %vitb3_pgcsqrt = stablehlo.constant dense<0.7978845608028654> : tensor<32x197x768xf32>
    %vitb3_pgu = stablehlo.multiply %vitb3_pgcsqrt, %vitb3_pginn : tensor<32x197x768xf32>
    %vitb3_pgt = stablehlo.tanh %vitb3_pgu : tensor<32x197x768xf32>
    %vitb3_pgone = stablehlo.constant dense<1.0> : tensor<32x197x768xf32>
    %vitb3_pgopt = stablehlo.add %vitb3_pgone, %vitb3_pgt : tensor<32x197x768xf32>
    %vitb3_pgchalf = stablehlo.constant dense<0.5> : tensor<32x197x768xf32>
    %vitb3_pghx = stablehlo.multiply %vitb3_pgchalf, %vitb3_ph1 : tensor<32x197x768xf32>
    %vitb3_pga = stablehlo.multiply %vitb3_pghx, %vitb3_pgopt : tensor<32x197x768xf32>
    %vitb3_py2d = stablehlo.dot_general %vitb3_pga, %Wfc2_3, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x768xf32>, tensor<768x192xf32>) -> tensor<32x197x192xf32>
    %vitb3_py2bb = stablehlo.broadcast_in_dim %bfc2_3, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb3_py = stablehlo.add %vitb3_py2d, %vitb3_py2bb : tensor<32x197x192xf32>
    %vitb3_out = stablehlo.add %vitb3_r1, %vitb3_py : tensor<32x197x192xf32>
    %vitb4_1sum = stablehlo.reduce(%vitb3_out init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb4_1nf = stablehlo.constant dense<192.0> : tensor<32x197xf32>
    %vitb4_1mu = stablehlo.divide %vitb4_1sum, %vitb4_1nf : tensor<32x197xf32>
    %vitb4_1mub = stablehlo.broadcast_in_dim %vitb4_1mu, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb4_1xc = stablehlo.subtract %vitb3_out, %vitb4_1mub : tensor<32x197x192xf32>
    %vitb4_1sq = stablehlo.multiply %vitb4_1xc, %vitb4_1xc : tensor<32x197x192xf32>
    %vitb4_1vsum = stablehlo.reduce(%vitb4_1sq init: %sc) applies stablehlo.add across dimensions = [2] : (tensor<32x197x192xf32>, tensor<f32>) -> tensor<32x197xf32>
    %vitb4_1var = stablehlo.divide %vitb4_1vsum, %vitb4_1nf : tensor<32x197xf32>
    %vitb4_1eps = stablehlo.constant dense<1.0e-5> : tensor<32x197xf32>
    %vitb4_1ve = stablehlo.add %vitb4_1var, %vitb4_1eps : tensor<32x197xf32>
    %vitb4_1istd = stablehlo.rsqrt %vitb4_1ve : tensor<32x197xf32>
    %vitb4_1istdb = stablehlo.broadcast_in_dim %vitb4_1istd, dims = [0, 1] : (tensor<32x197xf32>) -> tensor<32x197x192xf32>
    %vitb4_1xhat = stablehlo.multiply %vitb4_1xc, %vitb4_1istdb : tensor<32x197x192xf32>
    %vitb4_1gb = stablehlo.broadcast_in_dim %g1_4, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb4_1bbc = stablehlo.broadcast_in_dim %b1_4, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb4_1gx = stablehlo.multiply %vitb4_1xhat, %vitb4_1gb : tensor<32x197x192xf32>
    %vitb4_1y = stablehlo.add %vitb4_1gx, %vitb4_1bbc : tensor<32x197x192xf32>
    %vitb4_mQd = stablehlo.dot_general %vitb4_1y, %Wq_4, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb4_mQbb = stablehlo.broadcast_in_dim %bq_4, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb4_mQ = stablehlo.add %vitb4_mQd, %vitb4_mQbb : tensor<32x197x192xf32>
    %vitb4_mKd = stablehlo.dot_general %vitb4_1y, %Wk_4, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb4_mKbb = stablehlo.broadcast_in_dim %bk_4, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb4_mK = stablehlo.add %vitb4_mKd, %vitb4_mKbb : tensor<32x197x192xf32>
    %vitb4_mVd = stablehlo.dot_general %vitb4_1y, %Wv_4, contracting_dims = [2] x [0], precision = [DEFAULT, DEFAULT] : (tensor<32x197x192xf32>, tensor<192x192xf32>) -> tensor<32x197x192xf32>
    %vitb4_mVbb = stablehlo.broadcast_in_dim %bv_4, dims = [2] : (tensor<192xf32>) -> tensor<32x197x192xf32>
    %vitb4_mV = stablehlo.add %vitb4_mVd, %vitb4_mVbb : tensor<32x197x192xf32>
    %vitb4_mQhr = stablehlo.reshape %vitb4_mQ : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb4_mQh = stablehlo.transpose %vitb4_mQhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb4_mKhr = stablehlo.reshape %vitb4_mK : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb4_mKh = stablehlo.transpose %vitb4_mKhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb4_mVhr = stablehlo.reshape %vitb4_mV : (tensor<32x197x192xf32>) -> tensor<32x197x3x64xf32>
    %vitb4_mVh = stablehlo.transpose %vitb4_mVhr, dims = [0, 2, 1, 3] : (tensor<32x197x3x64xf32>) -> tensor<32x3x197x64xf32>
    %vitb4_mS = stablehlo.dot_general %vitb4_mQh, %vitb4_mKh, batching_dims = [0, 1] x [0, 1], contracting_dims = [3] x [3], precision = [DEFAULT, DEFAULT] : (tensor<32x3x197x64xf32>, tensor<32x3x197x64xf32>) -> tensor<32x3x197x197xf32>
    %vitb4_mscl = stablehlo.constant dense<0.125> : tensor<32x3x197x197xf32>
    %vitb4_mSs = stablehlo.multiply %vitb4_mS, %vitb4_mscl : tensor<32x3x197x197xf32>
    %vitb4_mse = stablehlo.exponential %vitb4_mSs : tensor<32x3x197x197xf32>
    %vitb4_msum = stablehlo.reduce(%vitb4_mse init: %sc) applies stablehlo.add across dimensions = [3] : (tensor<32x3x197x197xf32>, tensor<f32>) -> tensor<32x3x197xf32>
    %vitb4_msumb = stablehlo.broadcast_in_dim %vitb4_msum, dims = [0, 1, 2] : (tensor<32x3x197xf32>) -> tensor<32x3x197x197xf32>
